-- phpMyAdmin SQL Dump
-- version 2.10.2
-- http://www.phpmyadmin.net
-- 
-- Host: localhost
-- Generation Time: Jul 23, 2009 at 04:15 AM
-- Server version: 5.0.67
-- PHP Version: 5.2.3

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";

-- 
-- Database: `a3k`
-- 

-- --------------------------------------------------------

-- 
-- Table structure for table `a3k_fellowshop`
-- 

DROP TABLE IF EXISTS `a3k_fellowshop`;
CREATE TABLE IF NOT EXISTS `a3k_fellowshop` (
  `fl_id` varchar(10) NOT NULL default '0',
  `p_at` int(10) unsigned NOT NULL,
  `p_df` int(10) unsigned NOT NULL,
  `p_agl` int(10) unsigned NOT NULL,
  `p_rankname` varchar(20) NOT NULL,
  `p_str` int(10) unsigned NOT NULL,
  `p_smart` int(10) unsigned NOT NULL,
  `p_vit` int(10) unsigned NOT NULL,
  `p_bone` int(10) unsigned NOT NULL,
  `p_name` varchar(20) NOT NULL,
  `p_hp` int(10) unsigned NOT NULL,
  `p_lv` int(10) unsigned NOT NULL,
  `p_img` varchar(30) NOT NULL,
  `p_hpmax` int(10) unsigned NOT NULL,
  `p_mn` int(10) unsigned NOT NULL,
  `p_mnmax` int(10) unsigned NOT NULL,
  `p_exp` int(10) unsigned NOT NULL,
  `p_nextexp` bigint(10) unsigned NOT NULL,
  `role_id` varchar(10) NOT NULL,
  `faith` int(10) unsigned NOT NULL,
  `f_tradedata` text COMMENT '武將合成資料JSON',
  `fl_cash` int(10) NOT NULL default '0',
  PRIMARY KEY  (`fl_id`),
  KEY `role_id` (`role_id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

-- 
-- Dumping data for table `a3k_fellowshop`
-- 

INSERT INTO `a3k_fellowshop` (`fl_id`, `p_at`, `p_df`, `p_agl`, `p_rankname`, `p_str`, `p_smart`, `p_vit`, `p_bone`, `p_name`, `p_hp`, `p_lv`, `p_img`, `p_hpmax`, `p_mn`, `p_mnmax`, `p_exp`, `p_nextexp`, `role_id`, `faith`, `f_tradedata`, `fl_cash`) VALUES 
('1', 100, 100, 100, '墨者', 100, 100, 100, 100, '革離', 100, 1, 'h0020', 100, 100, 100, 0, 10, 'a02', 100, NULL, 0),
('2', 100, 100, 100, '墨者', 100, 200, 100, 200, 'momo', 100, 1, 'h0050', 100, 100, 100, 100, 1000, 'a02', 0, NULL, 0),
('3', 20, 20, 10, '墨門弟子', 10, 10, 10, 10, '劉備', 50, 1, 'h0010', 50, 30, 30, 0, 100, 'b01', 10, NULL, 0),
('4', 20, 20, 10, '墨門弟子', 10, 10, 10, 10, '關羽', 50, 1, 'h0020', 50, 30, 30, 0, 100, 'a01', 10, NULL, 0),
('5', 20, 20, 10, '墨門弟子', 10, 10, 10, 10, '張飛', 50, 1, 'h0030', 50, 30, 30, 0, 100, 'a01', 10, NULL, 0),
('50', 20, 25, 15, '墨門弟子', 15, 10, 13, 20, '少年馬超', 50, 1, 'h0050', 50, 30, 30, 0, 100, 'a02', 10, NULL, 0),
('103', 82, 78, 45, '墨門弟子', 65, 18, 65, 52, '馬騰(土豪)', 113, 1, 'n0113', 113, 46, 46, 0, 100, 'c01', 10, '{"needGs":3000,"needs":[{"fl_id":"102","p_name":"史敬(墨者)","p_lv":18},{"fl_id":"101","p_name":"丸霖(習者)","p_lv":15}]}', 0),
('53', 34, 32, 10, '墨門弟子', 25, 5, 25, 25, '墨門小師弟', 72, 1, 'n0031', 72, 20, 20, 0, 100, 'b01', 10, NULL, 0),
('51', 20, 20, 12, '墨門弟子', 12, 13, 20, 11, '少年劉備', 50, 1, 'h0010', 50, 30, 30, 0, 100, 'b01', 10, NULL, 0),
('102', 60, 62, 25, '墨門弟子', 46, 16, 52, 37, '史敬(墨者)', 90, 1, 'n0044', 90, 42, 42, 0, 100, 'c01', 10, '{"needGs":1000,"needs":[{"fl_id":"53","p_name":"墨門小師弟","p_lv":7},{"fl_id":"101","p_name":"丸霖(習者)","p_lv":3}]}', 0),
('52', 20, 30, 5, '墨門弟子', 35, 5, 10, 35, '墨門護衛', 50, 1, 'n0031', 50, 30, 30, 0, 100, 'b01', 10, NULL, 0),
('6', 20, 20, 10, '墨門弟子', 10, 10, 10, 10, '諸葛亮', 50, 1, 'h0040', 50, 30, 30, 0, 100, 'a01', 10, NULL, 0),
('7', 20, 20, 10, '墨門弟子', 10, 10, 10, 10, '馬超', 50, 1, 'h0050', 50, 30, 30, 0, 100, 'a01', 10, NULL, 0),
('100', 70, 70, 18, '墨門弟子', 38, 12, 45, 40, '墨門習者', 50, 1, 'n0034', 95, 50, 30, 0, 100, 'b01', 10, NULL, 0),
('101', 46, 43, 18, '墨門弟子', 35, 10, 35, 32, '丸霖(習者)', 83, 1, 'n0352', 83, 30, 30, 0, 100, 'a01', 10, NULL, 1500),
('104', 62, 58, 25, '墨門弟子', 48, 15, 48, 38, '伍瓊', 92, 1, 'n0381', 92, 40, 40, 0, 100, 'a01', 10, NULL, 3500),
('105', 60, 61, 25, '墨門弟子', 46, 14, 51, 37, '董越', 96, 1, 'n0382', 96, 40, 40, 0, 100, 'a01', 10, NULL, 3500),
('106', 55, 63, 25, '墨門弟子', 42, 15, 52, 36, '劉囂', 98, 1, 'n0383', 98, 40, 40, 0, 100, 'a01', 10, NULL, 3500),
('107', 74, 77, 45, '墨門弟子', 58, 22, 65, 45, '楊彪', 102, 1, 'n0031', 102, 54, 54, 0, 100, 'c01', 10, NULL, 6000),
('108', 78, 73, 45, '墨門弟子', 61, 18, 61, 49, '段煨', 108, 1, 'n0032', 108, 46, 46, 0, 100, 'c01', 10, NULL, 6000),
('109', 76, 74, 45, '墨門弟子', 60, 18, 62, 52, '楊定', 108, 1, 'n0033', 108, 46, 46, 0, 100, 'c01', 10, NULL, 6000),
('110', 100, 106, 60, '墨門弟子', 80, 20, 90, 60, '王方', 125, 1, 'n0481', 125, 46, 46, 0, 100, 'c01', 10, NULL, 6000),
('111', 103, 106, 60, '墨門弟子', 82, 20, 90, 58, '胡軫', 122, 1, 'n0482', 122, 50, 50, 0, 100, 'c01', 10, NULL, 6000),
('112', 94, 98, 55, '墨門弟子', 75, 18, 83, 52, '李傕', 113, 1, 'n0050', 113, 46, 46, 0, 100, 'c01', 10, '{"needGs":1200,"needs":[{"fl_id":"104","p_name":"伍瓊","p_lv":8},{"fl_id":"105","p_name":"董越","p_lv":5}]}', 0),
('113', 96, 97, 55, '墨門弟子', 76, 18, 82, 54, '郭汜', 116, 1, 'n0051', 116, 46, 46, 0, 100, 'c01', 10, '{"needGs":1200,"needs":[{"fl_id":"104","p_name":"伍瓊","p_lv":8},{"fl_id":"106","p_name":"劉囂","p_lv":5}]}', 0),
('114', 97, 96, 55, '墨門弟子', 77, 18, 81, 55, '徐榮', 117, 1, 'n0052', 117, 46, 46, 0, 100, 'c01', 10, '{"needGs":1200,"needs":[{"fl_id":"106","p_name":"劉囂","p_lv":8},{"fl_id":"105","p_name":"董越","p_lv":5}]}', 0),
('115', 98, 95, 55, '墨門弟子', 78, 18, 80, 56, '楊奉', 119, 1, 'n0053', 119, 46, 46, 0, 100, 'c01', 10, '{"needGs":2500,"needs":[{"fl_id":"113","p_name":"郭汜","p_lv":15},{"fl_id":"107","p_name":"楊彪","p_lv":13}]}', 0),
('116', 103, 106, 60, '墨門弟子', 82, 20, 90, 59, '李肅', 123, 1, 'n0141', 123, 50, 50, 0, 100, 'b01', 10, '{"needGs":2500,"needs":[{"fl_id":"112","p_name":"李傕","p_lv":15},{"fl_id":"108","p_name":"段煨","p_lv":13}]}', 0),
('117', 100, 108, 60, '墨門弟子', 80, 20, 92, 60, '張濟', 123, 1, 'n0054', 123, 50, 50, 0, 100, 'c01', 10, '{"needGs":2500,"needs":[{"fl_id":"114","p_name":"徐榮","p_lv":15},{"fl_id":"109","p_name":"楊定","p_lv":13}]}', 0),
('118', 124, 135, 70, '墨門弟子', 100, 25, 115, 78, '樊稠(勇士)', 152, 1, 'n0101', 152, 60, 60, 0, 100, 'c01', 10, '{"needGs":3500,"needs":[{"fl_id":"121","p_name":"呼延慶","p_lv":22},{"fl_id":"117","p_name":"張濟","p_lv":15}]}', 0),
('119', 118, 129, 75, '墨門弟子', 95, 50, 110, 82, '李儒(儒生)', 158, 1, 'n0125', 158, 110, 110, 0, 100, 'b01', 10, '{"needGs":3500,"needs":[{"fl_id":"120","p_name":"牛輔","p_lv":22},{"fl_id":"116","p_name":"李肅","p_lv":15}]}', 0),
('120', 91, 95, 55, '墨門弟子', 72, 15, 80, 50, '牛輔', 110, 1, 'n0053', 110, 40, 40, 0, 100, 'c01', 10, NULL, 0),
('121', 88, 98, 55, '墨門弟子', 70, 18, 83, 51, '呼延慶', 111, 1, 'n0384', 111, 46, 46, 0, 100, 'a01', 10, NULL, 0),
('122', 142, 141, 76, '墨門弟子', 115, 30, 120, 86, '樊稠(武將)', 164, 1, 'n0101', 164, 70, 70, 0, 100, 'c01', 10, '{"needGs":4500,"needs":[{"fl_id":"118","p_name":"樊稠(勇士)","p_lv":25},{"fl_id":"110","p_name":"王方","p_lv":20}]}', 0),
('123', 136, 138, 82, '墨門弟子', 110, 65, 118, 90, '李儒(名士)', 170, 1, 'n0125', 170, 140, 140, 0, 100, 'b01', 10, '{"needGs":4500,"needs":[{"fl_id":"119","p_name":"李儒(儒生)","p_lv":25},{"fl_id":"111","p_name":"胡軫","p_lv":20}]}', 0),
('124', 153, 156, 85, '墨門弟子', 124, 31, 133, 95, '華雄(勇士)', 177, 1, 'n0191', 177, 72, 72, 0, 100, 'c01', 10, '{"needGs":55,"needs": [{"fl_id":"122","p_name":"樊稠(武將)","p_lv":30},{"fl_id":"103","p_name":"馬騰 (土豪)","p_lv":20},{"fl_id":"115","p_name":"楊奉","p_lv":10}]}', 0),
('125', 148, 150, 90, '墨門弟子', 120, 75, 128, 98, '賈詡(儒生)', 182, 1, 'n0131', 182, 160, 160, 0, 100, 'b01', 10, '{"needGs":5500,"needs": [{"fl_id":"123","p_name":"李儒(名士)","p_lv":30},{"fl_id":"103","p_name":"馬騰 (土豪)","p_lv":20},{"fl_id":"115","p_name":"楊奉","p_lv":10}]}', 0);
