-- phpMyAdmin SQL Dump
-- version 2.10.2
-- http://www.phpmyadmin.net
-- 
-- Host: 192.168.3.120
-- Generation Time: Jul 28, 2009 at 07:46 AM
-- Server version: 5.0.67
-- PHP Version: 5.2.3

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";

-- 
-- Database: `a3k`
-- 

-- --------------------------------------------------------

-- 
-- Table structure for table `a3k_items`
-- 

DROP TABLE IF EXISTS `a3k_items`;
CREATE TABLE IF NOT EXISTS `a3k_items` (
  `id` int(10) unsigned NOT NULL auto_increment,
  `item_id` varchar(10) NOT NULL,
  `item_name` varchar(20) NOT NULL default '--' COMMENT '名稱',
  `item_type1` smallint(5) unsigned NOT NULL default '0' COMMENT '物品類別1',
  `item_type2` smallint(5) unsigned NOT NULL default '0' COMMENT '物品類別2',
  `item_img` varchar(10) default NULL COMMENT '圖像名稱',
  `item_ef_at` int(10) unsigned default NULL COMMENT '攻擊力',
  `item_ef_df` int(10) unsigned default NULL COMMENT '防禦力',
  `item_ef_str` int(10) unsigned default NULL COMMENT '力量',
  `item_ef_bone` int(10) unsigned default NULL COMMENT '根骨',
  `item_ef_vit` int(10) unsigned default NULL COMMENT '體魄',
  `item_ef_agl` int(10) unsigned default NULL COMMENT '速度',
  `item_ef_smart` int(10) unsigned default NULL COMMENT '智力',
  `item_ef_hp` int(10) unsigned NOT NULL default '0' COMMENT 'HP',
  `item_ef_mn` int(10) unsigned NOT NULL default '0' COMMENT 'MN',
  `item_stackable` tinyint(1) default '0' COMMENT '可否堆疊',
  `item_storeid` varchar(10) default NULL COMMENT '商店',
  `item_tradable` tinyint(1) NOT NULL default '0' COMMENT '榜定',
  `item_desc` varchar(200) default NULL COMMENT '物品說明',
  `item_price` int(10) unsigned default '0' COMMENT '物品售價',
  `item_r_price` int(10) unsigned NOT NULL default '0' COMMENT '商城幣(0=不是商城物)',
  `item_mixable` text,
  PRIMARY KEY  (`id`),
  KEY `item_id` (`item_id`),
  KEY `item_storeid` (`item_storeid`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC AUTO_INCREMENT=101 ;

-- 
-- Dumping data for table `a3k_items`
-- 

INSERT INTO `a3k_items` (`id`, `item_id`, `item_name`, `item_type1`, `item_type2`, `item_img`, `item_ef_at`, `item_ef_df`, `item_ef_str`, `item_ef_bone`, `item_ef_vit`, `item_ef_agl`, `item_ef_smart`, `item_ef_hp`, `item_ef_mn`, `item_stackable`, `item_storeid`, `item_tradable`, `item_desc`, `item_price`, `item_r_price`, `item_mixable`) VALUES 
(1, 'a0001', '新手頭巾', 1, 1, 'a0011', 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 'NULL', 1, '新手使用的頭巾', 1, 0, NULL),
(2, 'a0002', '麻布頭巾', 1, 1, 'a0011', 0, 0, 0, 0, 10, 0, 0, 0, 0, 0, 'z01', 1, '麻布頭巾', 350, 0, NULL),
(3, 'a0003', '布帽', 1, 1, 'a0011', 0, 0, 0, 2, 7, 0, 0, 0, 0, 0, 'z01', 1, '布帽', 500, 0, NULL),
(4, 'a0004', '麻布帽', 1, 1, 'a0011', 0, 0, 0, 0, 15, 0, 0, 0, 0, 0, 'z01', 1, '麻布帽', 800, 0, NULL),
(5, 'a0005', '木製頭盔', 1, 1, 'a0011', 0, 0, 0, 0, 20, 0, 0, 0, 0, 0, 'z02', 1, '木製頭盔', 1200, 0, NULL),
(6, 'a0006', '蠶絲帽', 1, 1, 'a0011', 0, 0, 0, 5, 12, 0, 0, 0, 0, 0, 'z02', 1, '蠶絲帽', 2000, 0, NULL),
(7, 'a0007', '硬木頭盔', 1, 1, 'a0011', 0, 0, 0, 0, 25, 0, 0, 0, 0, 0, 'z02', 1, '硬木頭盔', 2500, 0, NULL),
(8, 'a0008', '破舊頭盔', 1, 1, 'a0011', 0, 0, 0, 0, 30, 0, 0, 0, 0, 0, 'NULL', 1, '破舊頭盔', 3000, 0, NULL),
(9, 'a0009', '鐵頭盔', 1, 1, 'a0011', 0, 0, 0, 8, 22, 0, 0, 0, 0, 0, 'NULL', 1, '鐵頭盔', 4000, 0, NULL),
(10, 'b0001', '新手服', 1, 2, 'b0011', 0, 0, 0, 0, 10, 0, 0, 0, 0, 0, 'NULL', 1, '新手使用的服裝', 1, 0, NULL),
(11, 'b0002', '麻布服', 1, 2, 'b0011', 0, 0, 0, 0, 15, 0, 0, 0, 0, 0, 'z01', 1, '麻布服', 350, 0, NULL),
(12, 'b0003', '布裝', 1, 2, 'b0011', 0, 0, 0, 0, 13, 2, 0, 0, 0, 0, 'z01', 1, '布裝', 500, 0, NULL),
(13, 'b0004', '麻布長袍', 1, 2, 'b0011', 0, 0, 0, 0, 20, 0, 0, 0, 0, 0, 'z01', 1, '麻布長袍', 800, 0, NULL),
(14, 'b0005', '皮製長袍', 1, 2, 'b0011', 0, 0, 0, 0, 25, 0, 0, 0, 0, 0, 'z02', 1, '皮製長袍', 1200, 0, NULL),
(15, 'b0006', '蠶絲長袍', 1, 2, 'b0011', 0, 0, 0, 0, 22, 5, 0, 0, 0, 0, 'z02', 1, '蠶絲長袍', 2000, 0, NULL),
(16, 'b0007', '皮甲', 1, 2, 'b0011', 0, 0, 0, 0, 30, 0, 0, 0, 0, 0, 'z02', 1, '皮甲', 2500, 0, NULL),
(17, 'b0008', '破舊鎧甲', 1, 2, 'b0011', 0, 0, 0, 0, 35, 0, 0, 0, 0, 0, 'NULL', 1, '破舊鎧甲', 3000, 0, NULL),
(18, 'b0009', '鐵鎧甲', 1, 2, 'b0011', 0, 0, 0, 0, 33, 7, 0, 0, 0, 0, 'NULL', 1, '鐵鎧甲', 4000, 0, NULL),
(19, 'c0001', '新手披肩', 1, 3, 'c0011', 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 'NULL', 1, '新手使用的披肩', 1, 0, NULL),
(20, 'c0002', '麻布披肩', 1, 3, 'c0011', 0, 0, 0, 0, 0, 0, 0, 10, 0, 0, 'z01', 1, '麻布披肩', 1000, 0, NULL),
(21, 'c0003', '布披肩', 1, 3, 'c0011', 0, 0, 0, 0, 0, 0, 0, 8, 10, 0, 'z02', 1, '布披肩', 2500, 0, NULL),
(22, 'c0004', '麻布披風', 1, 3, 'c0011', 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 'NULL', 1, '麻布披風', 800, 0, NULL),
(23, 'c0005', '皮製披風', 1, 3, 'c0011', 0, 0, 0, 0, 0, 0, 0, 10, 0, 0, 'NULL', 1, '皮製披風', 1200, 0, NULL),
(24, 'c0006', '蠶絲披風', 1, 3, 'c0011', 0, 0, 0, 0, 0, 0, 0, 8, 10, 0, 'NULL', 1, '蠶絲披風', 2000, 0, NULL),
(25, 'c0007', '獸皮披肩', 1, 3, 'c0011', 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 'NULL', 1, '獸皮披肩', 2500, 0, NULL),
(26, 'c0008', '狼皮披風', 1, 3, 'c0011', 0, 0, 0, 0, 0, 0, 0, 10, 0, 0, 'NULL', 1, '狼皮披風', 3000, 0, NULL),
(27, 'c0009', '虎皮披風', 1, 3, 'c0011', 0, 0, 0, 0, 0, 0, 0, 8, 10, 0, 'NULL', 1, '虎皮披風', 4000, 0, NULL),
(28, 'd0001', '新手鞋', 1, 4, 'd0033', 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 'NULL', 1, '新手使用的鞋', 1, 0, NULL),
(29, 'd0002', '麻布鞋', 1, 4, 'd0033', 0, 0, 0, 0, 10, 0, 0, 0, 0, 0, 'z01', 1, '麻布鞋', 350, 0, NULL),
(30, 'd0003', '布鞋', 1, 4, 'd0033', 0, 0, 0, 0, 7, 5, 0, 0, 0, 0, 'z01', 1, '布鞋', 500, 0, NULL),
(31, 'd0004', '麻布長鞋', 1, 4, 'd0033', 0, 0, 0, 0, 15, 0, 0, 0, 0, 0, 'z01', 1, '麻布長鞋', 800, 0, NULL),
(32, 'd0005', '皮鞋', 1, 4, 'd0033', 0, 0, 0, 0, 20, 0, 0, 0, 0, 0, 'z02', 1, '皮鞋', 1200, 0, NULL),
(33, 'd0006', '蠶絲鞋', 1, 4, 'd0033', 0, 0, 0, 0, 12, 8, 0, 0, 0, 0, 'z02', 1, '蠶絲鞋', 2000, 0, NULL),
(34, 'd0007', '皮製長鞋', 1, 4, 'd0033', 0, 0, 0, 0, 25, 0, 0, 0, 0, 0, 'z02', 1, '皮製長鞋', 2500, 0, NULL),
(35, 'd0008', '精緻皮鞋', 1, 4, 'd0033', 0, 0, 0, 0, 30, 0, 0, 0, 0, 0, 'NULL', 1, '精緻皮鞋', 3000, 0, NULL),
(36, 'd0009', '精緻短靴', 1, 4, 'd0033', 0, 0, 0, 0, 22, 10, 0, 0, 0, 0, 'NULL', 1, '精緻短靴', 4000, 0, NULL),
(37, 'e0001', '新手指環', 1, 5, 'e0031', 0, 0, 2, 0, 2, 0, 0, 0, 0, 0, 'NULL', 1, '新手使用的指環', 1, 0, NULL),
(38, 'e0002', '木製指環', 1, 5, 'e0031', 0, 0, 5, 0, 5, 0, 0, 0, 0, 0, 'z01', 1, '木製指環', 350, 0, NULL),
(39, 'e0003', '陶土指環', 1, 5, 'e0031', 0, 0, 2, 0, 2, 0, 0, 5, 5, 0, 'z01', 1, '陶土指環', 500, 0, NULL),
(40, 'e0004', '玉指環', 1, 5, 'e0031', 0, 0, 8, 0, 8, 0, 0, 0, 0, 0, 'z01', 1, '玉指環', 800, 0, NULL),
(41, 'e0005', '銀指環', 1, 5, 'e0031', 0, 0, 10, 0, 10, 0, 0, 0, 0, 0, 'z02', 1, '銀指環', 1200, 0, NULL),
(42, 'e0006', '鐵指環', 1, 5, 'e0031', 0, 0, 8, 0, 8, 0, 0, 10, 10, 0, 'z02', 1, '鐵指環', 2000, 0, NULL),
(43, 'e0007', '銅指環', 1, 5, 'e0031', 0, 0, 13, 0, 13, 0, 0, 0, 0, 0, 'z02', 1, '銅指環', 2500, 0, NULL),
(44, 'e0008', '青銅指環', 1, 5, 'e0031', 0, 0, 15, 0, 15, 0, 0, 0, 0, 0, 'NULL', 1, '青銅指環', 3000, 0, NULL),
(45, 'e0009', '翡翠指環', 1, 5, 'e0031', 0, 0, 13, 0, 13, 0, 0, 15, 15, 0, 'NULL', 1, '翡翠指環', 4000, 0, NULL),
(46, 'f0001', '新手劍', 1, 6, 'f0011', 0, 0, 10, 0, 0, 0, 0, 0, 0, 0, 'NULL', 1, '新手使用的劍', 1, 0, NULL),
(47, 'f0002', '木劍', 1, 6, 'f0011', 0, 0, 15, 0, 0, 0, 0, 0, 0, 0, 'z01', 1, '木劍', 350, 0, NULL),
(48, 'f0003', '短匕首', 1, 6, 'f0011', 0, 0, 13, 0, 0, 1, 0, 0, 0, 0, 'z01', 1, '短匕首', 500, 0, NULL),
(49, 'f0004', '柴刀', 1, 6, 'f0011', 0, 0, 20, 0, 0, 0, 0, 0, 0, 0, 'z01', 1, '柴刀', 800, 0, NULL),
(50, 'f0005', '長劍', 1, 6, 'f0011', 0, 0, 25, 0, 0, 0, 0, 0, 0, 0, 'z02', 1, '長劍', 1200, 0, NULL),
(51, 'f0006', '斧頭', 1, 6, 'f0011', 0, 0, 22, 0, 0, 3, 0, 0, 0, 0, 'z02', 1, '斧頭', 2000, 0, NULL),
(52, 'f0007', '長槍', 1, 6, 'f0011', 0, 0, 30, 0, 0, 0, 0, 0, 0, 0, 'z02', 1, '長槍', 2500, 0, NULL),
(53, 'f0008', '鐵劍', 1, 6, 'f0011', 0, 0, 35, 0, 0, 0, 0, 0, 0, 0, 'NULL', 1, '鐵劍', 3000, 0, NULL),
(54, 'f0009', '鐵斧', 1, 6, 'f0011', 0, 0, 33, 0, 0, 5, 0, 0, 0, 0, 'NULL', 1, '鐵斧', 4000, 0, NULL),
(55, 'g0001', '小補散', 2, 1, 'g0011', 0, 0, 0, 0, 0, 0, 0, 50, 0, 1, 'z01', 1, '小補散', 20, 0, NULL),
(56, 'g0002', '小補丹', 2, 1, 'g0011', 0, 0, 0, 0, 0, 0, 0, 80, 0, 1, 'z01', 1, '小補丹', 35, 0, NULL),
(57, 'g0003', '大補散', 2, 1, 'g0011', 0, 0, 0, 0, 0, 0, 0, 100, 0, 1, 'z01', 1, '大補散', 50, 0, NULL),
(58, 'g0004', '大埔丹', 2, 1, 'g0011', 0, 0, 0, 0, 0, 0, 0, 150, 0, 1, 'z01', 1, '大埔丹', 100, 0, NULL),
(59, 'g0005', '小還散', 2, 2, 'h0011', 0, 0, 0, 0, 0, 0, 0, 0, 30, 1, 'z01', 1, '小還散', 20, 0, NULL),
(60, 'g0006', '小還丹', 2, 2, 'h0011', 0, 0, 0, 0, 0, 0, 0, 0, 50, 1, 'z01', 1, '小還丹', 35, 0, NULL),
(61, 'g0007', '大還散', 2, 2, 'h0011', 0, 0, 0, 0, 0, 0, 0, 0, 80, 1, 'z01', 1, '大還散', 50, 0, NULL),
(62, 'g0008', '大還丹', 2, 2, 'h0011', 0, 0, 0, 0, 0, 0, 0, 0, 100, 1, 'z01', 1, '大還丹', 100, 0, NULL),
(63, 'g0009', '回春散', 2, 3, 'h0021', 0, 0, 0, 0, 0, 0, 0, 40, 40, 1, 'z01', 1, '回春散', 40, 0, NULL),
(64, 'g0010', '回春丹', 2, 3, 'h0021', 0, 0, 0, 0, 0, 0, 0, 100, 100, 1, 'z01', 1, '回春丹', 80, 0, NULL),
(65, 'h0001', '雜物', 3, 1, 'k0001', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 1, '雜物', 5, 0, NULL),
(66, 'h0002', '淬鍊石', 3, 1, 'e0021', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 1, '淬鍊石', 1000, 0, NULL),
(67, 'h0003', '粗鐵礦', 3, 1, 'e0021', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 1, '粗鐵礦', 1000, 0, NULL),
(68, 'h0004', '皮革', 3, 1, 'k0006', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 1, '皮革', 1000, 0, NULL),
(69, 'h0005', '玉石', 3, 1, 'e0021', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 1, '玉石', 1000, 0, NULL),
(70, 'h0006', '鐵礦', 3, 1, 'e0021', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 1, '鐵礦', 1000, 0, '{"needGs":300,"needs":[{"item_id":"h0003","item_name":"粗鐵礦","num":5}]}'),
(71, 'i0001', '山賊的密件', 3, 2, 'k0001', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 0, '山賊的密件', 0, 0, NULL),
(72, 'i0002', '山賊頭目的首級', 3, 2, 'k0007', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 0, '山賊頭目的首級', 0, 0, NULL),
(73, 'i0003', '王小妹的髮飾', 3, 2, 'e0051', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 0, '王小妹的髮飾', 0, 0, NULL),
(74, 'i0004', '羌族軍事情報', 3, 2, 'k0001', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 0, '羌族軍事情報', 0, 0, NULL),
(75, 'i0005', '羌王求救信', 3, 2, 'k0001', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 0, '羌王求救信', 0, 0, NULL),
(76, 'i0006', '羌族參謀信物', 3, 2, 'e0021', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 0, '羌族參謀信物', 0, 0, NULL),
(77, 'i0007', '羌營配置圖(內營)', 3, 2, 'k0016', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 0, '羌營配置圖(內營)', 0, 0, NULL),
(78, 'i0008', '羌營配置圖(外營)', 3, 2, 'k0017', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 0, '羌營配置圖(外營)', 0, 0, NULL),
(79, 'i0009', '羌族之王首級', 3, 2, 'k0007', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 0, '羌族之王首級', 0, 0, NULL),
(80, 'i0010', '劇毒蛇膽', 3, 2, 'h0011', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 0, '劇毒蛇膽', 0, 0, NULL),
(81, 'i0011', '董老闆的古董', 3, 2, 'l0011', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 0, '董老闆的古董', 0, 0, NULL),
(82, 'i0012', '太平人公令', 3, 2, 'k0020', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 0, '太平人公令', 0, 0, NULL),
(83, 'i0013', '黃色頭巾', 3, 2, 'a0061', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 0, '黃色頭巾', 0, 0, NULL),
(84, 'i0014', '黑風解毒藥', 3, 2, 'g0061', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 0, '黑風解毒藥', 0, 0, NULL),
(85, 'i0015', '假古董', 3, 2, 'k0019', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 0, '假古董', 0, 0, NULL),
(86, 'i0016', '假字畫', 3, 2, 'l0071', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 0, '假字畫', 0, 0, NULL),
(87, 'i0017', '洛陽守軍服飾', 3, 2, 'b0022', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 0, '洛陽守軍服飾', 0, 0, NULL),
(88, 'i0018', '洛陽守軍令牌', 3, 2, 'e0042', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 0, '洛陽守軍令牌', 0, 0, NULL),
(89, 'i0019', '值錢的商品', 3, 2, 'e0012', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 0, '值錢的商品', 0, 0, NULL),
(90, 'i0020', '吳禾重的信物', 3, 2, 'f0072', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 0, '吳禾重的信物', 0, 0, NULL),
(91, 'i0021', '口令', 3, 2, 'k0001', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 0, '口令', 0, 0, NULL),
(92, 'i0022', '禁軍令牌', 3, 2, 'k0001', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 0, '禁軍令牌', 0, 0, NULL),
(93, 'i0023', '天公旗', 3, 2, 'l0054', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 0, '天公旗', 0, 0, NULL),
(94, 'i0024', '地公旗', 3, 2, 'l0055', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 0, '地公旗', 0, 0, NULL),
(95, 'i0025', '人公旗', 3, 2, 'l0056', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 0, '人公旗', 0, 0, NULL),
(96, 'i0026', '人公將軍頭盔', 3, 2, 'a0013', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 0, '人公將軍頭盔', 0, 0, NULL),
(100, 'j0002', '商城大還散', 2, 2, 'k0008', 0, 0, 0, 0, 0, 0, 0, 0, 160, 1, 'sp', 1, '大還散', 1, 20, NULL),
(99, 'j0001', '商城大補散', 2, 1, 'k0008', 0, 0, 0, 0, 0, 0, 0, 200, 0, 1, 'sp', 1, '大補散', 1, 10, NULL),
(98, 'i0028', '太平要術摘要', 3, 2, 'l0041', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 0, '太平要術摘要', 0, 0, NULL),
(97, 'i0027', '黃巾', 3, 2, 'a0061', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'NULL', 0, '黃巾', 0, 0, NULL);
