-- phpMyAdmin SQL Dump
-- version 2.10.2
-- http://www.phpmyadmin.net
-- 
-- Host: localhost
-- Generation Time: Jul 24, 2009 at 06:26 AM
-- Server version: 5.0.67
-- PHP Version: 5.2.3

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";

-- 
-- Database: `a3k`
-- 

-- --------------------------------------------------------

-- 
-- Table structure for table `a3k_quest`
-- 

DROP TABLE IF EXISTS `a3k_quest`;
CREATE TABLE IF NOT EXISTS `a3k_quest` (
  `q_id` varchar(10) NOT NULL,
  `q_title` varchar(50) default NULL,
  `q_requester` varchar(20) default NULL,
  `q_img` varchar(10) default NULL,
  `q_map_name` varchar(20) default NULL,
  `q_map_id` varchar(10) default NULL,
  `q_show_lv` int(10) default NULL,
  `q_description` text,
  `q_dest_map` varchar(50) default NULL,
  `q_expireTime` int(10) default NULL,
  `q_type` tinyint(3) NOT NULL default '1',
  `q_instant` tinyint(3) NOT NULL default '1',
  PRIMARY KEY  (`q_id`),
  KEY `q_map_id` (`q_map_id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- 
-- Dumping data for table `a3k_quest`
-- 

INSERT INTO `a3k_quest` (`q_id`, `q_title`, `q_requester`, `q_img`, `q_map_name`, `q_map_id`, `q_show_lv`, `q_description`, `q_dest_map`, `q_expireTime`, `q_type`, `q_instant`) VALUES 
('q00001', '墨門成年禮(一)', '墨雲師父', 'n0062', '墨家邨', 'z01', 1, '墨門的弟子們，你們修練也有一段時間了，為師該傳授的也都教了。自古有云：「師父領進門，修行在個人。」現在是該畢業，闖蕩江湖的時候了！所有墨門弟子都要經過成年禮的試煉，飛熊山麓是為師給你們的第一場試驗。所以好徒兒們，快動身前往飛熊山麓去吧！活用所學，挑戰自我，發揚墨家，兼愛天下！', '飛熊山麓', NULL, 1, 0),
('q00002', '墨門成年禮(二)', '墨雲師父', 'n0062', '墨家邨', 'z01', 1, '好徒兒們，冬季過後，夏季來臨，為師要提醒你們，飛熊山麓的野熊也正飢腸轆轆地等著大快朵頤鮮美的人肉。已傳聞有些居民們遇害了！因此為師要正在飛熊山麓修練的你們，保護當地居民，免受野熊的傷害。當然這些野熊也不是好惹的，為師希望你們別太大意而成了野熊肚中物！', '飛熊山麓', NULL, 1, 0),
('q00003', '墨門成年禮(三)', '墨雲師父', 'n0062', '墨家邨', 'z01', 1, '墨雲師父說：「徒兒們，為師接到當地居民的感謝之函，知道你們順利的擊退了野熊。但天災除去，人禍卻不斷，飛熊山道一直以來都是居民來往城鎮的重要道路，如今卻被一票山賊雜兵蠻橫的佔據，這群山賊雜兵，目無章法，強奪這些孱弱村民的錢財，墨門不能不管，所以為師要你們去替村民出口氣！」', '飛熊山道', NULL, 1, 0),
('q00004', '墨門的歷史', '墨雲師父', 'n0062', '墨家邨', 'z01', 5, '墨門起於戰國時期，在戰亂紛紜、百家爭鳴的年代，墨門弟子為了徹底實行墨門宗旨「兼愛天下」，於是處處奔走幫助弱小國家抵抗強國的威迫，但也因如此犧牲掉了許多優秀的墨門弟子。為了不再這樣無謂的犧牲下去，墨門師父決定帶著墨門弟子退居朝政，專心修練兵法與武技。直至三國，亂世再起，墨門師父決定重返江湖，拯救蒼生，發陽墨門精神！', '飛熊山道', NULL, 1, 0),
('q00005', '墨門的組織', '墨雲師父', 'n0062', '墨家邨', 'z01', 6, '墨門組織分為三層：習者、墨者、鉅子。一開始為習者，便是學習修練基本功夫，等修練到了一定的程度後，將能通過測驗晉升為墨者，墨者即是藉著基本功夫的靈活運用搭配著不同武器的使用，藉以提身自己的能力後，再度晉升成為鉅子，鉅子已具有善用武將，練功練法的能力了。', '飛熊山道', NULL, 1, 1),
('q00006', '成為墨門習者(一)', '墨雲師父', 'n0062', '墨家邨', 'z01', 6, '這批在飛熊山麓被降伏的山賊雜兵因為貪生怕死，不惜出賣自己的組織，說出了組織正秘密策畫的叛亂活動。不過這些低下的山賊知道的只是些皮毛，所以墨雲師父說：「徒兒你們可要精明點，在與山賊雜兵作戰時，除了降伏他們之外，不要忘了最重要的是要多打探些他們密謀的線索出來。」', '飛熊山道', NULL, 1, 0),
('q00007', '成為墨門習者(二)', '墨雲師父', 'n0062', '墨家邨', 'z01', 6, '墨門弟子殺了個山賊們處處竄逃，取得山賊手中的密件後，發現山賊中還有一批山賊精兵潛伏於飛熊山道中做接應，雖然還不太明瞭這群山賊精兵在搞什麼花樣，但看那獐頭鼠目的臉孔就知道不是什麼好東西，想的一定是什麼邪門歪道，所以快捉些山賊精兵來問問，看他們在變什麼蚊子。', '飛熊山道', NULL, 1, 0),
('q00008', '成為墨門習者(三)', '墨雲師父', 'n0062', '墨家邨', 'z01', 6, '在一番殘酷襪子塞嘴的盤問後，山賊精兵說出了山賊頭目想霸佔整各山熊飛麓的想法。這沒腦袋的山賊頭目色慾薰心的以為我墨門會放任他胡作非為，墨雲師父在知道那山賊頭目滿肚的壞水後說：「徒兒們，去把這山賊頭目給打了！這山賊頭目正好也可成為你們晉升墨門習者的試煉！」', '飛熊山道', NULL, 1, 0),
('q00009', '涼州惡霸', '王大娘', 'n0510', '墨家邨', 'z01', 11, '董卓姪兒董簧搶了我的女兒後，前往金城，老婦拜託墨門的壯士們快快前往金城沙漠看能不能追到董卓姪兒，以及收集到他擄人的證據！', '金城沙漠', NULL, 1, 0),
('q00010', '為民除霸', '王大娘', 'n0510', '墨家邨', 'z01', 11, '王大娘哭著跑來說：「墨雲師父救命啊！我那不滿18歲的小女兒，被那董卓的姪兒董簧給搶走了！」（董簧，董卓的姪兒，平日仗勢欺人，最愛強奪良家婦女，納為己下，當地居民私下給了他一個綽號叫「梁州一霸」）墨雲師父聽了老婦請求後，要小師叔快馬傳令墨門弟子：「墨門弟子，為師要你們快幫王大娘去懲罰那個仗勢欺人的惡混。」', '金城沙漠', NULL, 1, 0),
('q00011', '惡霸復仇', '王大娘', 'n0510', '墨家邨', 'z01', 11, '墨門弟子接到墨雲師父的指令，趨馬追趕涼州一霸。遇到董簧後，不客氣的給了他一頓教訓！董簧被墨門弟子教訓後，覺得面子都丟光了，咽不下這口氣，帶了涼州士兵與涼州校尉前來報仇。墨雲師父知道後，派墨家弟子到王大娘家去阻止這一場尋仇之舉。', '金城沙漠', NULL, 1, 0),
('q00012', '董氏家將(一)', '李儒', 'n0130', '墨家邨', 'z01', 12, '墨門弟子跟董簧一番廝鬥後，董簧果然不敵墨門弟子的攻擊。這時，董卓女婿李儒，得知董簧又再外惹事生非。李儒也來到王大娘家，看董簧已被打趴在地，吐著血。李儒看了看情形，為了維護董家的聲望，便派出涼州精兵校尉與涼州校尉抵擋墨門弟子。更與墨門弟子提出三戰之約，若是墨門弟子戰敗，則需放過董簧；若墨門子弟戰勝，那董家孽子將不可再有尋仇之舉！', '金城沙漠', NULL, 1, 0),
('q00013', '董氏家將(二)', '李儒', 'n0130', '墨家邨', 'z01', 12, '王大娘瑟縮在旁，一聽李儒說完，便走到了墨門弟子身旁說：「墨門大俠，您就答應了吧！」這時李儒邊等回應邊來回踱步盤算著，要怎能打贏這場戰。墨門弟子答應了李儒的要求，李儒便轉身跟董家的武將們說：「待會張濟你帶著你的涼州精兵校尉先上，探探對方的實力到哪？對了，可別戰死丟我董家臉，保著命，留得青山在，不怕沒材燒！」', '金城沙漠', NULL, 1, 0),
('q00014', '董氏家將(三)', '李儒', 'n0130', '墨家邨', 'z01', 13, '刀光劍影，吭吭鏘鏘，血四處飛濺，張濟似乎抵擋不了！這時張濟一個不注意，被墨門弟子用刀一揮，胸前濺出了一到鮮紅的液體，張濟一摸，自知自己的武藝強不過別人，想起李儒剛剛說的：「留得青山在，不怕沒材燒，要是為了董簧那個狗娘養的，丟了一條命！也太不值了！」於是張濟拿出一條小內褲說：「我認輸了！」這時李儒知道墨門子弟果然厲害，叫樊稠等家將快出來迎戰！結果樊稠也不敵墨門弟子！最後，李儒：「墨門大俠，果然舞藝驚人，李儒我深感佩服，我這就遵守約定，閃人！」', '金城沙漠', NULL, 1, 0),
('q00015', '涼州刺史(ㄧ)', '中郎將牛輔', 'n0423', '墨家邨', 'z01', 13, '牛輔得知墨門子弟武功非凡，若能與我董家結合，將來鐵定會不得了。便向李儒打探墨門子弟在哪？李儒說完後，牛輔飛的似到王家附近，巧遇到墨門子弟一行人。牛輔拉住韁繩，躍下馬背，報上自己來頭後說：「聽聞壯士您，武藝高強，您可知董卓一家乃江東大戶，董大人愛好結交天下俠客，若是您不嫌棄，我可以引薦您與董卓認識，想在三國飛黃騰達，這可是難能可貴的機會！', '墨家邨', NULL, 1, 1),
('q00016', '涼州刺史(二)', '董卓', 'n0251', '墨家邨', 'z01', 14, '墨門弟子在接受牛輔的意見後，與董卓相識。最近涼州不斷有金城羌族來騷擾，董卓心想可藉此機會試試墨門弟子的身手。董卓說：「傳聞墨門弟子武藝高強，平日行俠仗義。最近金城雜兵不安分想造反，騷擾涼州一帶居民。因此我希望你能為涼州百姓挺身而出，教訓那些金城雜兵一番。假若你通過我的試驗，我將會派遣中郎將牛輔隨你征討外族去。', '金城沙漠', NULL, 1, 0),
('q00017', '金城羌族', '董卓', 'n0251', '墨家邨', 'z01', 14, '在董卓確認墨門子弟的能力後說：「你不愧是墨門的勇猛武將，董卓我佩服佩服。因為最近羌族派出了很多金城雜兵，放任他們四處做虐，搞得民不聊生，所以我希望你快快加入與金城羌族的戰鬥之中，讓金城羌族別再騷擾我涼州人民了！', '金城沙漠', NULL, 1, 0),
('q00018', '羌族的陰謀', '董卓', 'n0251', '墨家邨', 'z01', 15, '在與金城雜兵對戰的過程中，董卓意外發現羌族除了騷擾涼州人民外，似乎還別有企圖，董卓嗅出一股不尋常之味，知道這羌族不是省油之燈，一定有什麼秘密，如果不快點查清楚，將來一定會是個禍患。董卓說：「墨門壯士們，這羌族狡猾多端，想必還另有企圖在，所以我希望你潛入金城羌營後，能從羌族參謀中得到軍事情報，讓我們知彼知敵，百戰百勝！」', '金城沙漠', NULL, 1, 0),
('q00019', '金城羌王來襲', '董卓', 'n0251', '墨家邨', 'z01', 16, '軍事情報到手後，發現原來這金城羌王早已秘密來到羌營，準備親自指揮作戰。情報中得知，羌王一直暗中要人訓練一組先鋒人馬，作為特攻隊。因此董卓招集墨門弟子說：「據情報得知，羌族老王訓練了一組先鋒隊，這羌族先鋒一定要先攻破，不然一定會威脅我軍，因此我希望你能先幫我擊破對方要害，讓我軍能直搗黃龍，逮那羌族老王！」', '金城羌營', NULL, 1, 0),
('q00020', '包圍羌王', '董卓', 'n0251', '墨家邨', 'z01', 16, '董卓再得知羌營的糧倉儲存著滿滿的糧食後，心想那羌族已作好長期與我們抗戰的決心了！要是能佔領了那羌族的糧倉，讓他們沒飯可吃，我看再強的戰士，也只能當軟腳蝦份了！董卓立刻叫來墨門弟子說：「為了不要消耗我方太多戰力，我想那糧倉的佔領將會成了戰局成敗的關鍵！因此一定打敗羌族護糧軍要拿下糧倉！」', '金城羌營', NULL, 1, 0),
('q00021', '攻打金城', '董卓', 'n0251', '墨家邨', 'z01', 16, '墨門弟子到了金城，佔領了糧倉後，便與涼州軍官一起，打算一舉消滅羌王。而董卓在得知羌王身邊有金城精兵校尉帶著一群金城精兵保護著。董卓便跟墨門弟子說：「要拿下老羌王，似乎沒這麼容易，那老賊身旁有一堆精兵保護著，想逮到羌王，得先破了那些精兵，所以要辛苦你了，不過這些精兵不會是你的對手的！」', '金城羌營', NULL, 1, 0),
('q00022', '追擊羌王', '董卓', 'n0251', '墨家邨', 'z01', 21, '在墨門弟子大破精兵，快能逮到羌王時，董卓不慎讓羌王逃脫。董卓為了自己的大意，氣的三天三夜無法入眠。所以董卓只好再拜託墨門弟子說：「我董卓一生謹慎，結果不小心大意，讓羌王給逃了！我董卓深知，若不抓了到羌王，我涼州人民便不能安穩入睡。所以我要你快與涼州官兵一同追擊，帶人在羌族根據地進行地毯式搜索，掃蕩所有的餘賊。」', '羌族根據地', NULL, 1, 0),
('q00023', '羌王求援', '董卓', 'n0251', '墨家邨', 'z01', 21, '墨門弟子與涼州軍官掃蕩羌族根據地的時候，羌王得知董卓不會放過自己，而自己目前軍力所剩無幾，若不快點向外尋求救援，將難逃一死！董卓獲得線報，羌王正秘密向外求。董卓怎能讓羌王得逞，因此告訴墨門弟子說：「你一定要擊敗羌族信差，斬斷這些外援管道，免得羌王壯大勢力後，要剷除就難了！」', '羌族根據地', NULL, 1, 0),
('q00024', '羌族猛虎', '董卓', 'n0251', '墨家邨', 'z01', 23, '涼州軍官在搜索的過程中，不知羌族中還飼養著一群猛虎，這猛虎牙齒鋒利，速度敏捷，力大無窮，一般人根本無法抵擋猛虎的攻擊，而這群涼州軍官遇到猛虎，死傷慘重！董卓得知後便昭傳墨門弟子說：「猛虎讓我討伐部隊死傷慘重，因此還是需要借用你的天生神力，殺了這群猛虎，為我軍開路。」', '羌族根據地', NULL, 1, 0),
('q00025', '羌營配置圖', '董卓', 'n0251', '墨家邨', 'z01', 23, '為了不讓這狡猾的羌王再次逃脫，因此得先取得羌兵統領身上具有詳細記載羌營部屬的內、外配置圖。所以墨門弟子請你快去想辦法從駐守金城羌營的羌兵統領身上取來。', '羌族根據地', NULL, 1, 0),
('q00026', '羌王的末日(一)', '董卓', 'n0251', '墨家邨', 'z01', 23, '天時地利人和，萬事俱全，但還一有個隱憂，即是羌王身邊的軍師與羌族大將，要是能除掉它們，那羌王就成了我的囊中之物，就算天兵神將也救不了他了！', '羌族根據地', NULL, 1, 0),
('q00027', '羌王的末日(二)', '董卓', 'n0251', '墨家邨', 'z01', 23, '終於來到了決戰的時刻，緊張~緊張~刺激~刺激！董卓一聲下令：「誰先取到羌王的那顆腦袋，董卓我讓他一生榮華富貴享用不盡！是壯士的就狠狠的衝吧！」董卓說完後，墨門弟子帶著一行武將，快馬奔馳，衝向前殺敵去！', '羌族根據地', NULL, 1, 0),
('q00028', '前往雍州', '董卓', 'n0251', '墨家邨', 'z01', 24, '墨門弟子取得羌王的首級後，董卓興奮不己，設宴慶祝，那流水席整整辦了七天！董卓深知自己無法留下墨門弟子，但還是勇敢的問說：「留下～或我跟你走！」墨門弟子：「不～我不能留下，你也不能跟我走！你還有你的大事要做！你乖！」董卓難過的說：「好吧！你若想前往雍州遊歷，那可要小心喔！我們來日再相會了！啾～」', '羌族根據地', NULL, 1, 1),
('q00029', '救人如救火', '吳老伯', 'n0341', '雍州府(城鎮)', 'z02', 26, '吳老伯七十歲生了個兒子！結果這兒子卻得了怪病，吳老伯得知大賢良師的徒弟馬扁子會治這種怪病。便去找了馬扁子。馬扁子跟他說：「吳老伯，你兒這怪病只有隴西郡城周圍的劇毒蛇膽才能醫治，不過毒蛇兇猛，難抓喔！你還是請墨門弟子幫幫你吧！」吳老伯一聽，便起身去拜託墨門弟子。', '隴西郡城', NULL, 1, 0),
('q00030', '生病的刺史', '邢師爺', 'n0242', '雍州府(城鎮)', 'z02', 26, '邢師爺是雍州刺史的師爺，雍州刺使因為平日積勞過度，加上前陣子寒流來，受了風寒，就這樣一病不起。師爺這時想起刺使跟李傕是昔日同窗好友，因此求助李傕。李傕得知消息後便跟墨門弟子說：「墨門弟子啊！目前我分身乏術，無法前往雍州，可否請你幫幫我的老友，懲治那些騎著隴西響馬的隴西悍匪，讓我老友能安心養病！」', '隴西郡城', NULL, 1, 0),
('q00031', '協助邢師爺', '邢師爺', 'n0242', '雍州府(城鎮)', 'z02', 26, '墨門弟子來到了雍州，看那刺史的病情是越來越嚴重，不是一天兩天就可痊癒的。而邢師爺在求助無門之下，相信只有悲天憫人的太平道可以施法醫治刺使。因此決定加入太平道，請張太師救救刺使。可是要張大師出馬必須得籌措大筆金錢，邢師爺拜託墨門弟子在他籌措的這段時間內，能幫忙刺使維持當地的治安，守護隴西郡城！', '隴西郡城', NULL, 1, 0),
('q00032', '白衣大耳少年', '白衣大耳少年', 'h0010', '雍州府(城鎮)', 'z02', 26, '在刺使生病，師爺衝錢的這幾天，雍州來了個身穿白衣的神秘大耳少年。墨門弟子看這少年有如小飛象的雙耳，心想這不是仙人下凡，就是妖魔轉世。少年說刺史的病與最近雍州百姓遇到的事情並不尋常，想知道發什麼事，要隨他一起行動。於是兩人決定同行，但在路途中卻遇到了一群可疑的悍匪首腦，因此展開了激烈的戰鬥！', '隴西郡城', NULL, 1, 0),
('q00033', '是病還是毒', '白衣大耳少年', 'h0010', '雍州府(城鎮)', 'z02', 26, '少年又對墨門弟子說：「他在幽州時，聽說民間正流行著一種毒，吃了身體發軟，頭發暈，只能躺不能坐，只能吃不能拉！像個活死人似的！而這種毒只有太平道中人才有」耳少年又說：「想混入太平道並不容易，太平道之人皆以『太平人公令』作為辨識！」墨門弟子一想，看來是要到太平道近處，想辦法擊敗可疑的悍匪首領拿到『太平人公令』才行。', '隴西郡城', NULL, 1, 0),
('q00034', '可疑的太平道', '白衣大耳少年', 'h0010', '雍州府(城鎮)', 'z02', 27, '可疑的首腦捉到後，還是沒有辦法明確得知刺使是否真的被太平道的人下了毒。這時大耳少年提議，要不先去悍匪的巢穴「黑風洞」看看裡面有沒有殘留些蛛絲馬跡，結果看到了一批黑風悍匪駐守在那，得先擊敗他們才能更進一步得知消息。', '隴西郡城', NULL, 1, 0),
('q00035', '用毒高手', '白衣大耳少年', 'h0010', '雍州府(城鎮)', 'z02', 31, '墨門弟子與大耳少年一行人在黑風洞與悍匪廝殺一番後。大耳少年突然，啊～的一聲，叫了出來。這時少年已中毒倒在地了。墨門弟子看了少年，全身癱軟的症狀跟雍州刺史相似，看來太平道下毒之事是假不了了！而要能完全解毒，得找到解毒高手才行，光靠解毒丸是撐不了多久的！', '黑風洞', NULL, 1, 0),
('q00036', '強奪解毒藥', '白衣大耳少年', 'h0010', '雍州府(城鎮)', 'z02', 31, '墨門弟子看著少年心想：「生雞蛋的沒有，放雞屎的一堆！我這要去哪找解毒高手？」煩惱的同時，突然發現山賊的俘虜在旁。俘虜對著墨門弟子說：「我們在這裡被關了半把個月了，聽到土匪們說：『他們要與太平道合作，在雍州培植太平道的兵力』還有這毒是黑風副洞主所研製的，他手中有解毒劑，所以只要打敗他，那個躺在那邊喘氣的人就有救了！', '黑風洞', NULL, 1, 0),
('q00037', '清除黑風惡勢力', '白衣大耳少年', 'h0010', '雍州府(城鎮)', 'z02', 31, '大耳少年吃了解藥清醒後，非常感謝墨門弟子的相救。墨門弟子要他不用放在心上。墨門弟子對大耳少年說：「沒有時間喇賽了！我們要快點殺了黑風洞主與其他副堂主，然後回到雍州剷除剩餘黑風勢力。」於是又是一番砍砍殺殺。', '黑風洞', NULL, 1, 0),
('q00038', '俘虜馬扁子', '白衣大耳少年', 'h0010', '雍州府(城鎮)', 'z02', 31, '墨門弟子和白衣少年回到了雍州後，把解藥給了刺使，刺使服下之後，病情大為好轉。依目前所知的線索，確定黑風惡勢力與太平道相互勾結，為了了解太平道全盤計畫，太賢良師的徒弟馬扁子可是個重要線報來源。馬扁子最近帶著一批護衛兵出沒在雍州，因此先把他的護衛兵殺了把他擄來，從他嘴中探出點消息才是王道！', '黑風洞', NULL, 1, 0),
('q00039', '安定市集', '白衣大耳少年', 'h0010', '雍州府(城鎮)', 'z02', 36, '馬扁子被捉後 。大耳少年：「這馬狗子，狡猾嘴硬，不肯吐漏半字，該怎麼辦好呢？」墨門弟子說：「交給我！」不到半個時辰，馬扁子乖乖的供出了太平道機密，並答應降伏於墨門弟子之下。少年接著說：「馬扁子說太平道不只覬覦雍州，連天子腳下的司隸也虎視眈眈看著，所以咱門必須趕往司隸，阻止叛亂。', '安定市集', NULL, 1, 0),
('q00040', '再探安定', '白衣大耳少年', 'h0010', '雍州府(城鎮)', 'z02', 36, '大耳少年到了安定市集探查太平道的消息，走到包子攤前，發現這包子老闆神色詭異，不好好蒸包子，老用手拈著他的臉上大黑痣上的毛。結果一看整個市集裡怎麼每個老闆臉上都長毛，而且探頭探耳，古怪不已。原來這些都是太平道的黃巾密探。白衣少年對著墨門弟子說：「看來我們身邊多了一堆鼠輩，不宰了這些，恐怕不好行動！」', '安定市集', NULL, 1, 0),
('q00041', '危險的市集', '白衣大耳少年', 'h0010', '雍州府(城鎮)', 'z02', 36, '白耳少年和墨門弟子捉了幾個鼠輩一問之下，發現安定市集根本就是個鼠窩，是太平道在雍州擴張勢力的指揮中心，難怪這些攤販老闆個個面露殺氣，滿臉橫肉還長毛，佯裝成黑店老闆利用假古董與字畫詐取錢財，擴充太平道的叛亂資金。大耳少年：「我們得擊敗黑店老闆，搶奪那些假字畫，以防他們再騙人錢財。」', '安定市集', NULL, 1, 0),
('q00042', '包圍安定市集', '白衣大耳少年', 'h0010', '雍州府(城鎮)', 'z02', 37, '大耳少年與墨門弟子，東搶西搶大搶特搶，瘋狂的搶，瞞天過海的搶，搶完收集了足夠的證據後，便到雍州政府報官去！雍州刺史趕緊派兵包圍安定市集，但雍州刺史為了怕有漏網之魚，所以便拜託少年與墨門弟子協助一同包圍這個安定卻不安定的市集！', '安定市集', NULL, 1, 0),
('q00043', '擒殺胡悠', '白衣大耳少年', 'h0010', '雍州府(城鎮)', 'z02', 40, '少年與墨門弟子還有一拖拉庫的官兵到了安定，正要開始展開大規模的包圍行動時，發現ㄟ～為何要如此大費周章，兵法有云：「擒賊先擒王」安定市集的做亂大王不就是胡悠嗎？捉了他之後，那些小角色就好處理多了！但那胡悠身旁有護衛保護著，要捉他還得費一番功夫呢！', '安定市集', NULL, 1, 0),
('q00044', '前往司州', '白衣大耳少年', 'h0010', '雍州府(城鎮)', 'z02', 40, '逮到了胡悠，準備抄胡悠的家，發現胡悠那個呆子竟然把太平密令攤在桌上，讓人看免費的！少年發現這些密令中，這些人連同皇城周邊的太平道同夥起義。墨門弟子心想：「靠么勒～政商勾結，貪官汙吏、還真是歷史的常客，中國的特產。為了漢室江山，無辜老百姓，只好挺身而出」於是隨少年快馬趕到皇城，阻止這場起義！', '安定市集', NULL, 1, 1),
('q00045', '各方勢力', '墨門密探', 'n0321', '洛陽(城鎮)', 'z03', 41, '蕭蕭的馬蹄聲，不是伊人，是我墨門弟子來到！到了洛陽，才想起來初到貴寶地，我～我～我～沒有認識洛陽人耶！哀～俗話說得好：「沒有地頭蛇罩著，哪有我暢邱的份，哪有讓我走起來有風的路！」所以只好先請墨門密探，幫忙打探消息，但也不能老麻煩密探先生，所以還是先在洛陽城郊晃晃，說不定瞎貓碰上死耗子，讓我查到些秘密也不一定！', '洛陽城郊', NULL, 1, 0),
('q00046', '奸臣義子', '墨門密探', 'n0321', '洛陽(城鎮)', 'z03', 42, '悄悄的我來～悄悄的～我又走了！走著走著，閒晃到洛陽城郊，卻發現十常侍一起認的義子「吳禾重」最近常與一些洛陽守軍在洛陽城郊騎著馬跑過來跑過去，鬼鬼祟祟的不知道在裝什麼忙。墨門密探回報說：「墨門弟子，你得先想辦法擊敗洛陽守軍取得一套洛陽守軍的軍服與令牌，然後再伺機混進去看看他們到底在幹嘛！」', '洛陽城郊', NULL, 1, 0),
('q00047', '欺壓百姓', '吳禾重', 'n0393', '洛陽(城鎮)', 'z03', 42, '墨門弟子取到了洛陽守軍的軍服與令牌後，成功的混入洛陽守軍中。發現原來吳重禾想藉著十常侍的勢力，調動軍隊幫助他壯大自己的人馬。所以為了得到吳禾重的信任，墨門弟子只好先假扮成洛陽守軍，搶奪進入洛陽的商人們所攜帶的物品，拿來獻給吳禾重，這會兒墨門弟子你得先扮演一下可愛又迷人的反派腳色！', '洛陽城郊', NULL, 1, 0),
('q00048', '陰謀詭計', '吳禾重', 'n0393', '洛陽(城鎮)', 'z03', 42, '吳禾重看你殺人奪財的身手，便知道你是難得一見的作惡奇才，吳禾重決定好好重用你。原來太平道的人假借自己能發顯神蹟，想藉此與十常侍接近，知道十常侍與當朝大將軍何進爭權奪利，十常侍也希望利用太平道黃巾仙人的法術，草人插針，蠱惑當今皇上，來獲得皇上的青睞。', '洛陽城郊', NULL, 1, 1),
('q00049', '黃巾仙人', '墨門密探', 'n0321', '洛陽(城鎮)', 'z03', 42, '在你混在吳禾重身邊的這些日子，發現太平道只是想先得到皇上的信任，以方便他們完成之後更大的密謀。你把得到的消息與墨門密探交換後，都決定再分頭進行收取更多線報。目前你得快點與大將軍何進的門人搭上線，藉此先阻止十常侍的奪權的企圖，但在此之前得先殺了阻擾你的黃巾道人跟黃巾旅人。', '洛陽城郊', NULL, 1, 0),
('q00050', '先下手為強', '大將軍何進', 'n0094', '洛陽(城鎮)', 'z03', 43, '經過更深入的調查後，發現太平道想找機會挾持天子，推翻整個漢朝。知道了這麼重大消息得快點與大將軍何進見面。何進得知後，大發雷霆的說：「這逆賊竟有如此膽大妄為的舉動，墨門弟子我要你先幫我抓到躲在洛陽城郊的吳禾重，並取得吳禾重的信物，到時就可以利用這個小雜種逼迫十常侍他們做我們想要他們做的事！」', '洛陽城郊', NULL, 1, 0),
('q00051', '混入皇城', '大將軍何進', 'n0094', '洛陽(城鎮)', 'z03', 46, '大將軍何進說：「洛陽皇城目前在十常侍的控制之下，到處佈滿著他們的人馬，以致於我軍無法進入皇城。所以我希望墨門弟子你能先混入皇城，並從皇城禁軍守衛手中奪取禁軍令牌與口令，好讓我軍人馬可以免除一番廝鬥，悄悄的混進皇城。」', '洛陽皇城', NULL, 1, 0),
('q00052', '混水摸魚', '大將軍何進', 'n0094', '洛陽(城鎮)', 'z03', 46, '大將軍何進：「除了拿到皇城禁軍手中的口令與令牌外，還希望你能在皇城內製造一些混亂，好讓那些禁軍手忙腳亂，藉此分散他們的注意力，這樣到時候我軍進城會更容易些，而且如果要發生必要的戰爭時，這些禁軍已經被你搞得精疲力盡，戰鬥力也會大大下降！」', '洛陽皇城', NULL, 1, 0),
('q00053', '擒拿十常侍(一)', '大將軍何進', 'n0094', '洛陽(城鎮)', 'z03', 47, '雖然大將軍的人馬都以混入禁均，可是似乎無法完全控制住洛陽皇城，所以大將軍決定假裝包圍皇城，而你藉機在皇城內把十常侍抓住', '洛陽皇城', NULL, 1, 0),
('q00054', '擒拿十常侍(二)', '大將軍何進', 'n0094', '洛陽(城鎮)', 'z03', 47, '嘴炮', '洛陽皇城', NULL, 1, 0),
('q00055', '擒拿十常侍(三)', '大將軍何進', 'n0094', '洛陽(城鎮)', 'z03', 47, '嘴炮', '洛陽皇城', NULL, 1, 0),
('q00056', '擒拿十常侍(四)', '大將軍何進', 'n0094', '洛陽(城鎮)', 'z03', 47, '嘴炮', '洛陽皇城', NULL, 1, 0),
('q00057', '擒拿十常侍(五)', '大將軍何進', 'n0094', '洛陽(城鎮)', 'z03', 47, '嘴炮', '洛陽皇城', NULL, 1, 0),
('q00058', '螳螂捕蟬', '墨門密探', 'n0321', '洛陽(城鎮)', 'z03', 51, '在你捉拿十常侍的時候，太平道中人見事機敗露，率信徒衝到皇城內部，眼看漢靈帝就要落入太平妖人手中，你只有趕快衝進皇城內部伺機救人', '皇城內部', NULL, 1, 0),
('q00059', '盡忠職守', '墨門密探', 'n0321', '洛陽(城鎮)', 'z03', 52, '墨門密探告訴你在東宮附近有一批盡忠職守的禁衛軍正遭到太平妖人的攻擊，建議你去援助，或許能順便得知皇上的下落', '皇城內部', NULL, 1, 0),
('q00060', '拯救皇上(一)', '禁衛軍校尉', 'n0012', '洛陽(城鎮)', 'z03', 53, '被你救出的禁衛軍校尉見你膽識過人希望加入你一同救出皇上，他告訴你皇上目前正被困在御膳圓內，想要救出皇上首先必須殺出一條血路', '皇城內部', NULL, 1, 0),
('q00061', '拯救皇上(二)', '禁衛軍校尉', 'n0012', '洛陽(城鎮)', 'z03', 53, '眼看御膳圓就在眼前，卻被太平妖人擋住，殺', '皇城內部', NULL, 1, 0),
('q00062', '拯救皇上(三)', '禁衛軍校尉', 'n0012', '洛陽(城鎮)', 'z03', 55, '原來為了這次的陰謀，大賢良師的弟弟，人公將軍張梁也混入皇城，為了拯救皇上，必須殺退他們', '皇城內部', NULL, 1, 0),
('q00063', '黃巾初現', '漢靈帝', 'n0012', '洛陽(城鎮)', 'z03', 55, '太平道在青、幽、徐、冀、荊、揚、兗、豫八州鼓動平民造反，人人頭戴黃巾，漢靈帝已經命令中郎將盧植、皇甫嵩、朱俊領兵鎮壓，希望你前去豫州協助平亂', '皇城內部', NULL, 1, 1),
('q00064', '初戰豫州', '皇甫嵩', 'n0083', '豫州府(城鎮)', 'z04', 55, '豫州目前亂成一團，平亂軍將領皇甫嵩希望你先在汝南郡打擊黃巾賊的士氣', '汝南郡', NULL, 1, 0),
('q00065', '黃巾妖術', '皇甫嵩', 'n0083', '豫州府(城鎮)', 'z04', 56, '黃巾賊派出了法力高強的道士困住平亂軍，皇甫嵩派你從黃巾妖道手中強奪天旗、地旗、人旗，破解他們的妖術', '汝南郡', NULL, 1, 0),
('q00066', '營救中郎將', '皇甫嵩', 'n0083', '豫州府(城鎮)', 'z04', 56, '中郎將朱俊一時不察被黃巾副將高升率兵包圍，皇甫嵩希望你衝過包圍網救他脫困', '汝南郡', NULL, 1, 0),
('q00067', '地公將軍(一)', '皇甫嵩', 'n0083', '豫州府(城鎮)', 'z04', 56, '為了擊敗地公將軍張寶，皇甫嵩預計用火攻夜襲敵營，派你前去牽制黃巾守營軍，好讓漢軍有機會點火', '汝南郡', NULL, 1, 0),
('q00068', '地公將軍(二)', '皇甫嵩', 'n0083', '豫州府(城鎮)', 'z04', 57, '火計成功，敵軍出現敗像，皇甫嵩決定稱勝追擊捉拿張寶，派你出戰張寶身邊的護衛隊', '汝南郡', NULL, 1, 0),
('q00069', '地公將軍(三)', '皇甫嵩', 'n0083', '豫州府(城鎮)', 'z04', 57, '眼看黃巾在豫州的軍力不保，張寶決定撤退與張角會合，絕不能讓他跑了', '汝南郡', NULL, 1, 0),
('q00070', '轉戰兌州', '皇甫嵩', 'n0083', '豫州府(城鎮)', 'z04', 60, '雖然張寶被你打的無還手之力，但是靠著妖術依然成功逃逸，不過豫州暫時解除危機，同時兌州傳來人公將軍率眾包圍東郡的消息，皇甫嵩請你與漢軍一同進軍兌州', '汝南郡', NULL, 1, 1),
('q00071', '黃巾戰將', '皇甫嵩', 'n0083', '兌州府(城鎮)', 'z05', 60, '剛進入兌州就遇到黃巾戰將的攻擊，皇甫嵩派你出戰', '東郡', NULL, 1, 0),
('q00072', '兌州包圍戰', '皇甫嵩', 'n0083', '兌州府(城鎮)', 'z05', 61, '狡猾的黃巾賊誘敵深入，讓漢軍集結在陳郡之後再從兌州各地出現包圍，你必須要阻止不讓黃巾賊完成包圍網', '東郡', NULL, 1, 0),
('q00073', '擊退黃巾援軍', '皇甫嵩', 'n0083', '兌州府(城鎮)', 'z05', 62, '眼看黃巾軍節節敗退，為了保住兌州勢力，張角命令鄧茂率援軍協助兌州黃巾軍，你要在他們合流之前先擊退黃巾的援軍', '東郡', NULL, 1, 0),
('q00074', '再遇人公將軍', '皇甫嵩', 'n0083', '兌州府(城鎮)', 'z05', 63, '在兌州領軍的正是當時在洛陽意圖不軌的人公將軍張梁，在戰場上相遇必有一番廝殺', '東郡', NULL, 1, 0),
('q00075', '兌州揚威', '皇甫嵩', 'n0083', '兌州府(城鎮)', 'z05', 64, '人公將軍果然不敵，黃巾軍節節敗退，皇甫嵩命你追擊張梁，讓他不敢在踏入兌州', '東郡', NULL, 1, 0),
('q00076', '死而不僵', '皇甫嵩', 'n0083', '兌州府(城鎮)', 'z05', 64, '地公與人公將軍雙雙敗退，但是消息指出黃巾賊子重新集結在冀州，皇甫嵩暫時需要繼續清除豫州與兌州的殘餘黃巾勢力，命你先行趕往冀州協助中郎將盧植', '東郡', NULL, 1, 1),
('q00077', '冀州追擊戰', '盧植', 'n0094', '冀州府(城鎮)', 'z06', 65, '盧植傳來訊息，各地戰敗的黃巾殘黨紛紛往冀州凝聚，希望你從後追擊，盡量削弱他們的實力', '廣宗', NULL, 1, 0),
('q00078', '來自董卓的援助', '盧植', 'n0094', '冀州府(城鎮)', 'z06', 65, '與你交好的涼州刺史董卓派人傳來訊息，為了避免被漢軍察覺，已有不少黃巾賊假扮成行人，準備聚集在廣宗，盧植命你在廣宗捉拿可疑的行人，看看有多少是黃巾反賊的士兵', '廣宗', NULL, 1, 0),
('q00079', '太平要術', '盧植', 'n0094', '冀州府(城鎮)', 'z06', 65, '在冀州聚集的反賊均是太平道中的精英，尤其是張角直傳的天公道人，人人身懷太平要術摘要，可使出威力強大的妖術，盧植命你斬殺這些天公道人，並奪下他們身上的太平要術摘要', '廣宗', NULL, 1, 0),
('q00080', '大賢良師', '盧植', 'n0094', '冀州府(城鎮)', 'z06', 65, '雖然漢軍神勇，連敗黃巾，但是素有大賢良師之稱的張角身邊卻有不少死士，另漢軍頭痛不已，盧植命你清除這些死忠的太平道中人，打擊黃巾賊的氣勢', '廣宗', NULL, 1, 0),
('q00081', '恐怖的天公將軍', '盧植', 'n0094', '冀州府(城鎮)', 'z06', 68, '張角的太平要術果然厲害，一時間只見戰場上四處都有張角的分身率軍抵抗漢軍的攻擊，盧植希望你能想辦法儘快破去這些分身，以免軍心不穩', '廣宗', NULL, 1, 0),
('q00082', '義勇軍加入', '劉備', 'h0010', '冀州府(城鎮)', 'z06', 70, '師從盧植的劉備前來報訊，一見之下發現原來他就是當初在雍州協助你的大耳少年，如今漢軍威勢正盛，包括董卓、曹操、孫堅等都在各地組成義勇軍加入戰場，劉備自己的結義兄弟也不例外，因為你在戰事中表現優異，希望你能帶著他的三弟張飛協助攻打鉅鹿郡', '鉅鹿郡', NULL, 1, 0),
('q00083', '搶救董卓', '皇甫嵩', 'n0083', '冀州府(城鎮)', 'z06', 71, '義勇軍中的董卓雖然手下兵多將廣，但是因為瞧不起多為平民出身的黃巾賊，不小心被敵人困住，因為之前的情誼你決定出手幫忙', '鉅鹿郡', NULL, 1, 0),
('q00084', '圍城末日', '皇甫嵩', 'n0083', '冀州府(城鎮)', 'z06', 72, '各路義勇軍與漢軍合流，把黃巾賊圍困在鉅鹿郡，皇甫嵩命你攻擊想要突圍的黃巾賊子', '鉅鹿郡', NULL, 1, 0),
('q00085', '良師惡疾', '皇甫嵩', 'n0083', '冀州府(城鎮)', 'z06', 72, '從黃巾突圍軍的口中得知號稱大賢良師的張角似乎得了重病，為了確定消息真偽，皇甫嵩希望你潛入鉅鹿郡探查', '鉅鹿郡', NULL, 1, 0),
('q00086', '天公隕落', '皇甫嵩', 'n0083', '冀州府(城鎮)', 'z06', 73, '經過你的探查，確定了張角的確重病纏身，眾人高興之餘，卻看到滿臉病容的張角出城叫戰，眼見機不可失，皇甫嵩立即派軍出戰', '鉅鹿郡', NULL, 1, 0);

-- --------------------------------------------------------

-- 
-- Table structure for table `a3k_quest_award`
-- 

DROP TABLE IF EXISTS `a3k_quest_award`;
CREATE TABLE IF NOT EXISTS `a3k_quest_award` (
  `q_id` varchar(10) character set utf8 NOT NULL default '',
  `award_exp` int(10) default '0',
  `award_money` int(10) default '0',
  `award_item` text collate utf8_unicode_ci,
  `award_point` int(10) default '0',
  `award_fellow` varchar(40) collate utf8_unicode_ci default NULL,
  `award_description` varchar(100) collate utf8_unicode_ci default NULL,
  PRIMARY KEY  (`q_id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- 
-- Dumping data for table `a3k_quest_award`
-- 

INSERT INTO `a3k_quest_award` (`q_id`, `award_exp`, `award_money`, `award_item`, `award_point`, `award_fellow`, `award_description`) VALUES 
('q00001', 50, 30, '', 0, '', ''),
('q00002', 75, 40, '', 0, '', ''),
('q00003', 100, 50, '', 0, '', ''),
('q00004', 100, 50, '', 0, '', ''),
('q00005', 120, 80, '', 0, '', ''),
('q00006', 120, 80, '', 0, '', ''),
('q00007', 150, 100, '', 0, '', ''),
('q00008', 180, 100, '', 0, '', ''),
('q00009', 200, 150, '', 0, '', ''),
('q00010', 200, 180, '', 0, '', ''),
('q00011', 200, 200, '', 0, '', ''),
('q00012', 200, 200, '', 0, '', ''),
('q00013', 200, 200, '', 0, '', ''),
('q00014', 200, 200, '', 0, '', ''),
('q00015', 200, 200, '', 0, '', ''),
('q00016', 200, 200, '', 0, '', ''),
('q00017', 250, 250, '', 0, '', ''),
('q00018', 250, 250, '', 0, '', ''),
('q00019', 250, 300, '', 0, '', ''),
('q00020', 250, 300, '', 0, '', ''),
('q00021', 250, 300, '', 0, '', ''),
('q00022', 280, 350, '', 0, '', ''),
('q00023', 280, 350, '', 0, '', ''),
('q00024', 280, 350, '', 0, '', ''),
('q00025', 280, 350, '', 0, '', ''),
('q00026', 280, 350, '', 0, '', ''),
('q00027', 280, 350, '', 0, '', ''),
('q00028', 200, 200, '', 0, '', ''),
('q00029', 80, 50, '', 0, '', ''),
('q00030', 80, 50, '', 0, '', ''),
('q00031', 80, 50, '', 0, '', ''),
('q00032', 80, 50, '', 0, '', ''),
('q00033', 80, 50, '', 0, '', ''),
('q00034', 80, 50, '', 0, '', ''),
('q00035', 80, 50, '', 0, '', ''),
('q00036', 80, 50, '', 0, '', ''),
('q00037', 80, 50, '', 0, '', ''),
('q00038', 80, 50, '', 0, '', ''),
('q00039', 80, 50, '', 0, '', ''),
('q00040', 80, 30, '', 0, '', ''),
('q00041', 80, 30, '', 0, '', ''),
('q00042', 80, 30, '', 0, '', ''),
('q00043', 80, 30, '', 0, '', ''),
('q00044', 80, 30, '', 0, '', ''),
('q00045', 80, 30, '', 0, '', ''),
('q00046', 80, 30, '', 0, '', ''),
('q00047', 80, 30, '', 0, '', ''),
('q00048', 80, 30, '', 0, '', ''),
('q00049', 80, 30, '', 0, '', ''),
('q00050', 80, 30, '', 0, '', ''),
('q00051', 80, 30, '', 0, '', ''),
('q00052', 80, 30, '', 0, '', ''),
('q00053', 80, 30, '', 0, '', ''),
('q00054', 80, 30, '', 0, '', ''),
('q00055', 80, 30, '', 0, '', ''),
('q00056', 80, 30, '', 0, '', ''),
('q00057', 80, 30, '', 0, '', ''),
('q00058', 80, 30, '', 0, '', ''),
('q00059', 80, 30, '', 0, '', ''),
('q00060', 80, 30, '', 0, '', ''),
('q00061', 80, 30, '', 0, '', ''),
('q00062', 80, 30, '', 0, '', ''),
('q00063', 80, 30, '', 0, '', ''),
('q00064', 80, 30, '', 0, '', ''),
('q00065', 80, 30, '', 0, '', ''),
('q00066', 80, 30, '', 0, '', ''),
('q00067', 80, 30, '', 0, '', ''),
('q00068', 80, 30, '', 0, '', ''),
('q00069', 80, 30, '', 0, '', ''),
('q00070', 80, 30, '', 0, '', ''),
('q00071', 80, 30, '', 0, '', ''),
('q00072', 80, 30, '', 0, '', ''),
('q00073', 80, 30, '', 0, '', ''),
('q00074', 80, 30, '', 0, '', ''),
('q00075', 80, 30, '', 0, '', ''),
('q00076', 80, 30, '', 0, '', ''),
('q00077', 80, 30, '', 0, '', ''),
('q00078', 80, 30, '', 0, '', ''),
('q00079', 80, 30, '', 0, '', ''),
('q00080', 80, 30, '', 0, '', ''),
('q00081', 80, 30, '', 0, '', ''),
('q00082', 80, 30, '', 0, '', ''),
('q00083', 80, 30, '', 0, '', ''),
('q00084', 80, 30, '', 0, '', ''),
('q00085', 80, 30, '', 0, '', ''),
('q00086', 80, 30, '', 0, '', '');

-- --------------------------------------------------------

-- 
-- Table structure for table `a3k_quest_limit`
-- 

DROP TABLE IF EXISTS `a3k_quest_limit`;
CREATE TABLE IF NOT EXISTS `a3k_quest_limit` (
  `q_id` varchar(10) character set utf8 NOT NULL default '',
  `limit_lv` int(10) default NULL,
  `limit_job` varchar(10) collate utf8_unicode_ci default NULL,
  `limit_item` text collate utf8_unicode_ci,
  `limit_quest` varchar(50) collate utf8_unicode_ci default NULL,
  `limit_description` varchar(100) collate utf8_unicode_ci default NULL,
  PRIMARY KEY  (`q_id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- 
-- Dumping data for table `a3k_quest_limit`
-- 

INSERT INTO `a3k_quest_limit` (`q_id`, `limit_lv`, `limit_job`, `limit_item`, `limit_quest`, `limit_description`) VALUES 
('q00001', 2, '', '', '', ''),
('q00002', 3, '', '', 'q00001', ''),
('q00003', 5, '', '', 'q00002', ''),
('q00004', 6, '', '', 'q00003', ''),
('q00005', 7, '', '', 'q00004', ''),
('q00006', 8, '', '', 'q00005', ''),
('q00007', 9, '', '', 'q00006', ''),
('q00008', 10, '', '', 'q00007', ''),
('q00009', 11, '', '', '', ''),
('q00010', 12, '', '', 'q00009', ''),
('q00011', 12, '', '', 'q00010', ''),
('q00012', 13, '', '', 'q00011', ''),
('q00013', 13, '', '', 'q00012', ''),
('q00014', 14, '', '', 'q00013', ''),
('q00015', 14, '', '', 'q00014', ''),
('q00016', 15, '', '', 'q00015', ''),
('q00017', 15, '', '', 'q00016', ''),
('q00018', 16, '', '', 'q00017', ''),
('q00019', 17, '', '', 'q00018', ''),
('q00020', 19, '', '', 'q00019', ''),
('q00021', 20, '', '', 'q00020', ''),
('q00022', 21, '', '', 'q00021', ''),
('q00023', 21, '', '', 'q00022', ''),
('q00024', 22, '', '', 'q00023', ''),
('q00025', 23, '', '', 'q00024', ''),
('q00026', 23, '', '', 'q00025', ''),
('q00027', 24, '', '', 'q00026', ''),
('q00028', 25, '', '', 'q00027', ''),
('q00029', 26, '', '', '', ''),
('q00030', 27, '', '', 'q00029', ''),
('q00031', 28, '', '', 'q00030', ''),
('q00032', 29, '', '', 'q00031', ''),
('q00033', 30, '', '', 'q00032', ''),
('q00034', 31, '', '', 'q00033', ''),
('q00035', 32, '', '', 'q00034', ''),
('q00036', 33, '', '', 'q00035', ''),
('q00037', 34, '', '', 'q00036', ''),
('q00038', 35, '', '', 'q00037', ''),
('q00039', 36, '', '', 'q00038', ''),
('q00040', 37, '', '', 'q00039', ''),
('q00041', 38, '', '', 'q00040', ''),
('q00042', 39, '', '', 'q00041', ''),
('q00043', 40, '', '', 'q00042', ''),
('q00044', 40, '', '', 'q00043', ''),
('q00045', 41, '', '', '', ''),
('q00046', 42, '', '', 'q00045', ''),
('q00047', 43, '', '', 'q00046', ''),
('q00048', 44, '', '', 'q00047', ''),
('q00049', 44, '', '', 'q00048', ''),
('q00050', 45, '', '', 'q00049', ''),
('q00051', 46, '', '', 'q00050', ''),
('q00052', 46, '', '', 'q00051', ''),
('q00053', 47, '', '', 'q00052', ''),
('q00054', 48, '', '', 'q00052', ''),
('q00055', 49, '', '', 'q00052', ''),
('q00056', 49, '', '', 'q00052', ''),
('q00057', 50, '', '', 'q00052', ''),
('q00058', 51, '', '', 'q00052', ''),
('q00059', 52, '', '', 'q00058', ''),
('q00060', 53, '', '', 'q00059', ''),
('q00061', 53, '', '', 'q00060', ''),
('q00062', 54, '', '', 'q00061', ''),
('q00063', 55, '', '', 'q00062', ''),
('q00064', 56, '', '', '', ''),
('q00065', 56, '', '', 'q00064', ''),
('q00066', 57, '', '', 'q00065', ''),
('q00067', 58, '', '', 'q00066', ''),
('q00068', 59, '', '', 'q00067', ''),
('q00069', 59, '', '', 'q00068', ''),
('q00070', 60, '', '', 'q00069', ''),
('q00071', 61, '', '', '', ''),
('q00072', 61, '', '', 'q00071', ''),
('q00073', 62, '', '', 'q00072', ''),
('q00074', 63, '', '', 'q00073', ''),
('q00075', 64, '', '', 'q00074', ''),
('q00076', 65, '', '', 'q00075', ''),
('q00077', 66, '', '', '', ''),
('q00078', 67, '', '', 'q00077', ''),
('q00079', 68, '', '', 'q00078', ''),
('q00080', 69, '', '', 'q00079', ''),
('q00081', 70, '', '', 'q00080', ''),
('q00082', 71, '', '', '', ''),
('q00083', 71, '', '', 'q00082', ''),
('q00084', 72, '', '', 'q00083', ''),
('q00085', 72, '', '', 'q00084', ''),
('q00086', 73, '', '', 'q00085', '');

-- --------------------------------------------------------

-- 
-- Table structure for table `a3k_quest_need`
-- 

DROP TABLE IF EXISTS `a3k_quest_need`;
CREATE TABLE IF NOT EXISTS `a3k_quest_need` (
  `q_id` varchar(10) character set utf8 NOT NULL default '',
  `need_monster` varchar(60) collate utf8_unicode_ci default NULL,
  `need_fight` varchar(40) collate utf8_unicode_ci default NULL,
  `need_item` text collate utf8_unicode_ci,
  `need_description` varchar(100) collate utf8_unicode_ci default NULL,
  PRIMARY KEY  (`q_id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- 
-- Dumping data for table `a3k_quest_need`
-- 

INSERT INTO `a3k_quest_need` (`q_id`, `need_monster`, `need_fight`, `need_item`, `need_description`) VALUES 
('q00001', '', 'a01:10', '', ''),
('q00002', 'a01002:3', '', '', ''),
('q00003', 'a02001:5', '', '', ''),
('q00004', '', 'a02:10', '', ''),
('q00005', '', '', '', ''),
('q00006', '', '', 'i0001:5', ''),
('q00007', 'a02002:5', '', '', ''),
('q00008', '', '', 'i0002:1', ''),
('q00009', '', '', 'i0003:3', ''),
('q00010', 'a03001:5', '', '', ''),
('q00011', 'a03002:5,a03003:3', '', '', ''),
('q00012', 'a03003:5,a03004:3', '', '', ''),
('q00013', 'a03004:5,a03005:1', '', '', ''),
('q00014', 'a03004:8,a03006:1', '', '', ''),
('q00015', '', '', '', ''),
('q00016', 'a04001:5', '', '', ''),
('q00017', 'a04001:10', '', '', ''),
('q00018', '', '', 'i0004:5', ''),
('q00019', 'a04003:8', '', '', ''),
('q00020', 'a04004:10', '', '', ''),
('q00021', 'a04007:1,a04006:3,a04005:10', '', '', ''),
('q00022', '', 'a05:10', '', ''),
('q00023', '', '', 'i0005:1,i0006:1', ''),
('q00024', 'a05002:5,a05003:5', '', '', ''),
('q00025', '', '', 'i0007:1,i0008:1', ''),
('q00026', 'a05005:5,a05006:5', '', '', ''),
('q00027', '', '', 'i0009:1', ''),
('q00028', '', '', '', ''),
('q00029', '', '', 'i0010:5', ''),
('q00030', 'b01003:8,b01004:5', '', '', ''),
('q00031', '', 'b01:20', '', ''),
('q00032', '', '', 'i0012:5', ''),
('q00033', 'b01006:10', '', '', ''),
('q00034', '', '', 'i0013:10', ''),
('q00035', '', 'b02:20', '', ''),
('q00036', '', '', 'i0014:3', ''),
('q00037', 'b02002:3,b02003:1', '', '', ''),
('q00038', 'b02004:10,b02005:1', '', '', ''),
('q00039', '', 'b03:20', '', ''),
('q00040', 'b03001:10', '', '', ''),
('q00041', '', '', 'i0015:5,i0016:5', ''),
('q00042', '', 'b03:15', '', ''),
('q00043', 'b03003:10,b03004:1', '', '', ''),
('q00044', '', '', '', ''),
('q00045', '', 'c01:15', '', ''),
('q00046', '', '', 'i0017:1,i0018:1', ''),
('q00047', '', '', 'i0019:10', ''),
('q00048', '', '', '', ''),
('q00049', 'c01003:10,c01004:10', '', '', ''),
('q00050', '', '', 'i0020:1', ''),
('q00051', '', '', 'i0021:1,i0022:10', ''),
('q00052', '', 'c02:20', '', ''),
('q00053', 'c02003:1,c02004:1', '', '', ''),
('q00054', 'c02005:1,c02006:1', '', '', ''),
('q00055', 'c02007:1,c02008:1', '', '', ''),
('q00056', 'c02009:1,c02010:1', '', '', ''),
('q00057', 'c02011:1,c02012:1', '', '', ''),
('q00058', '', 'c03:20', '', ''),
('q00059', 'c03001:10,c03002:10', '', '', ''),
('q00060', '', 'c03:25', '', ''),
('q00061', 'c03002:10,c03003:10', '', '', ''),
('q00062', 'c03002:10,c03004:10,c03005:1', '', '', ''),
('q00063', '', '', '', ''),
('q00064', '', 'd01:20', '', ''),
('q00065', '', '', 'i0023:3,i0024:3,i0025:3', ''),
('q00066', 'd01001:10,d01002:5,d01003:1', '', '', ''),
('q00067', 'd01004:10,d01005:5', '', '', ''),
('q00068', 'd01006:10,d01007:8', '', '', ''),
('q00069', 'd01007:10,d01008:3', '', '', ''),
('q00070', '', '', '', ''),
('q00071', 'e01001:10', '', '', ''),
('q00072', '', 'e01:20', '', ''),
('q00073', 'e01002:10,e01003:5,e01004:1', '', '', ''),
('q00074', 'e01005:8,e01006:1', '', '', ''),
('q00075', '', '', 'i0026:3', ''),
('q00076', '', '', '', ''),
('q00077', '', 'f01:20', '', ''),
('q00078', '', '', 'i0027:10', ''),
('q00079', '', '', 'i0028:10', ''),
('q00080', 'f01003:10,f01004:15', '', '', ''),
('q00081', 'f01005:5', '', '', ''),
('q00082', '', 'f02:20', '', ''),
('q00083', 'f02001:30', '', '', ''),
('q00084', 'f02001:10,f02002:10,f02003:10', '', '', ''),
('q00085', 'f02001:10,f02004:10,f02005:10', '', '', ''),
('q00086', 'f02005:10,f02006:10,f02007:1', '', '', ''),
('q00087', 'a01005:10', '', '', ''),
('q00088', 'a01004:10', '', '', ''),
('q00089', 'a01008:10', '', '', ''),
('q00090', '', '', '', '12321'),
('q00091', '', '', '', '111'),
('q00092', '', '', '', '111');

-- --------------------------------------------------------

-- 
-- Table structure for table `a3k_quest_time`
-- 

DROP TABLE IF EXISTS `a3k_quest_time`;
CREATE TABLE IF NOT EXISTS `a3k_quest_time` (
  `q_id` varchar(10) default NULL,
  `q_week` tinyint(3) unsigned default NULL,
  `q_hour` mediumint(8) unsigned default NULL,
  KEY `q_id` (`q_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

-- 
-- Dumping data for table `a3k_quest_time`
-- 

