-- MySQL Administrator dump 1.4
--
-- ------------------------------------------------------
-- Server version	5.0.67-community-nt


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;


--
-- Create schema a3k
--

CREATE DATABASE IF NOT EXISTS a3k;
USE a3k;

--
-- Definition of table `a3k_brohood`
--

DROP TABLE IF EXISTS `a3k_brohood`;
CREATE TABLE `a3k_brohood` (
  `pkid` int(11) NOT NULL auto_increment COMMENT 'pk',
  `p_id` int(10) NOT NULL default '0' COMMENT 'me',
  `b_p_id` int(10) NOT NULL default '0' COMMENT 'my friend',
  `timestamp` timestamp NOT NULL default CURRENT_TIMESTAMP COMMENT 'timestamp',
  PRIMARY KEY  (`pkid`,`p_id`,`b_p_id`),
  UNIQUE KEY `p_id` (`p_id`,`b_p_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='a3k brother hood';

--
-- Dumping data for table `a3k_brohood`
--

/*!40000 ALTER TABLE `a3k_brohood` DISABLE KEYS */;
/*!40000 ALTER TABLE `a3k_brohood` ENABLE KEYS */;


--
-- Definition of table `a3k_fellow`
--

DROP TABLE IF EXISTS `a3k_fellow`;
CREATE TABLE `a3k_fellow` (
  `p_owner` varchar(10) NOT NULL default '0' COMMENT '五將主人',
  `p_id` int(10) unsigned NOT NULL auto_increment,
  `p_at` int(10) unsigned NOT NULL default '0' COMMENT '攻擊力',
  `p_df` int(10) unsigned NOT NULL default '0' COMMENT '防禦力',
  `p_agl` int(10) unsigned default '0' COMMENT '速度',
  `p_rankname` varchar(20) NOT NULL COMMENT '官階',
  `p_str` int(10) unsigned NOT NULL COMMENT '力量',
  `p_smart` int(10) unsigned NOT NULL COMMENT '智力',
  `p_vit` int(10) unsigned NOT NULL COMMENT '體質',
  `p_bone` int(10) unsigned NOT NULL COMMENT '根骨',
  `p_name` varchar(20) NOT NULL default '--' COMMENT '五將名',
  `p_hp` int(10) unsigned NOT NULL default '0' COMMENT '體力',
  `p_lv` int(10) unsigned NOT NULL default '0' COMMENT '等級',
  `p_img` varchar(25) default NULL COMMENT '圖檔名',
  `p_hpmax` int(10) unsigned NOT NULL default '0' COMMENT '體力最大',
  `p_mn` int(10) unsigned NOT NULL default '0' COMMENT '精神力',
  `p_mnmax` int(10) unsigned NOT NULL default '0' COMMENT '精神力最大',
  `p_exp` int(10) unsigned NOT NULL default '0' COMMENT '目前經驗值',
  `p_nextexp` int(10) unsigned NOT NULL COMMENT '升級所需經驗職',
  `role_id` varchar(10) NOT NULL COMMENT '職業',
  `faith` int(10) unsigned NOT NULL COMMENT '忠誠',
  `fl_id` varchar(10) NOT NULL default '0' COMMENT '武將類行(fk to a3k_fellowshop.fl_id)',
  PRIMARY KEY  USING BTREE (`p_id`),
  KEY `p_owner` (`p_owner`),
  KEY `role_id` (`role_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC COMMENT='玩家的武將';

--
-- Dumping data for table `a3k_fellow`
--

/*!40000 ALTER TABLE `a3k_fellow` DISABLE KEYS */;
/*!40000 ALTER TABLE `a3k_fellow` ENABLE KEYS */;


--
-- Definition of table `a3k_fellowshop`
--

DROP TABLE IF EXISTS `a3k_fellowshop`;
CREATE TABLE `a3k_fellowshop` (
  `fl_id` varchar(10) NOT NULL default '0',
  `p_at` int(10) unsigned NOT NULL,
  `p_df` int(10) unsigned NOT NULL,
  `p_agl` int(10) unsigned NOT NULL,
  `p_rankname` varchar(20) NOT NULL,
  `p_str` int(10) unsigned NOT NULL,
  `p_smart` int(10) unsigned NOT NULL,
  `p_vit` int(10) unsigned NOT NULL,
  `p_bone` int(10) unsigned NOT NULL,
  `p_name` varchar(20) NOT NULL,
  `p_hp` int(10) unsigned NOT NULL,
  `p_lv` int(10) unsigned NOT NULL,
  `p_img` varchar(30) NOT NULL,
  `p_hpmax` int(10) unsigned NOT NULL,
  `p_mn` int(10) unsigned NOT NULL,
  `p_mnmax` int(10) unsigned NOT NULL,
  `p_exp` int(10) unsigned NOT NULL,
  `p_nextexp` bigint(10) unsigned NOT NULL,
  `role_id` varchar(10) NOT NULL,
  `faith` int(10) unsigned NOT NULL,
  `f_tradedata` text COMMENT '武將合成資料JSON',
  `fl_cash` int(10) NOT NULL default '0',
  PRIMARY KEY  (`fl_id`),
  KEY `role_id` (`role_id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `a3k_fellowshop`
--

/*!40000 ALTER TABLE `a3k_fellowshop` DISABLE KEYS */;
INSERT INTO `a3k_fellowshop` (`fl_id`,`p_at`,`p_df`,`p_agl`,`p_rankname`,`p_str`,`p_smart`,`p_vit`,`p_bone`,`p_name`,`p_hp`,`p_lv`,`p_img`,`p_hpmax`,`p_mn`,`p_mnmax`,`p_exp`,`p_nextexp`,`role_id`,`faith`,`f_tradedata`,`fl_cash`) VALUES 
 ('1',100,100,100,'墨者',100,100,100,100,'革離',100,100,'h0020',100,100,100,0,10,'a02',100,NULL,0),
 ('2',100,100,100,'墨者',100,200,100,200,'momo',100,100,'h0050',100,100,100,100,1000,'a02',0,NULL,0),
 ('3',20,20,10,'墨門弟子',10,10,10,10,'劉備',50,1,'h0010',50,30,30,0,100,'b01',10,NULL,0),
 ('4',20,20,10,'墨門弟子',10,10,10,10,'關羽',50,1,'h0020',50,30,30,0,100,'a01',10,NULL,0),
 ('5',20,20,10,'墨門弟子',10,10,10,10,'張飛',50,1,'h0030',50,30,30,0,100,'a01',10,NULL,0),
 ('50',20,25,15,'墨門弟子',15,10,13,20,'少年馬超',50,1,'h0050',50,30,30,0,100,'a02',10,NULL,0),
 ('103',70,70,15,'墨門弟子',38,12,45,40,'馬騰(土豪)',50,1,'n0113',95,50,30,0,100,'b01',10,'{\"needGs\":3000,\"needs\":[{\"fl_id\":\"102\",\"p_name\":\"史敬(墨者)\",\"p_lv\":18},{\"fl_id\":\"101\",\"p_name\":\"丸霖(習者)\",\"p_lv\":15}]}',0),
 ('53',20,30,10,'墨門弟子',35,5,20,35,'墨門小師弟',50,1,'n0031',50,30,30,0,100,'b01',10,NULL,0),
 ('51',20,20,12,'墨門弟子',12,13,20,11,'少年劉備',50,1,'h0010',50,30,30,0,100,'b01',10,NULL,0),
 ('102',70,70,15,'墨門弟子',38,12,45,40,'史敬(墨者)',50,1,'n0044',95,50,30,0,100,'b01',10,'{\"needGs\":1000,\"needs\":[{\"fl_id\":\"53\",\"p_name\":\"墨門小師弟\",\"p_lv\":7},{\"fl_id\":\"101\",\"p_name\":\"丸霖(習者)\",\"p_lv\":3}]}',0),
 ('52',20,30,5,'墨門弟子',35,5,10,35,'墨門護衛',50,1,'n0031',50,30,30,0,100,'b01',10,NULL,0),
 ('6',20,20,10,'墨門弟子',10,10,10,10,'諸葛亮',50,1,'h0040',50,30,30,0,100,'a01',10,NULL,0),
 ('7',20,20,10,'墨門弟子',10,10,10,10,'馬超',50,1,'h0050',50,30,30,0,100,'a01',10,NULL,0),
 ('100',70,70,15,'墨門弟子',38,12,45,40,'墨門習者',50,1,'n0034',95,50,30,0,100,'b01',10,NULL,0),
 ('101',70,70,15,'墨門弟子',38,12,45,40,'丸霖(習者)',50,1,'n0352',95,50,30,0,100,'b01',10,NULL,1000),
 ('104',70,70,15,'墨門弟子',38,12,45,40,'伍瓊',50,1,'n0381',95,50,30,0,100,'b01',10,NULL,2500),
 ('105',70,70,15,'墨門弟子',38,12,45,40,'董越',50,1,'n0382',95,50,30,0,100,'b01',10,NULL,2500),
 ('106',70,70,15,'墨門弟子',38,12,45,40,'劉囂',50,1,'n0383',95,50,30,0,100,'b01',10,NULL,2500),
 ('107',70,70,15,'墨門弟子',38,12,45,40,'楊彪',50,1,'n0031',95,50,30,0,100,'b01',10,NULL,5000),
 ('108',70,70,15,'墨門弟子',38,12,45,40,'段煨',50,1,'n0032',95,50,30,0,100,'b01',10,NULL,5000),
 ('109',70,70,15,'墨門弟子',38,12,45,40,'楊定',50,1,'n0033',95,50,30,0,100,'b01',10,NULL,5000),
 ('110',70,70,15,'墨門弟子',38,12,45,40,'王方',50,1,'n0481',95,50,30,0,100,'b01',10,NULL,5000),
 ('111',70,70,15,'墨門弟子',38,12,45,40,'胡軫',50,1,'n0482',95,50,30,0,100,'b01',10,NULL,5000),
 ('112',70,70,15,'墨門弟子',38,12,45,40,'李傕',50,1,'n0050',95,50,30,0,100,'b01',10,'{\"needGs\":1200,\"needs\":[{\"fl_id\":\"104\",\"p_name\":\"伍瓊\",\"p_lv\":8},{\"fl_id\":\"105\",\"p_name\":\"董越\",\"p_lv\":5}]}',0),
 ('113',70,70,15,'墨門弟子',38,12,45,40,'郭汜',50,1,'n0051',95,50,30,0,100,'b01',10,'{\"needGs\":1200,\"needs\":[{\"fl_id\":\"104\",\"p_name\":\"伍瓊\",\"p_lv\":8},{\"fl_id\":\"106\",\"p_name\":\"劉囂\",\"p_lv\":5}]}',0),
 ('114',70,70,15,'墨門弟子',38,12,45,40,'徐榮',50,1,'n0052',95,50,30,0,100,'b01',10,'{\"needGs\":1200,\"needs\":[{\"fl_id\":\"106\",\"p_name\":\"劉囂\",\"p_lv\":8},{\"fl_id\":\"105\",\"p_name\":\"董越\",\"p_lv\":5}]}',0),
 ('115',70,70,15,'墨門弟子',38,12,45,40,'楊奉',50,1,'n0053',95,50,30,0,100,'b01',10,'{\"needGs\":2500,\"needs\":[{\"fl_id\":\"113\",\"p_name\":\"郭汜\",\"p_lv\":15},{\"fl_id\":\"107\",\"p_name\":\"楊彪\",\"p_lv\":13}]}',0),
 ('116',70,70,15,'墨門弟子',38,12,45,40,'李肅',50,1,'n0141',95,50,30,0,100,'b01',10,'{\"needGs\":2500,\"needs\":[{\"fl_id\":\"112\",\"p_name\":\"李傕\",\"p_lv\":15},{\"fl_id\":\"108\",\"p_name\":\"段煨\",\"p_lv\":13}]}',0),
 ('117',70,70,15,'墨門弟子',38,12,45,40,'張濟',50,1,'n0054',95,50,30,0,100,'b01',10,'{\"needGs\":2500,\"needs\":[{\"fl_id\":\"114\",\"p_name\":\"徐榮\",\"p_lv\":15},{\"fl_id\":\"109\",\"p_name\":\"楊定\",\"p_lv\":13}]}',0),
 ('118',70,70,15,'墨門弟子',38,12,45,40,'樊稠(勇士)',50,1,'n0101',95,50,30,0,100,'b01',10,'{\"needGs\":3500,\"needs\":[{\"fl_id\":\"121\",\"p_name\":\"呼延慶\",\"p_lv\":22},{\"fl_id\":\"117\",\"p_name\":\"張濟\",\"p_lv\":15}]}',0),
 ('119',70,70,15,'墨門弟子',38,12,45,40,'李儒(儒生)',50,1,'n0125',95,50,30,0,100,'b01',10,'{\"needGs\":3500,\"needs\":[{\"fl_id\":\"120\",\"p_name\":\"牛輔\",\"p_lv\":22},{\"fl_id\":\"116\",\"p_name\":\"李肅\",\"p_lv\":15}]}',0),
 ('120',70,70,15,'墨門弟子',38,12,45,40,'牛輔',50,1,'n0053',95,50,30,0,100,'b01',10,NULL,0),
 ('121',70,70,15,'墨門弟子',38,12,45,40,'呼延慶',50,1,'n0384',95,50,30,0,100,'b01',10,NULL,0),
 ('122',70,70,15,'墨門弟子',38,12,45,40,'樊稠(武將)',50,1,'n0101',95,50,30,0,100,'b01',10,'{\"needGs\":4500,\"needs\":[{\"fl_id\":\"118\",\"p_name\":\"樊稠(勇士)\",\"p_lv\":25},{\"fl_id\":\"110\",\"p_name\":\"王方\",\"p_lv\":20}]}',0),
 ('123',70,70,15,'墨門弟子',38,12,45,40,'李儒(名士)',50,1,'n0125',95,50,30,0,100,'b01',10,'{\"needGs\":4500,\"needs\":[{\"fl_id\":\"119\",\"p_name\":\"李儒(儒生)\",\"p_lv\":25},{\"fl_id\":\"111\",\"p_name\":\"胡軫\",\"p_lv\":20}]}',0),
 ('124',70,70,15,'墨門弟子',38,12,45,40,'華雄(勇士)',50,1,'n0191',95,50,30,0,100,'b01',10,'{\"needGs\":55,\"needs\":[{\"fl_id\":\"122\",\"p_name\":\"樊稠(武將)\",\"p_lv\":30},{\"fl_id\":\"103\",\"p_name\":\"馬騰(土豪)\",\"p_lv\":20},{\"fl_id\":\"115\",\"p_name\":\"楊奉\",\"p_lv\":10}]}',0),
 ('125',70,70,15,'墨門弟子',38,12,45,40,'賈詡(儒生)',50,1,'n0131',95,50,30,0,100,'b01',10,'{\"needGs\":5500,\"needs\":[{\"fl_id\":\"123\",\"p_name\":\"李儒(名士)\",\"p_lv\":30},{\"fl_id\":\"103\",\"p_name\":\"馬騰(土豪)\",\"p_lv\":20},{\"fl_id\":\"115\",\"p_name\":\"楊奉\",\"p_lv\":10}]}',0);
/*!40000 ALTER TABLE `a3k_fellowshop` ENABLE KEYS */;


--
-- Definition of table `a3k_group`
--

DROP TABLE IF EXISTS `a3k_group`;
CREATE TABLE `a3k_group` (
  `g_id` int(10) NOT NULL auto_increment,
  `g_name` varchar(10) default NULL,
  `g_leader` varchar(10) default NULL,
  `g_count` tinyint(3) default NULL,
  `g_text` text,
  PRIMARY KEY  (`g_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `a3k_group`
--

/*!40000 ALTER TABLE `a3k_group` DISABLE KEYS */;
/*!40000 ALTER TABLE `a3k_group` ENABLE KEYS */;


--
-- Definition of table `a3k_group_invitation`
--

DROP TABLE IF EXISTS `a3k_group_invitation`;
CREATE TABLE `a3k_group_invitation` (
  `g_id` varchar(10) NOT NULL default '',
  `p_id` varchar(10) NOT NULL default '',
  PRIMARY KEY  (`g_id`,`p_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `a3k_group_invitation`
--

/*!40000 ALTER TABLE `a3k_group_invitation` DISABLE KEYS */;
/*!40000 ALTER TABLE `a3k_group_invitation` ENABLE KEYS */;


--
-- Definition of table `a3k_group_message`
--

DROP TABLE IF EXISTS `a3k_group_message`;
CREATE TABLE `a3k_group_message` (
  `m_id` int(10) NOT NULL auto_increment,
  `g_id` varchar(10) default NULL,
  `g_message` text,
  `g_writetime` int(10) default '0',
  PRIMARY KEY  (`m_id`),
  KEY `g_id` (`g_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `a3k_group_message`
--

/*!40000 ALTER TABLE `a3k_group_message` DISABLE KEYS */;
/*!40000 ALTER TABLE `a3k_group_message` ENABLE KEYS */;


--
-- Definition of table `a3k_items`
--

DROP TABLE IF EXISTS `a3k_items`;
CREATE TABLE `a3k_items` (
  `id` int(10) unsigned NOT NULL auto_increment,
  `item_id` varchar(10) NOT NULL,
  `item_name` varchar(20) NOT NULL default '--' COMMENT '名稱',
  `item_type1` smallint(5) unsigned NOT NULL default '0' COMMENT '物品類別1',
  `item_type2` smallint(5) unsigned NOT NULL default '0' COMMENT '物品類別2',
  `item_img` varchar(10) default NULL COMMENT '圖像名稱',
  `item_ef_at` int(10) unsigned default NULL COMMENT '攻擊力',
  `item_ef_df` int(10) unsigned default NULL COMMENT '防禦力',
  `item_ef_str` int(10) unsigned default NULL COMMENT '力量',
  `item_ef_bone` int(10) unsigned default NULL COMMENT '根骨',
  `item_ef_vit` int(10) unsigned default NULL COMMENT '體魄',
  `item_ef_agl` int(10) unsigned default NULL COMMENT '速度',
  `item_ef_smart` int(10) unsigned default NULL COMMENT '智力',
  `item_ef_hp` int(10) unsigned NOT NULL default '0' COMMENT 'HP',
  `item_ef_mn` int(10) unsigned NOT NULL default '0' COMMENT 'MN',
  `item_stackable` tinyint(1) default '0' COMMENT '可否堆疊',
  `item_storeid` varchar(10) default NULL COMMENT '商店',
  `item_tradable` tinyint(1) NOT NULL default '0' COMMENT '榜定',
  `item_desc` varchar(200) default NULL COMMENT '物品說明',
  `item_price` int(10) unsigned default '0' COMMENT '物品售價',
  `item_r_price` int(10) unsigned NOT NULL default '0' COMMENT '商城幣(0=不是商城物)',
  `item_mixable` text,
  PRIMARY KEY  (`id`),
  KEY `item_id` (`item_id`),
  KEY `item_storeid` (`item_storeid`)
) ENGINE=MyISAM AUTO_INCREMENT=97 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `a3k_items`
--

/*!40000 ALTER TABLE `a3k_items` DISABLE KEYS */;
INSERT INTO `a3k_items` (`id`,`item_id`,`item_name`,`item_type1`,`item_type2`,`item_img`,`item_ef_at`,`item_ef_df`,`item_ef_str`,`item_ef_bone`,`item_ef_vit`,`item_ef_agl`,`item_ef_smart`,`item_ef_hp`,`item_ef_mn`,`item_stackable`,`item_storeid`,`item_tradable`,`item_desc`,`item_price`,`item_r_price`,`item_mixable`) VALUES 
 (1,'a0001','新手頭巾',1,1,'a0011',0,0,0,0,5,0,0,0,0,0,'NULL',1,'新手使用的頭巾',1,0,NULL),
 (2,'a0002','麻布頭巾',1,1,'a0011',0,0,0,0,10,0,0,0,0,0,'z01',1,'麻布頭巾',350,0,NULL),
 (3,'a0003','布帽',1,1,'a0011',0,0,0,2,7,0,0,0,0,0,'z01',1,'布帽',500,0,NULL),
 (4,'a0004','麻布帽',1,1,'a0011',0,0,0,0,15,0,0,0,0,0,'z01',1,'麻布帽',800,0,NULL),
 (5,'a0005','木製頭盔',1,1,'a0011',0,0,0,0,20,0,0,0,0,0,'z02',1,'木製頭盔',1200,0,NULL),
 (6,'a0006','蠶絲帽',1,1,'a0011',0,0,0,5,12,0,0,0,0,0,'z02',1,'蠶絲帽',2000,0,NULL),
 (7,'a0007','硬木頭盔',1,1,'a0011',0,0,0,0,25,0,0,0,0,0,'z02',1,'硬木頭盔',2500,0,NULL),
 (8,'a0008','破舊頭盔',1,1,'a0011',0,0,0,0,30,0,0,0,0,0,'NULL',1,'破舊頭盔',3000,0,NULL),
 (9,'a0009','鐵頭盔',1,1,'a0011',0,0,0,8,22,0,0,0,0,0,'NULL',1,'鐵頭盔',4000,0,NULL),
 (10,'b0001','新手服',1,2,'b0011',0,0,0,0,10,0,0,0,0,0,'NULL',1,'新手使用的服裝',1,0,NULL),
 (11,'b0002','麻布服',1,2,'b0011',0,0,0,0,15,0,0,0,0,0,'z01',1,'麻布服',350,0,NULL),
 (12,'b0003','布裝',1,2,'b0011',0,0,0,0,13,2,0,0,0,0,'z01',1,'布裝',500,0,NULL),
 (13,'b0004','麻布長袍',1,2,'b0011',0,0,0,0,20,0,0,0,0,0,'z01',1,'麻布長袍',800,0,NULL),
 (14,'b0005','皮製長袍',1,2,'b0011',0,0,0,0,25,0,0,0,0,0,'z02',1,'皮製長袍',1200,0,NULL),
 (15,'b0006','蠶絲長袍',1,2,'b0011',0,0,0,0,22,5,0,0,0,0,'z02',1,'蠶絲長袍',2000,0,NULL),
 (16,'b0007','皮甲',1,2,'b0011',0,0,0,0,30,0,0,0,0,0,'z02',1,'皮甲',2500,0,NULL),
 (17,'b0008','破舊鎧甲',1,2,'b0011',0,0,0,0,35,0,0,0,0,0,'NULL',1,'破舊鎧甲',3000,0,NULL),
 (18,'b0009','鐵鎧甲',1,2,'b0011',0,0,0,0,33,7,0,0,0,0,'NULL',1,'鐵鎧甲',4000,0,NULL),
 (19,'c0001','新手披肩',1,3,'c0011',0,0,0,0,0,0,0,5,0,0,'NULL',1,'新手使用的披肩',1,0,NULL),
 (20,'c0002','麻布披肩',1,3,'c0011',0,0,0,0,0,0,0,10,0,0,'z01',1,'麻布披肩',1000,0,NULL),
 (21,'c0003','布披肩',1,3,'c0011',0,0,0,0,0,0,0,8,10,0,'z02',1,'布披肩',2500,0,NULL),
 (22,'c0004','麻布披風',1,3,'c0011',0,0,0,0,0,0,0,5,0,0,'NULL',1,'麻布披風',800,0,NULL),
 (23,'c0005','皮製披風',1,3,'c0011',0,0,0,0,0,0,0,10,0,0,'NULL',1,'皮製披風',1200,0,NULL),
 (24,'c0006','蠶絲披風',1,3,'c0011',0,0,0,0,0,0,0,8,10,0,'NULL',1,'蠶絲披風',2000,0,NULL),
 (25,'c0007','獸皮披肩',1,3,'c0011',0,0,0,0,0,0,0,5,0,0,'NULL',1,'獸皮披肩',2500,0,NULL),
 (26,'c0008','狼皮披風',1,3,'c0011',0,0,0,0,0,0,0,10,0,0,'NULL',1,'狼皮披風',3000,0,NULL),
 (27,'c0009','虎皮披風',1,3,'c0011',0,0,0,0,0,0,0,8,10,0,'NULL',1,'虎皮披風',4000,0,NULL),
 (28,'d0001','新手鞋',1,4,'d0033',0,0,0,0,5,0,0,0,0,0,'NULL',1,'新手使用的鞋',1,0,NULL),
 (29,'d0002','麻布鞋',1,4,'d0033',0,0,0,0,10,0,0,0,0,0,'z01',1,'麻布鞋',350,0,NULL),
 (30,'d0003','布鞋',1,4,'d0033',0,0,0,0,7,5,0,0,0,0,'z01',1,'布鞋',500,0,NULL),
 (31,'d0004','麻布長鞋',1,4,'d0033',0,0,0,0,15,0,0,0,0,0,'z01',1,'麻布長鞋',800,0,NULL),
 (32,'d0005','皮鞋',1,4,'d0033',0,0,0,0,20,0,0,0,0,0,'z02',1,'皮鞋',1200,0,NULL),
 (33,'d0006','蠶絲鞋',1,4,'d0033',0,0,0,0,12,8,0,0,0,0,'z02',1,'蠶絲鞋',2000,0,NULL),
 (34,'d0007','皮製長鞋',1,4,'d0033',0,0,0,0,25,0,0,0,0,0,'z02',1,'皮製長鞋',2500,0,NULL),
 (35,'d0008','精緻皮鞋',1,4,'d0033',0,0,0,0,30,0,0,0,0,0,'NULL',1,'精緻皮鞋',3000,0,NULL),
 (36,'d0009','精緻短靴',1,4,'d0033',0,0,0,0,22,10,0,0,0,0,'NULL',1,'精緻短靴',4000,0,NULL),
 (37,'e0001','新手指環',1,5,'e0031',0,0,2,0,2,0,0,0,0,0,'NULL',1,'新手使用的指環',1,0,NULL),
 (38,'e0002','木製指環',1,5,'e0031',0,0,5,0,5,0,0,0,0,0,'z01',1,'木製指環',350,0,NULL),
 (39,'e0003','陶土指環',1,5,'e0031',0,0,2,0,2,0,0,5,5,0,'z01',1,'陶土指環',500,0,NULL),
 (40,'e0004','玉指環',1,5,'e0031',0,0,8,0,8,0,0,0,0,0,'z01',1,'玉指環',800,0,NULL),
 (41,'e0005','銀指環',1,5,'e0031',0,0,10,0,10,0,0,0,0,0,'z02',1,'銀指環',1200,0,NULL),
 (42,'e0006','鐵指環',1,5,'e0031',0,0,8,0,8,0,0,10,10,0,'z02',1,'鐵指環',2000,0,NULL),
 (43,'e0007','銅指環',1,5,'e0031',0,0,13,0,13,0,0,0,0,0,'z02',1,'銅指環',2500,0,NULL),
 (44,'e0008','青銅指環',1,5,'e0031',0,0,15,0,15,0,0,0,0,0,'NULL',1,'青銅指環',3000,0,NULL),
 (45,'e0009','翡翠指環',1,5,'e0031',0,0,13,0,13,0,0,15,15,0,'NULL',1,'翡翠指環',4000,0,NULL),
 (46,'f0001','新手劍',1,6,'f0011',0,0,10,0,0,0,0,0,0,0,'NULL',1,'新手使用的劍',1,0,NULL),
 (47,'f0002','木劍',1,6,'f0011',0,0,15,0,0,0,0,0,0,0,'z01',1,'木劍',350,0,NULL),
 (48,'f0003','短匕首',1,6,'f0011',0,0,13,0,0,1,0,0,0,0,'z01',1,'短匕首',500,0,NULL),
 (49,'f0004','柴刀',1,6,'f0011',0,0,20,0,0,0,0,0,0,0,'z01',1,'柴刀',800,0,NULL),
 (50,'f0005','長劍',1,6,'f0011',0,0,25,0,0,0,0,0,0,0,'z02',1,'長劍',1200,0,NULL),
 (51,'f0006','斧頭',1,6,'f0011',0,0,22,0,0,3,0,0,0,0,'z02',1,'斧頭',2000,0,NULL),
 (52,'f0007','長槍',1,6,'f0011',0,0,30,0,0,0,0,0,0,0,'z02',1,'長槍',2500,0,NULL),
 (53,'f0008','鐵劍',1,6,'f0011',0,0,35,0,0,0,0,0,0,0,'NULL',1,'鐵劍',3000,0,NULL),
 (54,'f0009','鐵斧',1,6,'f0011',0,0,33,0,0,5,0,0,0,0,'NULL',1,'鐵斧',4000,0,NULL),
 (55,'g0001','小補散',2,1,'g0011',0,0,0,0,0,0,0,50,0,1,'z01',1,'小補散',20,0,NULL),
 (56,'g0002','小補丹',2,1,'g0011',0,0,0,0,0,0,0,80,0,1,'z01',1,'小補丹',35,0,NULL),
 (57,'g0003','大補散',2,1,'g0011',0,0,0,0,0,0,0,100,0,1,'z01',1,'大補散',50,0,NULL),
 (58,'g0004','大埔丹',2,1,'g0011',0,0,0,0,0,0,0,150,0,1,'z01',1,'大埔丹',100,0,NULL),
 (59,'g0005','小還散',2,2,'h0011',0,0,0,0,0,0,0,0,30,1,'z01',1,'小還散',20,0,NULL),
 (60,'g0006','小還丹',2,2,'h0011',0,0,0,0,0,0,0,0,50,1,'z01',1,'小還丹',35,0,NULL),
 (61,'g0007','大還散',2,2,'h0011',0,0,0,0,0,0,0,0,80,1,'z01',1,'大還散',50,0,NULL),
 (62,'g0008','大還丹',2,2,'h0011',0,0,0,0,0,0,0,0,100,1,'z01',1,'大還丹',100,0,NULL),
 (63,'g0009','回春散',2,3,'h0021',0,0,0,0,0,0,0,40,40,1,'z01',1,'回春散',40,0,NULL),
 (64,'g0010','回春丹',2,3,'h0021',0,0,0,0,0,0,0,100,100,1,'z01',1,'回春丹',80,0,NULL),
 (65,'h0001','雜物',3,1,'k0001',0,0,0,0,0,0,0,0,0,1,'NULL',1,'雜物',5,0,NULL),
 (66,'h0005','玉石',3,1,'e0021',0,0,0,0,0,0,0,0,0,1,'NULL',1,'玉石',1000,0,NULL),
 (67,'i0001','山賊的密件',3,2,'k0001',0,0,0,0,0,0,0,0,0,1,'NULL',0,'山賊的密件',0,0,NULL),
 (68,'i0002','山賊頭目的首級',3,2,'k0007',0,0,0,0,0,0,0,0,0,1,'NULL',0,'山賊頭目的首級',0,0,NULL),
 (69,'i0003','王小妹的髮飾',3,2,'e0051',0,0,0,0,0,0,0,0,0,1,'NULL',0,'王小妹的髮飾',0,0,NULL),
 (70,'i0004','羌族軍事情報',3,2,'k0001',0,0,0,0,0,0,0,0,0,1,'NULL',0,'羌族軍事情報',0,0,NULL),
 (71,'i0005','羌王求救信',3,2,'k0001',0,0,0,0,0,0,0,0,0,1,'NULL',0,'羌王求救信',0,0,NULL),
 (72,'i0006','羌族參謀信物',3,2,'e0021',0,0,0,0,0,0,0,0,0,1,'NULL',0,'羌族參謀信物',0,0,NULL),
 (73,'i0007','羌營配置圖(內營)',3,2,'k0016',0,0,0,0,0,0,0,0,0,1,'NULL',0,'羌營配置圖(內營)',0,0,NULL),
 (74,'i0008','羌營配置圖(外營)',3,2,'k0017',0,0,0,0,0,0,0,0,0,1,'NULL',0,'羌營配置圖(外營)',0,0,NULL),
 (75,'i0009','羌族之王首級',3,2,'k0007',0,0,0,0,0,0,0,0,0,1,'NULL',0,'羌族之王首級',0,0,NULL),
 (76,'i0010','劇毒蛇膽',3,2,'h0011',0,0,0,0,0,0,0,0,0,1,'NULL',0,'劇毒蛇膽',0,0,NULL),
 (77,'i0011','董老闆的古董',3,2,'l0011',0,0,0,0,0,0,0,0,0,1,'NULL',0,'董老闆的古董',0,0,NULL),
 (78,'i0012','太平人公令',3,2,'k0020',0,0,0,0,0,0,0,0,0,1,'NULL',0,'太平人公令',0,0,NULL),
 (79,'i0013','黃色頭巾',3,2,'a0061',0,0,0,0,0,0,0,0,0,1,'NULL',0,'黃色頭巾',0,0,NULL),
 (80,'i0014','黑風解毒藥',3,2,'g0061',0,0,0,0,0,0,0,0,0,1,'NULL',0,'黑風解毒藥',0,0,NULL),
 (81,'i0015','假古董',3,2,'k0019',0,0,0,0,0,0,0,0,0,1,'NULL',0,'假古董',0,0,NULL),
 (82,'i0016','假字畫',3,2,'l0071',0,0,0,0,0,0,0,0,0,1,'NULL',0,'假字畫',0,0,NULL),
 (83,'i0017','洛陽守軍服飾',3,2,'b0022',0,0,0,0,0,0,0,0,0,1,'NULL',0,'洛陽守軍服飾',0,0,NULL),
 (84,'i0018','洛陽守軍令牌',3,2,'e0042',0,0,0,0,0,0,0,0,0,1,'NULL',0,'洛陽守軍令牌',0,0,NULL),
 (85,'i0019','值錢的商品',3,2,'e0012',0,0,0,0,0,0,0,0,0,1,'NULL',0,'值錢的商品',0,0,NULL),
 (86,'i0020','吳禾重的信物',3,2,'f0072',0,0,0,0,0,0,0,0,0,1,'NULL',0,'吳禾重的信物',0,0,NULL),
 (87,'i0021','口令',3,2,'k0001',0,0,0,0,0,0,0,0,0,1,'NULL',0,'口令',0,0,NULL),
 (88,'i0022','禁軍令牌',3,2,'k0001',0,0,0,0,0,0,0,0,0,1,'NULL',0,'禁軍令牌',0,0,NULL),
 (89,'i0023','天公旗',3,2,'l0054',0,0,0,0,0,0,0,0,0,1,'NULL',0,'天公旗',0,0,NULL),
 (90,'i0024','地公旗',3,2,'l0055',0,0,0,0,0,0,0,0,0,1,'NULL',0,'地公旗',0,0,NULL),
 (91,'i0025','人公旗',3,2,'l0056',0,0,0,0,0,0,0,0,0,1,'NULL',0,'人公旗',0,0,NULL),
 (92,'i0026','人公將軍頭盔',3,2,'a0013',0,0,0,0,0,0,0,0,0,1,'NULL',0,'人公將軍頭盔',0,0,NULL),
 (93,'i0027','黃巾',3,2,'a0061',0,0,0,0,0,0,0,0,0,1,'NULL',0,'黃巾',0,0,NULL),
 (94,'i0028','太平要術摘要',3,2,'l0041',0,0,0,0,0,0,0,0,0,1,'NULL',0,'太平要術摘要',0,0,NULL),
 (95,'j0001','商城大補散',2,1,'k0008',0,0,0,0,0,0,0,200,0,1,'sp',1,'大補散',1,10,NULL),
 (96,'j0002','商城大還散',2,2,'k0008',0,0,0,0,0,0,0,0,160,1,'sp',1,'大還散',1,20,NULL);
/*!40000 ALTER TABLE `a3k_items` ENABLE KEYS */;


--
-- Definition of table `a3k_lvlchart`
--

DROP TABLE IF EXISTS `a3k_lvlchart`;
CREATE TABLE `a3k_lvlchart` (
  `lvlchart_id` int(10) unsigned NOT NULL auto_increment,
  `level` int(10) unsigned default '0' COMMENT '等級',
  `nextexp` int(10) unsigned default '0' COMMENT '所需經驗值',
  `lvl_rankname` varchar(10) NOT NULL COMMENT '等級稱為',
  PRIMARY KEY  (`lvlchart_id`),
  KEY `level` (`level`)
) ENGINE=MyISAM AUTO_INCREMENT=101 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC COMMENT='升級所需經驗 + 稱號; InnoDB free: 11264 kB';

--
-- Dumping data for table `a3k_lvlchart`
--

/*!40000 ALTER TABLE `a3k_lvlchart` DISABLE KEYS */;
INSERT INTO `a3k_lvlchart` (`lvlchart_id`,`level`,`nextexp`,`lvl_rankname`) VALUES 
 (1,1,100,'墨門弟子'),
 (2,2,100,'墨門弟子'),
 (3,3,100,'墨門弟子'),
 (4,4,100,'墨門弟子'),
 (5,5,100,'墨門弟子'),
 (6,6,100,'墨門弟子'),
 (7,7,100,'墨門弟子'),
 (8,8,100,'墨門弟子'),
 (9,9,100,'墨門弟子'),
 (10,10,100,'墨門弟子'),
 (11,11,100,'墨門習者'),
 (12,12,100,'墨門習者'),
 (13,13,100,'墨門習者'),
 (14,14,100,'墨門習者'),
 (15,15,100,'墨門習者'),
 (16,16,100,'墨門習者'),
 (17,17,100,'墨門習者'),
 (18,18,100,'墨門習者'),
 (19,19,100,'墨門習者'),
 (20,20,100,'墨門習者'),
 (21,21,100,'伍長'),
 (22,22,100,'伍長'),
 (23,23,100,'伍長'),
 (24,24,100,'伍長'),
 (25,25,100,'伍長'),
 (26,26,100,'伍長'),
 (27,27,100,'伍長'),
 (28,28,100,'伍長'),
 (29,29,100,'伍長'),
 (30,30,100,'伍長'),
 (31,31,100,'什長'),
 (32,32,100,'什長'),
 (33,33,100,'什長'),
 (34,34,100,'什長'),
 (35,35,100,'什長'),
 (36,36,100,'什長'),
 (37,37,100,'什長'),
 (38,38,100,'什長'),
 (39,39,100,'什長'),
 (40,40,100,'什長'),
 (41,41,100,'都伯'),
 (42,42,100,'都伯'),
 (43,43,100,'都伯'),
 (44,44,100,'都伯'),
 (45,45,100,'都伯'),
 (46,46,100,'都伯'),
 (47,47,100,'都伯'),
 (48,48,100,'都伯'),
 (49,49,100,'都伯'),
 (50,50,100,'都伯'),
 (51,51,100,'司馬'),
 (52,52,100,'司馬'),
 (53,53,100,'司馬'),
 (54,54,100,'司馬'),
 (55,55,100,'司馬'),
 (56,56,100,'司馬'),
 (57,57,100,'司馬'),
 (58,58,100,'司馬'),
 (59,59,100,'司馬'),
 (60,60,100,'司馬'),
 (61,61,100,'尉'),
 (62,62,100,'尉'),
 (63,63,100,'尉'),
 (64,64,100,'尉'),
 (65,65,100,'尉'),
 (66,66,100,'尉'),
 (67,67,100,'尉'),
 (68,68,100,'尉'),
 (69,69,100,'尉'),
 (70,70,100,'尉'),
 (71,71,100,'都尉'),
 (72,72,100,'都尉'),
 (73,73,100,'都尉'),
 (74,74,100,'都尉'),
 (75,75,100,'都尉'),
 (76,76,100,'都尉'),
 (77,77,100,'都尉'),
 (78,78,100,'都尉'),
 (79,79,100,'都尉'),
 (80,80,101,'都尉'),
 (81,81,102,'中郎將'),
 (82,82,103,'中郎將'),
 (83,83,104,'中郎將'),
 (84,84,105,'中郎將'),
 (85,85,106,'中郎將'),
 (86,86,107,'中郎將'),
 (87,87,108,'中郎將'),
 (88,88,109,'中郎將'),
 (89,89,110,'中郎將'),
 (90,90,111,'中郎將'),
 (91,91,112,'裨將軍'),
 (92,92,113,'裨將軍'),
 (93,93,114,'裨將軍'),
 (94,94,115,'裨將軍'),
 (95,95,116,'裨將軍'),
 (96,96,117,'裨將軍'),
 (97,97,118,'裨將軍'),
 (98,98,119,'裨將軍'),
 (99,99,120,'裨將軍'),
 (100,100,121,'裨將軍');
/*!40000 ALTER TABLE `a3k_lvlchart` ENABLE KEYS */;


--
-- Definition of table `a3k_map`
--

DROP TABLE IF EXISTS `a3k_map`;
CREATE TABLE `a3k_map` (
  `id` int(10) unsigned NOT NULL auto_increment,
  `map_state_name` varchar(20) default NULL,
  `map_city_name` varchar(20) default NULL,
  `map_player_lv` int(10) unsigned default NULL,
  `map_img` varchar(10) default NULL COMMENT '戰鬥背景圖檔名(多個) (rand)',
  `map_html` varchar(30) default NULL COMMENT 'reserve for mission like, when move jump to other page',
  `map_id` varchar(10) NOT NULL,
  `map_control` tinyint(1) NOT NULL default '0' COMMENT '地圖控制 0=> 戰鬥 1=> 城內',
  PRIMARY KEY  (`id`),
  KEY `map_id` (`map_id`),
  KEY `map_state_name` (`map_state_name`)
) ENGINE=MyISAM AUTO_INCREMENT=24 DEFAULT CHARSET=utf8 COMMENT='地圖表';

--
-- Dumping data for table `a3k_map`
--

/*!40000 ALTER TABLE `a3k_map` DISABLE KEYS */;
INSERT INTO `a3k_map` (`id`,`map_state_name`,`map_city_name`,`map_player_lv`,`map_img`,`map_html`,`map_id`,`map_control`) VALUES 
 (1,'墨門','墨門',0,'c1','city140.html','z00',1),
 (2,'墨門','墨門後山',0,'m0070','','x01',0),
 (3,'涼州','墨家邨(城鎮)',0,'c1','city140.html','z01',1),
 (4,'涼州','飛熊山麓(5)',5,'m0070','','a01',0),
 (5,'涼州','飛熊山道(10)',10,'m0090','','a02',0),
 (6,'涼州','金城沙漠(15)',15,'m0170','','a03',0),
 (7,'涼州','金城羌營(20)',20,'m0110','','a04',0),
 (8,'涼州','羌族根據地(25)',25,'m0110','','a05',0),
 (9,'雍州','雍州府(城鎮)',0,'c2','city1410.html','z02',1),
 (10,'雍州','隴西郡城(30)',30,'m0130','','b01',0),
 (11,'雍州','黑風洞(35)',35,'m0200','','b02',0),
 (12,'雍州','安定市集(40)',40,'m0060','','b03',0),
 (13,'司州','洛陽(城鎮)',0,'c3','city149.html','z03',1),
 (14,'司州','洛陽城郊(45)',45,'m0110','','c01',0),
 (15,'司州','洛陽皇城(50)',50,'m0140','','c02',0),
 (16,'司州','皇城內部(55)',55,'m0180','','c03',0),
 (17,'豫州','豫州府(城鎮)',0,'c4','city148.html','z04',1),
 (18,'豫州','汝南郡(60)',60,'m0070','','d01',0),
 (19,'兗州','兗州府(城鎮)',0,'c5','city147.html','z05',1),
 (20,'兗州','東郡(65)',65,'m0070','','e01',0),
 (21,'冀州','冀州府(城鎮)',0,'c6','city147.html','z06',1),
 (22,'冀州','廣宗(70)',70,'m0070','','f01',0),
 (23,'冀州','鉅鹿郡(75)',70,'m0070','','f02',0);
/*!40000 ALTER TABLE `a3k_map` ENABLE KEYS */;


--
-- Definition of table `a3k_monster`
--

DROP TABLE IF EXISTS `a3k_monster`;
CREATE TABLE `a3k_monster` (
  `p_id` int(10) unsigned NOT NULL auto_increment,
  `p_at` int(10) unsigned NOT NULL default '0' COMMENT '攻擊力',
  `p_df` int(10) unsigned NOT NULL default '0' COMMENT '防禦力',
  `p_agl` int(10) unsigned NOT NULL default '0' COMMENT '速度',
  `p_name` varchar(10) NOT NULL default '--' COMMENT '怪名',
  `p_hp` int(10) unsigned NOT NULL default '0' COMMENT '體力',
  `p_lv` int(10) unsigned NOT NULL default '0' COMMENT '等級',
  `d_id` varchar(100) default '0' COMMENT '掉落物ID',
  `p_topr` smallint(5) unsigned default '0' COMMENT '調物機率',
  `p_map` varchar(10) NOT NULL COMMENT '出現地圖',
  `p_img` varchar(10) default NULL COMMENT '圖檔名',
  `pf_ids` varchar(100) default NULL COMMENT '帶的同伴(seperate by `  )',
  `p_1001_id` varchar(10) NOT NULL default '0' COMMENT '1001ya 企劃用',
  PRIMARY KEY  (`p_id`),
  KEY `p_map` (`p_map`),
  KEY `p_1001_id` (`p_1001_id`)
) ENGINE=MyISAM AUTO_INCREMENT=262 DEFAULT CHARSET=utf8;

--
-- Dumping data for table `a3k_monster`
--

/*!40000 ALTER TABLE `a3k_monster` DISABLE KEYS */;
INSERT INTO `a3k_monster` (`p_id`,`p_at`,`p_df`,`p_agl`,`p_name`,`p_hp`,`p_lv`,`d_id`,`p_topr`,`p_map`,`p_img`,`pf_ids`,`p_1001_id`) VALUES 
 (37,30,22,5,'搭米2',50,1,'',0,'a04','n0542','a01004','a04009'),
 (36,35,27,5,'搭米1',50,1,'',0,'a04','n0542','a01003','a04008'),
 (35,120,90,42,'羌族之王',200,22,'',0,'a04','n0300','a04007','a04007'),
 (34,114,85,38,'金城精兵校尉',180,21,'',0,'a04','n0462','a04006','a04006'),
 (33,108,82,35,'金城精兵',180,20,'',0,'a04','n0460','a04005','a04005'),
 (32,105,76,32,'羌族護糧軍',165,19,'',0,'a04','n0314','a04004','a04004'),
 (31,100,72,30,'羌族先鋒',165,18,'',0,'a04','n0313','a04003','a04003'),
 (30,98,68,28,'羌族參謀',150,16,'i0004',100,'a04','n0390','a04002','a04002'),
 (29,95,66,25,'金城雜兵',150,16,'',0,'a04','n0312','a04001','a04001'),
 (28,40,27,5,'搭米5',50,1,'',0,'a03','n0542','a01007','a03011'),
 (27,40,30,5,'搭米4',50,1,'',0,'a03','n0542','a01006','a03010'),
 (26,37,29,5,'搭米3',50,1,'',0,'a03','n0542','a01005','a03009'),
 (25,30,22,5,'搭米2',50,1,'',0,'a03','n0542','a01004','a03008'),
 (24,35,27,5,'搭米1',50,1,'',0,'a03','n0542','a01003','a03007'),
 (23,99,72,35,'樊稠',150,15,'',0,'a03','n0150','a03006','a03006'),
 (22,90,65,30,'張濟',140,14,'',0,'a03','n0080','a03005','a03005'),
 (21,85,60,28,'涼州精兵校尉',135,14,'',0,'a03','n0050','a03004','a03004'),
 (20,84,56,26,'涼州校尉',110,13,'',0,'a03','n0012','a03003','a03003'),
 (19,83,55,24,'涼州士兵',108,13,'',0,'a03','n0010','a03002','a03002'),
 (18,82,55,23,'董卓姪兒',105,12,'i0003',100,'a03','n0380','a03001','a03001'),
 (17,40,30,15,'董家小兵',95,7,'',0,'a02','n0285','a02004`a02005`a02006`a02007`a02008','a02008'),
 (16,40,28,13,'董家私兵',80,7,'',0,'a02','n0281','a02004`a02005`a02006`a02007`a02008','a02007'),
 (15,38,27,11,'董家雜兵',80,6,'',0,'a02','n0281','a02004`a02005`a02006`a02007`a02008','a02006'),
 (14,35,27,10,'董家傭人',75,6,'',0,'a02','n0280','a02004`a02005`a02006`a02007`a02008','a02005'),
 (13,33,25,10,'董家護衛',75,6,'',0,'a02','n0270','a02004`a02005`a02006`a02007`a02008','a02004'),
 (12,62,42,25,'山賊頭目',120,10,'i0002',100,'a02','n0270','a02003`a02004`a02005`a02006`a02007`a02008','a02003'),
 (11,60,38,22,'山賊精兵',90,9,'',0,'a02','n0295','a02002`a02004`a02005`a02006`a02007`a02008','a02002'),
 (10,58,35,20,'山賊雜兵',90,8,'i0001',100,'a02','n0330','a02001`a02004`a02005`a02006`a02007`a02008','a02001'),
 (9,25,25,5,'山賊小兵',45,3,'',0,'a01','n0333','a01003`a01004`a01005`a01006`a01007`a01008','a01008'),
 (1,5,5,5,'小盜賊',20,1,'',0,'x01','n0333','x01001','x01001'),
 (2,52,30,6,'野熊',60,4,'',0,'a01','n0541','a01001`a01003`a01004`a01005`a01006`a01007`a01008','a01001'),
 (3,55,33,8,'吃人野熊',75,5,'',0,'a01','n0542','a01002`a01001`a01003`a01004`a01005`a01006`a01007`a01008','a01002'),
 (4,28,22,5,'噬血猛虎',35,1,'',0,'a01','n0532','a01003`a01004`a01005`a01006`a01007`a01008','a01003'),
 (5,27,23,5,'致命毒蛇',40,1,'',0,'a01','n0550','a01003`a01004`a01005`a01006`a01007`a01008','a01004'),
 (6,25,23,5,'飢餓山狼',50,2,'',0,'a01','n0562','a01003`a01004`a01005`a01006`a01007`a01008','a01005'),
 (7,26,24,5,'凶狠野狼',42,2,'',0,'a01','n0561','a01003`a01004`a01005`a01006`a01007`a01008','a01006'),
 (8,25,22,5,'山賊雜兵',40,3,'',0,'a01','n0334','a01003`a01004`a01005`a01006`a01007`a01008','a01007'),
 (89,30,22,5,'搭米2',50,1,'',0,'c01','n0542','a01004','c01007'),
 (88,35,27,5,'搭米1',50,1,'',0,'c01','n0542','a01003','c01006'),
 (87,215,190,76,'吳禾重',475,47,'i0020',100,'c01','n0392','c01005','c01005'),
 (86,205,180,72,'黃巾旅人',440,45,'',0,'c01','n0235','c01004','c01004'),
 (85,195,175,70,'黃巾道人',425,44,'',0,'c01','n0215','c01003','c01003'),
 (84,188,168,68,'富商護衛',395,43,'i0019',100,'c01','n0170','c01002','c01002'),
 (83,180,162,65,'洛陽守軍',380,43,'i0017`i0018',100,'c01','n0050','c01001','c01001'),
 (82,40,27,5,'搭米5',50,1,'',0,'b03','n0542','a01007','b03009'),
 (81,40,30,5,'搭米4',50,1,'',0,'b03','n0542','a01006','b03008'),
 (80,37,29,5,'搭米3',50,1,'',0,'b03','n0542','a01005','b03007'),
 (79,30,22,5,'搭米2',50,1,'',0,'b03','n0542','a01004','b03006'),
 (78,35,27,5,'搭米1',50,1,'',0,'b03','n0542','a01003','b03005'),
 (77,190,165,69,'胡悠',400,41,'',0,'b03','n0240','b03003','b03004'),
 (76,175,160,67,'胡悠護衛',358,40,'',0,'b03','n0220','b03003','b03003'),
 (75,172,145,62,'安定黑店老闆',370,38,'i0015`i0016',100,'b03','n0284','b03002','b03002'),
 (74,165,130,60,'黃巾密探',350,37,'',0,'b03','n0371','b03001','b03001'),
 (73,40,27,5,'搭米5',50,1,'',0,'b02','n0542','a01007','b02010'),
 (72,40,30,5,'搭米4',50,1,'',0,'b02','n0542','a01006','b02009'),
 (71,37,29,5,'搭米3',50,1,'',0,'b02','n0542','a01005','b02008'),
 (70,30,22,5,'搭米2',50,1,'',0,'b02','n0542','a01004','b02007'),
 (69,35,27,5,'搭米1',50,1,'',0,'b02','n0542','a01003','b02006'),
 (68,175,140,65,'馬扁子',360,36,'',0,'b02','n0210','b02005','b02005'),
 (67,161,138,61,'馬扁子護衛',340,35,'',0,'b02','n0200','b02004','b02004'),
 (66,160,130,59,'黑風洞主',310,34,'',0,'b02','n0381','b02003','b02003'),
 (65,155,124,58,'黑風副洞主',295,33,'i0014',100,'b02','n0270','b02002','b02002'),
 (90,37,29,5,'搭米3',50,1,'',0,'c01','n0542','a01005','c01008'),
 (64,150,120,56,'黑風悍匪',280,32,'i0013',100,'b02','n0401','b02001','b02001'),
 (63,40,27,5,'搭米5',50,1,'',0,'b01','n0542','a01007','b01011'),
 (62,40,30,5,'搭米4',50,1,'',0,'b01','n0542','a01006','b01010'),
 (61,37,29,5,'搭米3',50,1,'',0,'b01','n0542','a01005','b01009'),
 (60,30,22,5,'搭米2',50,1,'',0,'b01','n0542','a01004','b01008'),
 (59,35,27,5,'搭米1',50,1,'',0,'b01','n0542','a01003','b01007'),
 (58,160,125,55,'可疑的悍匪首腦',300,31,'',0,'b01','n0283','b01006','b01006'),
 (57,150,118,50,'可疑的隴西悍匪',290,30,'',0,'b01','n0281','b01005','b01005'),
 (56,142,115,51,'隴西響馬',275,30,'',0,'b01','n0344','b01004','b01004'),
 (55,135,107,48,'隴西悍匪',260,29,'i0012',100,'b01','n0281','b01003','b01003'),
 (54,133,101,46,'隴西竊賊',250,29,'i0011',100,'b01','n0292','b01002','b01002'),
 (53,128,97,44,'野外毒蛇',242,27,'i0010',100,'b01','n0552','b01001','b01001'),
 (52,40,27,5,'搭米5',50,1,'',0,'a05','n0542','a01007','a05012'),
 (51,40,30,5,'搭米4',50,1,'',0,'a05','n0542','a01006','a05011'),
 (50,37,29,5,'搭米3',50,1,'',0,'a05','n0542','a01005','a05010'),
 (49,30,22,5,'搭米2',50,1,'',0,'a05','n0542','a01004','a05009'),
 (48,35,27,5,'搭米1',50,1,'',0,'a05','n0542','a01003','a05008'),
 (47,140,105,45,'羌族之王',250,27,'i0009',100,'a05','n0300','a05007','a05007'),
 (46,125,100,44,'羌族大將',240,25,'',0,'a05','n0420','a05006','a05006'),
 (45,120,85,42,'羌族軍師',230,25,'',0,'a05','n0392','a05005','a05005'),
 (44,115,90,41,'羌兵統領',220,24,'i0007`i0008',100,'a05','n0385','a05004','a05004'),
 (43,110,100,42,'嗜血惡虎',210,23,'',0,'a05','n0532','a05003','a05003'),
 (42,118,85,38,'塞上惡虎',200,23,'',0,'a05','n0535','a05002','a05002'),
 (40,40,27,5,'搭米5',50,1,'',0,'a04','n0542','a01007','a04012'),
 (41,115,85,30,'羌族信差',190,22,'i0005`i0006',100,'a05','n0411','a05001','a05001'),
 (39,40,30,5,'搭米4',50,1,'',0,'a04','n0542','a01006','a04011'),
 (38,37,29,5,'搭米3',50,1,'',0,'a04','n0542','a01005','a04010'),
 (91,40,30,5,'搭米4',50,1,'',0,'c01','n0542','a01006','c01009'),
 (92,40,27,5,'搭米5',50,1,'',0,'c01','n0542','a01007','c01010'),
 (93,210,185,72,'皇城禁軍守衛',450,47,'i0021',100,'c02','n0392','c02001','c02001'),
 (94,213,188,75,'皇城禁軍守衛',460,48,'i0022',100,'c02','n0392','c02002','c02002'),
 (95,216,187,78,'夏惲',468,49,'',0,'c02','n0260','c02003','c02003'),
 (96,218,190,78,'郭勝',472,49,'',0,'c02','n0261','c02004','c02004'),
 (97,217,191,78,'張讓',480,49,'',0,'c02','n0262','c02005','c02005'),
 (98,221,192,80,'封諝',490,49,'',0,'c02','n0263','c02006','c02006'),
 (99,220,193,80,'段珪',500,50,'',0,'c02','n0264','c02007','c02007'),
 (100,224,194,80,'曹節',505,50,'',0,'c02','n0265','c02008','c02008'),
 (101,222,195,82,'侯覽',510,50,'',0,'c02','n0262','c02009','c02009'),
 (102,227,197,82,'程曠',515,50,'',0,'c02','n0263','c02010','c02010'),
 (103,225,199,84,'趙忠',520,51,'',0,'c02','n0264','c02011','c02011'),
 (104,230,200,85,'蹇碩',525,52,'',0,'c02','n0265','c02012','c02012'),
 (105,35,27,5,'搭米1',50,1,'',0,'c02','n0542','a01003','c02013'),
 (106,30,22,5,'搭米2',50,1,'',0,'c02','n0542','a01004','c02014'),
 (107,37,29,5,'搭米3',50,1,'',0,'c02','n0542','a01005','c02015'),
 (108,40,30,5,'搭米4',50,1,'',0,'c02','n0542','a01006','c02016'),
 (109,40,27,5,'搭米5',50,1,'',0,'c02','n0542','a01007','c02017'),
 (110,165,117,97,'反叛的禁衛軍',101,53,'',0,'c03','n0393','c03001','c03001'),
 (111,168,119,98,'太平妖道',121,54,'',0,'c03','n0212','c03002','c03002'),
 (112,170,120,100,'黃巾力士',32,55,'',0,'c03','n0201','c03003','c03003'),
 (113,172,122,101,'人公黃巾力士',72,56,'',0,'c03','n0200','c03004','c03004'),
 (114,174,124,103,'張梁',87,57,'',0,'c03','n0165','c03005','c03005'),
 (115,35,27,5,'搭米1',50,1,'',0,'c03','n0542','a01003','c03006'),
 (116,30,22,5,'搭米2',50,1,'',0,'c03','n0542','a01004','c03007'),
 (117,37,29,5,'搭米3',50,1,'',0,'c03','n0542','a01005','c03008'),
 (118,40,30,5,'搭米4',50,1,'',0,'c03','n0542','a01006','c03009'),
 (119,40,27,5,'搭米5',50,1,'',0,'c03','n0542','a01007','c03010'),
 (120,177,125,104,'黃巾妖道',102,58,'i0023`i0024`i0025',100,'d01','n0213','d01001','d01001'),
 (121,179,127,106,'黃巾力士',122,58,'',0,'d01','n0202','d01002','d01002'),
 (122,181,129,107,'高升',33,59,'',0,'d01','n0403','d01003','d01003'),
 (123,184,130,109,'黃巾守營士兵',73,59,'',0,'d01','n0222','d01004','d01004'),
 (124,186,132,111,'黃巾守營校尉',88,60,'',0,'d01','n0234','d01005','d01005'),
 (125,188,134,112,'地公親衛隊',103,61,'',0,'d01','n0443','d01006','d01006'),
 (126,190,136,114,'地公妖術師',123,62,'',0,'d01','n0214','d01007','d01007'),
 (127,193,137,115,'張寶',34,63,'',0,'d01','n0062','d01008','d01008'),
 (128,35,27,5,'搭米1',50,1,'',0,'d01','n0542','a01003','d01009'),
 (129,30,22,5,'搭米2',50,1,'',0,'d01','n0542','a01004','d01010'),
 (130,37,29,5,'搭米3',50,1,'',0,'d01','n0542','a01005','d01011'),
 (131,40,30,5,'搭米4',50,1,'',0,'d01','n0542','a01006','d01012'),
 (132,40,27,5,'搭米5',50,1,'',0,'d01','n0542','a01007','d01013'),
 (133,195,139,117,'黃巾戰將',74,64,'',0,'e01','n0175','e01001','e01001'),
 (134,197,141,118,'黃巾援軍',89,65,'',0,'e01','n0224','e01002','e01002'),
 (135,199,142,120,'黃巾力士',104,65,'',0,'e01','n0200','e01003','e01003'),
 (136,202,144,121,'鄧茂',124,66,'',0,'e01','n0195','e01004','e01004'),
 (137,204,146,123,'人公妖術師',35,66,'',0,'e01','n0213','e01005','e01005'),
 (138,206,147,125,'張梁',75,67,'i0026',100,'e01','n0165','e01006','e01006'),
 (139,35,27,5,'搭米1',50,1,'',0,'e01','n0542','a01003','e01007'),
 (140,30,22,5,'搭米2',50,1,'',0,'e01','n0542','a01004','e01008'),
 (141,37,29,5,'搭米3',50,1,'',0,'e01','n0542','a01005','e01009'),
 (142,40,30,5,'搭米4',50,1,'',0,'e01','n0542','a01006','e01010'),
 (143,40,27,5,'搭米5',50,1,'',0,'e01','n0542','a01007','e01011'),
 (144,208,149,126,'可疑的行人',90,68,'i0027',100,'f01','n0285','f01001','f01001'),
 (145,211,151,128,'天公道人',105,69,'i0028',100,'f01','n0212','f01002','f01002'),
 (146,213,152,129,'黃巾死士',125,70,'',0,'f01','n0385','f01003','f01003'),
 (147,215,154,131,'黃巾力士',36,71,'',0,'f01','n0205','f01004','f01004'),
 (148,218,156,132,'天公將軍分身',76,72,'',0,'f01','h0170','f01005','f01005'),
 (149,35,27,5,'搭米1',50,1,'',0,'f01','n0542','a01003','f01006'),
 (150,30,22,5,'搭米2',50,1,'',0,'f01','n0542','a01004','f01007'),
 (151,37,29,5,'搭米3',50,1,'',0,'f01','n0542','a01005','f01008'),
 (152,40,30,5,'搭米4',50,1,'',0,'f01','n0542','a01006','f01009'),
 (153,40,27,5,'搭米5',50,1,'',0,'f01','n0542','a01007','f01010'),
 (154,220,158,134,'黃巾力士',91,72,'',0,'f02','n0203','f02001','f02001'),
 (155,222,159,135,'黃巾突圍軍',106,73,'',0,'f02','n0441','f02002','f02002'),
 (156,224,161,137,'黃巾道士',126,73,'',0,'f02','n0215','f02003','f02003'),
 (157,227,163,139,'黃巾守衛軍',37,74,'',0,'f02','n0235','f02004','f02004'),
 (158,229,164,140,'黃巾校尉',77,76,'',0,'f02','n0191','f02005','f02005'),
 (159,231,166,142,'天公將軍化身',92,77,'',0,'f02','h0170','f02006','f02006'),
 (160,233,168,143,'張角',107,78,'',0,'f02','h0170','f02007','f02007'),
 (161,236,169,145,'黃巾力士',127,79,'',0,'f02','h0170','f02008','f02008'),
 (162,35,27,5,'搭米1',50,1,'',0,'f02','n0542','a01003','f02009'),
 (163,30,22,5,'搭米2',50,1,'',0,'f02','n0542','a01004','f02010'),
 (164,37,29,5,'搭米3',50,1,'',0,'f02','n0542','a01005','f02011'),
 (165,40,30,5,'搭米4',50,1,'',0,'f02','n0542','a01006','f02012'),
 (166,40,27,5,'搭米5',50,1,'',0,'f02','n0542','a01007','f02013');
/*!40000 ALTER TABLE `a3k_monster` ENABLE KEYS */;


--
-- Definition of table `a3k_player`
--

DROP TABLE IF EXISTS `a3k_player`;
CREATE TABLE `a3k_player` (
  `p_id` int(10) unsigned NOT NULL auto_increment,
  `p_capt_attempts` int(3) NOT NULL default '0' COMMENT '認證嘗試數',
  `p_locktime` datetime default NULL COMMENT '鎖帳號時間',
  `p_name` varchar(20) NOT NULL default '--' COMMENT '玩家名稱',
  `p_at` int(10) unsigned NOT NULL default '0' COMMENT '物理攻擊力',
  `p_df` int(10) unsigned NOT NULL default '0' COMMENT '物理防禦力',
  `p_str` smallint(10) unsigned NOT NULL default '0' COMMENT '力量',
  `p_vit` smallint(10) unsigned NOT NULL default '0' COMMENT '體魄',
  `p_smart` smallint(10) unsigned NOT NULL default '0' COMMENT '智力',
  `p_agl` smallint(10) unsigned NOT NULL default '0' COMMENT '敏捷',
  `p_hp` int(10) unsigned NOT NULL default '0' COMMENT 'HP(體力)現在值',
  `p_hpmax` int(10) unsigned NOT NULL default '0' COMMENT 'HP(體力)最大值',
  `role_id` varchar(10) NOT NULL COMMENT '職業ID',
  `p_money` int(10) unsigned NOT NULL default '0' COMMENT '金錢現在值(最大值暫定為100萬)',
  `p_lv` int(10) unsigned NOT NULL default '0' COMMENT '等級',
  `p_exp` int(10) unsigned NOT NULL default '0' COMMENT '目前經驗值',
  `p_nextexp` int(10) unsigned NOT NULL default '0' COMMENT '升級所需經驗',
  `p_win` int(10) unsigned NOT NULL default '0' COMMENT '勝場數',
  `p_lost` int(10) unsigned NOT NULL default '0' COMMENT '敗場數',
  `p_sex` tinyint(1) unsigned NOT NULL default '0' COMMENT '玩家性別',
  `p_img` varchar(10) NOT NULL default '0' COMMENT '頭像ID',
  `p_act_time` datetime default NULL COMMENT '最後動作時間',
  `p_createdate` datetime default NULL COMMENT '帳號建立時間',
  `p_map` varchar(10) NOT NULL COMMENT '玩家在哪',
  `p_bank` int(10) unsigned NOT NULL default '0' COMMENT '銀行',
  `f_1001ya` varchar(100) default NULL COMMENT '1001ya key',
  `p_mn` int(10) unsigned NOT NULL default '0' COMMENT 'Mana(精神力)最大值',
  `p_mnmax` int(10) unsigned NOT NULL default '0' COMMENT 'Mana(精神力)最大值',
  `pf_id` int(10) unsigned default NULL COMMENT '帶的武將',
  `p_rankname` varchar(20) default NULL COMMENT '官職(稱號)',
  `p_bone` int(10) unsigned NOT NULL default '0' COMMENT '根骨',
  `p_fight_time` datetime default NULL COMMENT '最後戰鬥時間',
  `p_guild` int(10) unsigned NOT NULL default '0' COMMENT '工會',
  `p_team` int(10) unsigned NOT NULL default '0' COMMENT '組隊',
  `p_blacklist` text NOT NULL COMMENT '黑名單',
  `p_packsize_1` int(10) NOT NULL default '25' COMMENT '背包大小 for type 1;1',
  `p_packsize_2` int(11) NOT NULL default '25',
  `p_packsize_3` int(11) NOT NULL default '25',
  `p_packsize_4` int(11) NOT NULL default '25',
  `p_learn` int(10) unsigned NOT NULL default '0' COMMENT '學點',
  `p_r_money` int(10) unsigned NOT NULL default '0' COMMENT '商城幣',
  `promo_code` varchar(45) default NULL COMMENT '行銷碼',
  PRIMARY KEY  USING BTREE (`p_id`),
  KEY `p_map` (`p_map`),
  KEY `role_id` (`role_id`)
) ENGINE=InnoDB AUTO_INCREMENT=1341 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `a3k_player`
--

/*!40000 ALTER TABLE `a3k_player` DISABLE KEYS */;
INSERT INTO `a3k_player` (`p_id`,`p_capt_attempts`,`p_locktime`,`p_name`,`p_at`,`p_df`,`p_str`,`p_vit`,`p_smart`,`p_agl`,`p_hp`,`p_hpmax`,`role_id`,`p_money`,`p_lv`,`p_exp`,`p_nextexp`,`p_win`,`p_lost`,`p_sex`,`p_img`,`p_act_time`,`p_createdate`,`p_map`,`p_bank`,`f_1001ya`,`p_mn`,`p_mnmax`,`pf_id`,`p_rankname`,`p_bone`,`p_fight_time`,`p_guild`,`p_team`,`p_blacklist`,`p_packsize_1`,`p_packsize_2`,`p_packsize_3`,`p_packsize_4`,`p_learn`,`p_r_money`,`promo_code`) VALUES 
 (1000,0,NULL,'﻿admin',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1001,0,NULL,'r2d12',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1002,0,NULL,'胖胖珊寶妹',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1003,0,NULL,'8-Dec',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1004,0,NULL,'你妳你妳',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1005,0,NULL,'微笑薔薇',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1006,0,NULL,'大吞兵衛',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1007,0,NULL,'漆漆金槍俠',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1008,0,NULL,'有本事來PK',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1009,0,NULL,'好得',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1010,0,NULL,'黃老師',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1011,0,NULL,'瘋狂寶馬',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1012,0,NULL,'VianbigEyes',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1013,0,NULL,'美慧',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1014,0,NULL,'三支香',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1015,0,NULL,'SQUEEZE',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1016,0,NULL,'安安孃',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1017,0,NULL,'富貴列車',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1018,0,NULL,'英雄門',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1019,0,NULL,'嗚啦拉蝦嘎',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1020,0,NULL,'金閃閃',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1021,0,NULL,'巧克與肥鳥',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1022,0,NULL,'加藤櫻',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1023,0,NULL,'西西理佩恩',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1024,0,NULL,'阿輝伯',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1025,0,NULL,'豬哥榮',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1026,0,NULL,'阿巧丟細哇',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1027,0,NULL,'贏贏梅黛子',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1028,0,NULL,'包租婆婆',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1029,0,NULL,'查理三世',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1030,0,NULL,'汪健敏',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1031,0,NULL,'限制級戰警',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1032,0,NULL,'霹靂火',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1033,0,NULL,'不來了痞特',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1034,0,NULL,'賣豬肉零零七',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1035,0,NULL,'夜訪吸血鬼',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1036,0,NULL,'靚妹妹',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1037,0,NULL,'項郎尬哇比',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1038,0,NULL,'高橋健太',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1039,0,NULL,'野田愛莎',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1040,0,NULL,'千島菜菜子',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1041,0,NULL,'減肥ing',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1042,0,NULL,'請你吃芭樂',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1043,0,NULL,'做人也風流',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1044,0,NULL,'o我叫小町o',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1045,0,NULL,'幸福來臨時',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1046,0,NULL,'o神射手o',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1047,0,NULL,'挖搭細',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1048,0,NULL,'我得意的飄',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1049,0,NULL,'唉o老梗o',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1050,0,NULL,'叫我Queen',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1051,0,NULL,'我很帥',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1052,0,NULL,'現在是搶劫',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1053,0,NULL,'Nemesis',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1054,0,NULL,'蜜糖剉冰',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1055,0,NULL,'七支菸',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1056,0,NULL,'藍藍路',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1057,0,NULL,'飄飄然',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1058,0,NULL,'艾薩克',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1059,0,NULL,'紫燕',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1060,0,NULL,'fight一發',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1061,0,NULL,'無敵星星',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1062,0,NULL,'精靈樂章',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1063,0,NULL,'麻將獵人',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1064,0,NULL,'全民打麻將',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1065,0,NULL,'麻將火',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1066,0,NULL,'一起樂翻天',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1067,0,NULL,'百人斬',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1068,0,NULL,'孩子王胖虎',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1069,0,NULL,'BlackTea',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1070,0,NULL,'我要中樂透',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1071,0,NULL,'黃金天神',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1072,0,NULL,'酷酷跩哥',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1073,0,NULL,'燒肉',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1074,0,NULL,'藍色左岸',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1075,0,NULL,'想想可樂果',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1076,0,NULL,'OceanBlue',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1077,0,NULL,'DarkMoon',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1078,0,NULL,'惡魔貓貓',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1079,0,NULL,'天使狗狗',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1080,0,NULL,'可爾必思綠茶',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1081,0,NULL,'白目國中生',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1082,0,NULL,'sazabi',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1083,0,NULL,'烏龜',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1084,0,NULL,'草原飛翔',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1085,0,NULL,'觀自在',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1086,0,NULL,'小西',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1087,0,NULL,'藍色羽翼',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1088,0,NULL,'粉紅寶貝',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1089,0,NULL,'藍天之愛',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1090,0,NULL,'黃昏雨魅',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1091,0,NULL,'甜甜',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1092,0,NULL,'楓星傻咩',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1093,0,NULL,'疾雪幻',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1094,0,NULL,'雪幻淚雨亭',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1095,0,NULL,'沙摩爾',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1096,0,NULL,'瓦卡加',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1097,0,NULL,'玥姬',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1098,0,NULL,'熙安',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1099,0,NULL,'苑鬼',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1100,0,NULL,'漓之沐',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1101,0,NULL,'雷卡霂',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1102,0,NULL,'晴未雨',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1103,0,NULL,'桐茗',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1104,0,NULL,'血美人',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1105,0,NULL,'毒玫瑰',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1106,0,NULL,'刺藤蔓',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1107,0,NULL,'瘋詭',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1108,0,NULL,'斐尋',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1109,0,NULL,'白衣人',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1110,0,NULL,'毒針',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1111,0,NULL,'晨不明',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1112,0,NULL,'丹楓',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1113,0,NULL,'清風揚',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1114,0,NULL,'露西野',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1115,0,NULL,'席夢飛',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1116,0,NULL,'糖果盒子',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1117,0,NULL,'酸桔子',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1118,0,NULL,'邪火舞',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1119,0,NULL,'井上蒼松',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1120,0,NULL,'冷白凜',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1121,0,NULL,'植也澄希',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1122,0,NULL,'古桐愛',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1123,0,NULL,'罄吾兒',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1124,0,NULL,'官杍書',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1125,0,NULL,'紅梅',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1126,0,NULL,'田中秋葉',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1127,0,NULL,'月上薰',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1128,0,NULL,'沈劍虹',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1129,0,NULL,'葉飄揚',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1130,0,NULL,'慕醉雪',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1131,0,NULL,'樊伊思',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1132,0,NULL,'南又祺',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1133,0,NULL,'秋凝',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1134,0,NULL,'凝卉',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1135,0,NULL,'綺蕊',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1136,0,NULL,'依萱',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1137,0,NULL,'傲珊',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1138,0,NULL,'凌萱',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1139,0,NULL,'南曼',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1140,0,NULL,'迎竹',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1141,0,NULL,'元露',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1142,0,NULL,'青瑤',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1143,0,NULL,'芷嵐',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1144,0,NULL,'谷萱',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1145,0,NULL,'惜桃',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1146,0,NULL,'憐南',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1147,0,NULL,'丹海',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1148,0,NULL,'涵波',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1149,0,NULL,'巧桃',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1150,0,NULL,'又彤',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1151,0,NULL,'夜之',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1152,0,NULL,'笑荷',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1153,0,NULL,'思秋',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1154,0,NULL,'惜風',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1155,0,NULL,'易夢',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1156,0,NULL,'懷陽',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1157,0,NULL,'翠荷',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1158,0,NULL,'小安',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1159,0,NULL,'涵霜',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1160,0,NULL,'天之',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1161,0,NULL,'亦芹',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1162,0,NULL,'語夏',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1163,0,NULL,'詩柳',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1164,0,NULL,'新風',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1165,0,NULL,'盼柳',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1166,0,NULL,'慕雁',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1167,0,NULL,'海煙',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1168,0,NULL,'以香',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1169,0,NULL,'冰云',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1170,0,NULL,'采霜',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1171,0,NULL,'之亦',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1172,0,NULL,'向陽',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1173,0,NULL,'易薇',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1174,0,NULL,'山天',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1175,0,NULL,'孤萱',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1176,0,NULL,'巧藍',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1177,0,NULL,'沛凡',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1178,0,NULL,'雅陽',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1179,0,NULL,'問蓮',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1180,0,NULL,'映翠',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1181,0,NULL,'慕白',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1182,0,NULL,'小容',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1183,0,NULL,'樂凡',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1184,0,NULL,'從文',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1185,0,NULL,'寒旋',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1186,0,NULL,'又萱',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1187,0,NULL,'依冬',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1188,0,NULL,'尋柳',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1189,0,NULL,'惜松',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1190,0,NULL,'之蝶',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1191,0,NULL,'凝寒',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1192,0,NULL,'靖絲',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1193,0,NULL,'語雙',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1194,0,NULL,'綠天',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1195,0,NULL,'凡南',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1196,0,NULL,'涵絲',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1197,0,NULL,'癡霜',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1198,0,NULL,'書陽',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1199,0,NULL,'海筠',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1200,0,NULL,'恨筠',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1201,0,NULL,'傲陽',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1202,0,NULL,'冰秋',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1203,0,NULL,'山文',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1204,0,NULL,'雁蕊',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1205,0,NULL,'碧風',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1206,0,NULL,'尋凝',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1207,0,NULL,'詩萍',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1208,0,NULL,'靖珍',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1209,0,NULL,'綺藍',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1210,0,NULL,'南煙',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1211,0,NULL,'丹珍',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1212,0,NULL,'幻萱',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1213,0,NULL,'癡珍',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1214,0,NULL,'笑梅',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1215,0,NULL,'醉萍',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1216,0,NULL,'以露',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1217,0,NULL,'聽柔',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1218,0,NULL,'笑彤',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1219,0,NULL,'雁煙',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1220,0,NULL,'若秋',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1221,0,NULL,'雅雙',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1222,0,NULL,'凡文',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1223,0,NULL,'覓春',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1224,0,NULL,'友云',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1225,0,NULL,'笑荷',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1226,0,NULL,'元芙',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1227,0,NULL,'安薇',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1228,0,NULL,'初柳',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1229,0,NULL,'代安',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1230,0,NULL,'癡亦',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1231,0,NULL,'元曼',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1232,0,NULL,'含玉',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1233,0,NULL,'小筠',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1234,0,NULL,'傲秋',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1235,0,NULL,'谷陽',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1236,0,NULL,'語彤',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1237,0,NULL,'易雪',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1238,0,NULL,'千丹',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1239,0,NULL,'代嵐',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1240,0,NULL,'以夏',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1241,0,NULL,'谷薇',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1242,0,NULL,'醉彤',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1243,0,NULL,'向蕊',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1244,0,NULL,'樂菡',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1245,0,NULL,'書竹',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1246,0,NULL,'慕蕾',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1247,0,NULL,'天楓',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1248,0,NULL,'雪萱',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1249,0,NULL,'含雪',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1250,0,NULL,'冬蕾',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1251,0,NULL,'綺珊',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1252,0,NULL,'宛雲',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1253,0,NULL,'綠兒',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1254,0,NULL,'恨海',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1255,0,NULL,'尋南',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1256,0,NULL,'碧兒',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1257,0,NULL,'傲文',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1258,0,NULL,'樂梅',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1259,0,NULL,'靜旋',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1260,0,NULL,'平嵐',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1261,0,NULL,'又易',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1262,0,NULL,'依凡',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1263,0,NULL,'憐竹',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1264,0,NULL,'冰柔',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1265,0,NULL,'書蓉',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1266,0,NULL,'靜山',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1267,0,NULL,'海柏',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1268,0,NULL,'恨文',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1269,0,NULL,'訪安',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1270,0,NULL,'雅雙',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1271,0,NULL,'含薇',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1272,0,NULL,'雨曼',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1273,0,NULL,'書夏',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1274,0,NULL,'千芹',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1275,0,NULL,'平真',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1276,0,NULL,'友海',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1277,0,NULL,'谷菱',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1278,0,NULL,'以波',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1279,0,NULL,'冷嵐',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1280,0,NULL,'妙巧',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1281,0,NULL,'白綠',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1282,0,NULL,'宛巧',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1283,0,NULL,'涵柳',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1284,0,NULL,'香安',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1285,0,NULL,'幼卉',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1286,0,NULL,'谷芙',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1287,0,NULL,'依雪',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1288,0,NULL,'曉巧',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1289,0,NULL,'幼柏',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1290,0,NULL,'亦楓',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1291,0,NULL,'靖芙',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1292,0,NULL,'綠雲',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1293,0,NULL,'慕夏',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1294,0,NULL,'以絲',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1295,0,NULL,'秋旋',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1296,0,NULL,'凝香',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1297,0,NULL,'靖靈',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1298,0,NULL,'沛青',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1299,0,NULL,'懷之',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1300,0,NULL,'凌南',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1301,0,NULL,'靖楓',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1302,0,NULL,'惜芹',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1303,0,NULL,'尋梅',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1304,0,NULL,'依薇',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1305,0,NULL,'水絲',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1306,0,NULL,'安筠',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1307,0,NULL,'從夏',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1308,0,NULL,'翠松',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1309,0,NULL,'靜青',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1310,0,NULL,'青蓮',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1311,0,NULL,'寒蓮',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1312,0,NULL,'靈菡',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1313,0,NULL,'夢蓮',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1314,0,NULL,'依蕊',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1315,0,NULL,'覓蓮',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1316,0,NULL,'夢玉',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1317,0,NULL,'醉冬',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1318,0,NULL,'凝夢',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1319,0,NULL,'孤山',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1320,0,NULL,'迎嵐',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1321,0,NULL,'雪兒',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1322,0,NULL,'向萱',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1323,0,NULL,'訪菡',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1324,0,NULL,'覓青',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1325,0,NULL,'雪曼',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1326,0,NULL,'靖松',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1327,0,NULL,'千冬',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1328,0,NULL,'若凡',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1329,0,NULL,'書陽',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1330,0,NULL,'以風',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1331,0,NULL,'丹蕊',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1332,0,NULL,'沛靈',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1333,0,NULL,'暉',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1334,0,NULL,'灸言',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1335,0,NULL,'逸',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1336,0,NULL,'殘陽',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1337,0,NULL,'霜',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL);
INSERT INTO `a3k_player` (`p_id`,`p_capt_attempts`,`p_locktime`,`p_name`,`p_at`,`p_df`,`p_str`,`p_vit`,`p_smart`,`p_agl`,`p_hp`,`p_hpmax`,`role_id`,`p_money`,`p_lv`,`p_exp`,`p_nextexp`,`p_win`,`p_lost`,`p_sex`,`p_img`,`p_act_time`,`p_createdate`,`p_map`,`p_bank`,`f_1001ya`,`p_mn`,`p_mnmax`,`pf_id`,`p_rankname`,`p_bone`,`p_fight_time`,`p_guild`,`p_team`,`p_blacklist`,`p_packsize_1`,`p_packsize_2`,`p_packsize_3`,`p_packsize_4`,`p_learn`,`p_r_money`,`promo_code`) VALUES 
 (1338,0,NULL,'流',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1339,0,NULL,'清天',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,0,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL),
 (1340,0,NULL,'曘雲',20,20,10,10,10,10,50,50,'a01',100,1,90,100,1,1,1,'p0050',NULL,'2009-07-21 22:10:05','a01',0,'robot',30,30,NULL,'墨門弟子',10,NULL,0,0,'',25,25,25,25,0,0,NULL);
/*!40000 ALTER TABLE `a3k_player` ENABLE KEYS */;


--
-- Definition of table `a3k_player_item`
--

DROP TABLE IF EXISTS `a3k_player_item`;
CREATE TABLE `a3k_player_item` (
  `id` int(10) unsigned NOT NULL auto_increment,
  `p_id` int(10) unsigned NOT NULL,
  `item_id` varchar(10) NOT NULL,
  `item_eq` tinyint(1) default '0',
  `item_stacknum` smallint(5) unsigned default '1',
  PRIMARY KEY  (`id`),
  KEY `p_id` (`p_id`),
  KEY `item_id` (`item_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `a3k_player_item`
--

/*!40000 ALTER TABLE `a3k_player_item` DISABLE KEYS */;
/*!40000 ALTER TABLE `a3k_player_item` ENABLE KEYS */;


--
-- Definition of table `a3k_player_store`
--

DROP TABLE IF EXISTS `a3k_player_store`;
CREATE TABLE `a3k_player_store` (
  `id` int(10) unsigned NOT NULL auto_increment,
  `p_id` int(10) unsigned NOT NULL,
  `item_id` varchar(50) NOT NULL,
  `usetime` datetime default NULL COMMENT '領取時間',
  PRIMARY KEY  (`id`),
  KEY `p_id` (`p_id`),
  KEY `item_id` (`item_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `a3k_player_store`
--

/*!40000 ALTER TABLE `a3k_player_store` DISABLE KEYS */;
/*!40000 ALTER TABLE `a3k_player_store` ENABLE KEYS */;


--
-- Definition of table `a3k_quest`
--

DROP TABLE IF EXISTS `a3k_quest`;
CREATE TABLE `a3k_quest` (
  `q_id` varchar(10) NOT NULL,
  `q_title` varchar(50) default NULL,
  `q_requester` varchar(20) default NULL,
  `q_img` varchar(10) default NULL,
  `q_map_name` varchar(20) default NULL,
  `q_map_id` varchar(10) default NULL,
  `q_show_lv` int(10) default NULL,
  `q_description` text,
  `q_dest_map` varchar(50) default NULL,
  `q_expireTime` int(10) default NULL,
  `q_type` tinyint(3) NOT NULL default '1',
  `q_instant` tinyint(3) NOT NULL default '1',
  PRIMARY KEY  (`q_id`),
  KEY `q_map_id` (`q_map_id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Dumping data for table `a3k_quest`
--

/*!40000 ALTER TABLE `a3k_quest` DISABLE KEYS */;
INSERT INTO `a3k_quest` (`q_id`,`q_title`,`q_requester`,`q_img`,`q_map_name`,`q_map_id`,`q_show_lv`,`q_description`,`q_dest_map`,`q_expireTime`,`q_type`,`q_instant`) VALUES 
 ('q00001','墨門成年禮(一)','墨雲師父','n0062','墨家邨','z01',1,'墨門弟子！你們修練也有一段時間了，為師該教的也都教了。自古有云：「師父領進門，修行在個人。」現在是該畢業，闖蕩江湖的時候了！為師對你們的要求不多，只希望身為墨門弟子，別忘墨門宗旨！所有墨門弟子都要經過成年禮的試煉，飛熊山麓是為師給你們的第一場試驗。飛熊山麓，山峻險惡，猛獸聚集，山麓居民總活在驚恐中。所以好徒兒們，快動身前往飛熊山麓吧！活用所學，挑戰自我，發揚墨家，兼愛天下！','飛熊山麓',NULL,1,0),
 ('q00002','墨門成年禮(二)','墨雲師父','n0062','墨家邨','z01',1,'好徒兒們，冬季過後，夏季來臨，為師要提醒你們，飛熊山麓的野熊也正飢腸轆轆地等著大快朵頤鮮美的人肉。已傳聞有些居民們遇害了！因此為師要正在飛熊山麓修練的你們，保護當地居民，免受野熊的傷害。當然這些野熊也不是好惹的，為師希望你們別太大意而成了野熊肚中物！','飛熊山麓',NULL,1,0),
 ('q00003','墨門成年禮(三)','墨雲師父','n0062','墨家邨','z01',1,'墨門弟子看到這龐然大物，有些驚恐，但幾番廝鬥下來，也習慣這野熊的功擊模式，便不留情地將這些吃人的畜牲給殺了，完成了試煉。這時墨雲師父說：「徒兒們，為師接到當地居民的感謝之函，知道你們順利的擊退了的野熊。但天災除去，人禍卻不斷，當地居民在信中乞求為師能幫他們懲奸除惡。飛熊山道一直以來都是居民來往城鎮的重要道路，如今卻被一票山賊雜兵蠻橫的佔據，這群山賊雜兵，目無章法，強奪這些孱弱村民的錢財，墨門不能不管，讓他們囂張下去，所以為師要你們去替村民出口氣！」','飛熊山麓',NULL,1,0),
 ('q00004','墨門的歷史','墨雲師父','n0062','墨家邨','z01',7,'各位大俠們，歡迎加入','飛熊山道',NULL,1,0),
 ('q00005','墨門的組織','墨雲師父','n0062','墨家邨','z01',8,'墨門組織分為三層：習者、墨者、鉅子。一開始為習者，便是學習修練基本功夫，等修練到了一定的程度後，將能通過測驗晉升為墨者，墨者即是藉著基本功夫的靈活運用搭配著不同武器的使用，提身自己的能力後，再度晉升為鉅子，鉅子已具有善用武將，練功練法的能力了。','飛熊山道',NULL,1,1),
 ('q00006','成為墨門習者(一)','墨雲師父','n0062','墨家邨','z01',9,'墨雲師父在詢問這批在飛熊山麓被降伏的山賊雜兵們時，山賊雜兵因為貪生怕死，為了苟活不惜出賣自己的組織，而說出了他們的首領似乎正跟某個秘密組織一起策畫叛亂活動。不過這些低下的山賊知道的只是些皮毛，所以墨雲師父說：「徒兒你們可要精明點，在與山賊雜兵作戰時，除了降伏他們之外，不要忘了最重要的是要多打探些他們密謀的線索出來。」','飛熊山道',NULL,1,0),
 ('q00007','成為墨門習者(二)','墨雲師父','n0062','墨家邨','z01',10,'墨門弟子殺了個山賊們處處竄逃，取得山賊手中的密件後，發現山賊中還有一批山賊精兵潛伏於飛熊山道中做接應，雖然還不太明瞭這群山賊精兵在搞什麼花樣，但看那獐頭鼠目的臉孔就知道不是什麼好東西，想的一定是什麼邪門歪道，所以快捉些山賊精兵來問問，看他們在變什麼蚊子。','飛熊山道',NULL,1,0),
 ('q00008','成為墨門習者(三)','墨雲師父','n0062','墨家邨','z01',10,'抓來這群精兵後，果然不出墨雲師父所料，在一番殘酷襪子塞嘴的盤問後，山賊精兵說出了山賊頭目想霸佔整各山熊飛麓的想法，山賊頭目滿腦子就是錢財以及山麓居民中那些未滿１８歲的可口稚嫩的小姑娘們。這沒腦袋的山賊頭目色慾薰心的以為我墨門會放任他胡作非為，墨雲師父在知道那山賊頭目滿肚的壞水後說：「徒兒們，去把這山賊頭目給打了！即便這山賊頭目沒啥腦子，但還是頗有力量的，不然也不能掌控這些惡徒賊子。這山賊頭目正好可成為你們晉升墨門習者的試煉！」','飛熊山道',NULL,1,0),
 ('q00009','涼州惡霸','王大娘','n0510','墨家邨','z01',11,'董卓姪兒董簧搶了我的女兒後，前往金城，老婦拜託墨門的壯士們快快前往金城沙漠看能不能追到董卓姪兒，以及收集到他擄人的證據！','金城沙漠',NULL,1,0),
 ('q00010','為民除霸','王大娘','n0510','墨家邨','z01',11,'王大娘哭著跑來說：「墨雲師父救命啊！我那不滿18歲的小女兒，被那董卓的姪兒董簧給搶走了！」（董簧，董卓的姪兒，平日仗勢欺人，最愛強奪良家婦女，納為己下，當地居民私下給了他一個綽號叫「梁州一霸」）董簧他們把我小女兒帶往金城去。我到衙門報官去，哪知官府害怕那董家勢力，看我老婦，沒錢沒勢，一腳竟把我踹了出來，我實在求助無門啊！墨雲師父聽了老婦請求後，要小師叔快馬傳令墨門弟子：「墨門弟子，為師我，要你們幫王大娘懲罰那個仗勢欺人的惡混。」','金城沙漠',NULL,1,0),
 ('q00011','惡霸復仇','王大娘','n0510','墨家邨','z01',13,'墨門弟子接到墨雲師父的指令，趨馬追趕涼州一霸。遇到董簧後，不客氣的給了他一頓教訓！董簧被墨門子弟教訓後，覺得面子都丟光了，咽不下這口氣，帶人來報仇。董簧帶了人，衝到了王大娘家，嗆聲說：「誰敢與我董簧為敵，我將要他小命！」王大娘嚇的兩腿發軟求饒，董簧要王大娘帶話給墨雲師父，叫他好膽別走！墨雲師父知道後，派墨家弟子到王大娘家。王大娘一把鼻涕一把眼淚的說：「謝謝各位大人來保護老婦一家，老婦感激不盡，來生再做牛做馬，報答各位的恩情！','金城沙漠',NULL,1,0),
 ('q00012','董氏家將(一)','李儒','n0130','墨家邨','z01',13,'墨門弟子跟董簧一番廝鬥後，董簧果然不敵墨門弟子的攻擊。這時，董卓女婿李儒，得知董簧又再外惹事生非，董卓才剛高官上任，不宜有任何出錯來壞董卓名聲。李儒也來到王大娘家，看董簧已被打趴在地，吐著血，叫囂著說：「放開老子！」李儒看了看情形，知道是自家人無理，但自古無「胳臂向外灣」的道理在。為了維護董家的聲望，便與墨門弟子開出三戰之約 ，若是墨門弟子戰敗，則需向董家道歉，並不再追究此事；若墨門子弟戰勝，那董家孽子將不可再有尋仇之舉！','金城沙漠',NULL,1,0),
 ('q00013','董氏家將(二)','李儒','n0130','墨家邨','z01',13,'王大娘瑟縮在旁，一聽李儒說完，便走到了墨門子弟身旁說：「墨門大俠，您就答應了吧！您不可能時時刻刻的保護著我們，若您不答應董家的要求，老婦一家便永無安寧的一天！」仔細想想有理，墨門子弟怎能放任天下事不管，每天當王大娘的保鑣呢！這時李儒邊等回應邊來回踱步盤算著，要怎能打贏這場戰。墨門弟子答應了李儒的要求，李儒便轉身跟董家的武將們說：「待會張濟你先上，探探對方的底子到哪？對了，可別戰死丟我董家臉，保著一條命，留得青山在，不再沒材燒！」','金城沙漠',NULL,1,0),
 ('q00014','董氏家將(三)','李儒','n0130','墨家邨','z01',13,'刀光劍影，吭吭鏘鏘，血四處飛濺，張濟似乎抵擋不了！這時張濟一個不注意，被墨門弟子用刀一揮，胸前濺出了一到鮮紅的液體，張濟一摸，自知自己的武藝強不過別人，想起李儒剛剛說的：「留得青山在，不怕沒材燒，要是為了董簧那個狗娘養的，丟了一條命！也太不值了！」於是張濟拿出一條小內褲說：「我認輸了！」這時李儒知道墨門子弟果然厲害，叫樊稠等家將快出來迎戰！結果樊稠也不敵墨門弟子！最後，李儒：「墨門大俠，果然舞藝驚人，李儒我深感佩服，我這就遵守約定，閃人！」','金城沙漠',NULL,1,0),
 ('q00015','涼州刺史(ㄧ)','中郎將牛輔','n0423','墨家邨','z01',13,'李儒回到董家，將王大娘一事告知中郎將牛輔。牛輔目前幫董家養兵練兵。得知墨門子弟武功非凡，若能與我董家結合，將來鐵定會不得了。便向李儒打探墨門子弟在哪？李儒說完後，牛輔飛的似到王家附近，巧遇到墨門子弟一行人。牛輔拉住韁繩，躍下馬背，報上自己來頭後說：「聽聞大俠您，武藝高強，您可知董卓一家乃江東大戶，董大人愛好結交天下俠客，若是您不嫌棄，我可以引薦您與董卓認識，想在三國飛黃騰達，這不是人人都有，難能可貴的機會！我看你也蠻投緣的才願意牽線！所以你覺得哩？','墨家邨',NULL,1,1),
 ('q00016','涼州刺史(二)','董卓','n0251','墨家邨','z01',15,'墨門弟子在接受牛輔的意見後，與董卓相識。當然董卓也好奇墨門弟子的實力有多少。最近涼州不斷有金城羌族來騷擾，董卓心想可藉此機會試試墨門弟子的身手。董卓說：「傳聞墨門弟子武藝高強，平日行俠仗義，為民除害。最近金城羌族不安分想造反，騷擾涼州一帶居民，我董卓正頭痛該怎麼給這羌族一點顏色，讓他們知道誰才是老大！。因此我希望你能為涼州百姓挺身而出，為我董卓了一個心頭之患，但為了確保你有能力與羌族交戰，我得先測試一下你的身手，假若通過試驗，我將會派遣中郎將牛輔隨你征討外族去。','金城沙漠',NULL,1,0),
 ('q00017','金城羌族','董卓','n0251','墨家邨','z01',15,'在董卓確認墨門子弟的能力後說：「你不愧是墨門的勇猛武將，董卓我佩服佩服，希望你快快加入與金城羌族的戰鬥之中，讓金城羌族別再騷擾我涼州人民了！','金城沙漠',NULL,1,0),
 ('q00018','羌族的陰謀','董卓','n0251','墨家邨','z01',17,'在與羌族士兵對戰的過程中，董卓意外發現羌族除了騷擾涼州人民外，似乎還別有企圖，但目前所知還是有限。此時的董卓嗅出一股不尋常之味，知道這羌族不是省油之燈，一定有什麼秘密，如果不快點查清楚，將來一定會是個禍患。而董卓也觀察到墨門弟子除了武藝高強外，智慧高超，深謀遠慮，正好可以借墨門弟子之力來查探羌族的詭計。因此董卓說：「壯士們，這羌族狡猾多端，不應該只是騷擾人民便可感到滿足，想必還另有企圖在，所以我希望你在潛入金城羌營後，能伺機打探出羌族的軍事情報，讓我們可以大破敵軍。」','金城沙漠',NULL,1,0),
 ('q00019','金城羌王來襲','董卓','n0251','墨家邨','z01',20,'在得到軍事情報後，發現原來這金城羌王早已秘密來到羌營，準備親自指揮作戰。這羌王看來為了造反，早就有所準備了。情報中得知，羌王一直暗中要人訓練一組先鋒人馬，作為特攻隊，要殺的我董卓個措手不及，好家在有先得到這軍事情報，為了不讓那老羌賊計謀得逞，先鋒部隊的剷除，必是第一要件！因此董卓招集墨門弟子說：「據情報得知，羌族老王訓練了一組先鋒隊，這羌族先鋒一定要先攻破，不然一定會威脅我軍，因此我希望你能先幫我方擊破對要害，讓我涼州兵能直搗黃龍，逮那羌族老王！」','金城羌營',NULL,1,0),
 ('q00020','包圍羌王','董卓','n0251','墨家邨','z01',21,'「民以食為天，沒有餓肚子的戰士能上場殺敵」董卓再得知羌營的糧倉儲存著滿滿的糧食後，心想那羌族已作好長期與我們抗戰的決心了！要是能佔領了那羌族的糧倉，讓他們沒飯可吃，我看再強的將士，只能有當軟腳蝦份了！董卓立刻叫來墨門弟子說：「為了不要消耗我方太多戰力，我想那糧倉的佔領將會成了戰局成敗的關鍵！因此一定要拿下糧倉！」','金城羌營',NULL,1,0),
 ('q00021','攻打金城','董卓','n0251','墨家邨','z01',21,'墨門弟子到了金城，佔領了糧倉後，便與涼州軍官一同打算一舉消滅羌王。而董卓在得知羌王身邊有金城精兵校尉帶著一群金城精兵保護著。董卓便跟墨門弟子說：「要拿下哪老羌王，似乎沒這麼容易，那老賊身旁有一堆精兵保護著，想逮到羌王，得先破了那些精兵，所以要辛苦你了，不過這些精兵不會是你的對手的！」','金城羌營',NULL,1,0),
 ('q00022','追擊羌王','董卓','n0251','墨家邨','z01',21,'在墨門弟子大破精兵，快能逮到羌王中，董卓不慎讓羌王逃脫。董卓為了自己的大意，氣的三天三夜無法入眠。心想為了杜絕後患，這羌王一定要捉到手，若不斬草除根，哪知一道春風吹來，會不會害了自己！所以董卓只好再拜託墨門弟子說：「我董卓一生謹慎，哪知不小心大意，讓羌王給逃了！我董卓深知，若不抓了那羌王，我涼州人民便不能安穩入睡。所以我要你快與涼州官兵一同追擊，帶人在羌族根據地進行地毯式搜索，掃蕩所有的餘賊。」','羌族根據地',NULL,1,0),
 ('q00023','羌王求援','董卓','n0251','墨家邨','z01',21,'在墨門弟子與涼州軍官掃蕩羌族根據地的時候，羌王得知董卓不會放過自己，而自己目前軍力所剩無幾，若不快點向外尋求救援，將難逃一死！董卓獲得線報，羌王正秘密向外求。董卓怎能讓羌王得逞，因此告訴墨門弟子說：「你一定要斬斷這些外援管道，免得羌王壯大勢力後，那要剷除就難了！」','羌族根據地',NULL,1,0),
 ('q00024','羌族猛虎','董卓','n0251','墨家邨','z01',23,'涼州軍官在搜索的過程中，不知羌族中還飼養著一群猛虎，這猛虎牙齒鋒利，速度敏捷，力大無窮，一般人根本無法抵當猛虎的攻擊，而這群涼州軍官遇到猛虎，死傷慘重！董卓得知後便昭傳墨門弟子說：「猛虎讓我討伐部隊死傷慘重，因此還是需要借用你的天生神力，殺了這群猛虎，為我軍開路。」','羌族根據地',NULL,1,0),
 ('q00025','羌營配置圖','董卓','n0251','墨家邨','z01',23,'為了不讓這狡猾的羌王再次逃脫，因此得先取得羌兵統領身上，具有詳細記載羌營部屬的配置圖，請你快去想辦法從駐守金城羌營的羌兵統令身上取來。','羌族根據地',NULL,1,0),
 ('q00026','羌王的末日(一)','董卓','n0251','墨家邨','z01',23,'天時地利人和，萬事俱全，但還一有個隱憂，即是羌王身邊的軍師與羌族大將，要是能除掉它們，那羌王就成了我的囊中之物，就算天兵神將也救不了他了！','羌族根據地',NULL,1,0),
 ('q00027','羌王的末日(二)','董卓','n0251','墨家邨','z01',25,'決戰的時間到了，先取得羌王首級者必有大賞','羌族根據地',NULL,1,0),
 ('q00028','前往雍州','董卓','n0251','墨家邨','z01',25,'解決了羌王，你想前往雍州遊歷，董卓知道無法留住你，除了給你承諾不變得友誼之外，同時告訴你最近有人以宗教名義作亂的奇怪風聲，要你到了雍州時小心行事','羌族根據地',NULL,1,1),
 ('q00029','救人如救火','吳老伯','n0341','雍州府(城鎮)','z02',26,'平時作小生意養家的吳老伯最疼愛的小兒子突然得了癲癇之症，他堅信只有大賢良師的徒弟馬扁子才能醫治，馬扁子跟他說需要隴西郡城周圍的劇毒蛇膽才能救治，希望你幫忙尋找','隴西郡城',NULL,1,0),
 ('q00030','生病的刺史','邢師爺','n0242','雍州府(城鎮)','z02',26,'雍州刺史的師爺與涼州李傕素有交情，最近雍州牧突然病倒導致雍州政府無人，周圍悍匪肆虐，希望你看在李傕的面子上協助他去清除這些悍匪','隴西郡城',NULL,1,0),
 ('q00031','協助邢師爺','邢師爺','n0242','雍州府(城鎮)','z02',27,'刺史的病情越來越嚴重，邢師爺相信只有悲天憫人的太平道願意解救，在籌備太平道需要的金錢這段時間，希望你能協助守護隴西郡城','隴西郡城',NULL,1,0),
 ('q00032','白衣大耳少年','白衣大耳少年','h0010','雍州府(城鎮)','z02',27,'這個神秘的大耳少年告訴你刺史的病與最近雍州百姓遇到的事情似乎並不單純，希望你與他一同探查隴西郡城周圍看看是否有些蛛絲馬跡','隴西郡城',NULL,1,0),
 ('q00033','是病還是毒','白衣大耳少年','h0010','雍州府(城鎮)','z02',28,'大耳少年告訴你，他在幽州時聽說過太平人公令似乎是太平道中人才有的，看來刺史的或許是太平道的人下毒所致，看來需要抓到更多可疑的人物的首腦才能瞭解內情','隴西郡城',NULL,1,0),
 ('q00034','可疑的太平道','白衣大耳少年','h0010','雍州府(城鎮)','z02',28,'抓到的首腦沒有明確證據跟太平道有關，大耳少年希望你能去悍匪的巢穴黑風洞看看是否有太平道的蹤跡','隴西郡城',NULL,1,0),
 ('q00035','用毒高手','白衣大耳少年','h0010','雍州府(城鎮)','z02',30,'在探查黑風洞的時候大耳少年不小心中了毒，幸好用了他師父給的黃連解毒丸壓制住毒性，不過中毒的症狀跟雍州刺史相同，想要完全根治需要先查出誰是這個用毒的高手','黑風洞',NULL,1,0),
 ('q00036','強奪解毒藥','白衣大耳少年','h0010','雍州府(城鎮)','z02',30,'經由黑風洞的俘虜中得知土匪黑風洞主與太平道合作希望在雍州培植太平道的影響力，而黑風副洞主正是用毒的高手，所以首先要從他手中奪取解毒藥','黑風洞',NULL,1,0),
 ('q00037','清除黑風惡勢力','白衣大耳少年','h0010','雍州府(城鎮)','z02',32,'解了毒之後該為雍州百姓清除黑風惡勢力了','黑風洞',NULL,1,0),
 ('q00038','俘虜馬扁子','白衣大耳少年','h0010','雍州府(城鎮)','z02',33,'清除黑風惡勢力之後，為了瞭解太平道全盤計畫要俘虜馬扁子','黑風洞',NULL,1,0),
 ('q00039','安定市集','白衣大耳少年','h0010','雍州府(城鎮)','z02',36,'俘虜馬扁子之後他願意歸順你，並說出太平道在雍州不只有他，在安定市集中還有一個胡悠率領一些從雍州吸收的死忠教眾，如果想殲滅他們你必須先到安定市集探查','安定市集',NULL,1,0),
 ('q00040','再探安定','白衣大耳少年','h0010','雍州府(城鎮)','z02',35,'在安定市集探查時，引起太平道中人對你的警覺心，為了繼續在此活動，必須先消除這些探子','安定市集',NULL,1,0),
 ('q00041','危險的市集','白衣大耳少年','h0010','雍州府(城鎮)','z02',36,'在消除密探的同時發現安定市集不但成為太平道在雍州擴張勢力的根據地，同時還有許多委裝成商人的太平道中人使用假的古董與字畫來詐取錢財，為了要求得雍州官府的協助，首先必須先從安定黑店老闆手中取得這些假貨來當作證據','安定市集',NULL,1,0),
 ('q00042','包圍安定市集','白衣大耳少年','h0010','雍州府(城鎮)','z02',37,'有了證據之後，雍州刺史派兵包圍安定市集，為了預防有漏網之魚，希望你一同協助包圍','安定市集',NULL,1,0),
 ('q00043','擒殺胡悠','白衣大耳少年','h0010','雍州府(城鎮)','z02',40,'擒賊先擒王，捉拿作亂的胡悠之後安定自然能安定下來，但是要擊敗擒殺胡悠也不是容易的','安定市集',NULL,1,0),
 ('q00044','前往司州','白衣大耳少年','h0010','雍州府(城鎮)','z02',40,'從胡悠藏身處找到的太平密令瞭解到太平妖人正準備與皇城中的貪官合作企圖擁皇自重，配合皇城週邊的太平道起義，為了漢室江山，必須儘速趕往皇城','安定市集',NULL,1,1),
 ('q00045','各方勢力','墨門密探','n0321','洛陽(城鎮)','z03',41,'在洛陽沒有朋友協助的情況之下，只好請師門中的墨門密探幫忙探查消息，鑑於目前洛陽中各方勢力暗中角力，墨門密探建議你先在洛陽城郊晃晃，或許能察覺一些秘密','洛陽城郊',NULL,1,0),
 ('q00046','奸臣義子','墨門密探','n0321','洛陽(城鎮)','z03',42,'在洛陽城郊探索時發現十常侍一起認的義子「吳禾重」最近常與一些洛陽守軍在洛陽城郊鬼鬼祟祟的，墨門密探建議你先想辦法取得一套洛陽守軍的衣服與令牌，在伺機混入當中看看他們到底在幹嗎','洛陽城郊',NULL,1,0),
 ('q00047','欺壓百姓','吳禾重','n0393','洛陽(城鎮)','z03',42,'你成功混入洛陽守軍，吳禾重藉著十常侍的勢力調動軍隊幫助他欺壓百姓，意圖搶奪進入洛陽的商人們所攜帶的物品，為了得到吳禾重的信任，只好作一回壞人','洛陽城郊',NULL,1,0),
 ('q00048','陰謀詭計','吳禾重','n0393','洛陽(城鎮)','z03',42,'你的身手獲得吳禾重的好評，決定重用你，原來太平道的人假借自己能使神蹟，十常侍近來與當朝大將軍何進爭權奪利，希望利用太平道黃巾仙人的法術增加當今皇上對十常侍的信任，','洛陽城郊',NULL,1,1),
 ('q00049','黃巾仙人','墨門密探','n0321','洛陽(城鎮)','z03',42,'你與墨門密探交換情報之後都覺得太平道不可能單單只想得到皇帝的信任，必有更大的圖謀，墨門密探建議你先去探查太平道的實際用意，他會試著與大將軍何進的門人搭上線，才有可能阻止十常侍','洛陽城郊',NULL,1,0),
 ('q00050','先下手為強','大將軍何進','n0094','洛陽(城鎮)','z03',43,'經由探查得知太平道不只想要挾持天子，有想要推翻漢朝的打算，與大將軍何進見面之後，何進希望你先抓到躲在洛陽城郊的吳禾重，增加到時與十常侍談判的籌碼','洛陽城郊',NULL,1,0),
 ('q00051','混入皇城','大將軍何進','n0094','洛陽(城鎮)','z03',46,'洛陽皇城在十常侍的控制之下警備森嚴，大將軍何進希望你能先混入皇城從皇城禁軍守衛手中奪取禁軍令牌與口令，好讓大將軍的人馬混入皇城','洛陽皇城',NULL,1,0),
 ('q00052','混水摸魚','大將軍何進','n0094','洛陽(城鎮)','z03',46,'大將軍何進希望你在皇城中製造一些混亂，好讓他的人馬可以藉機混入禁軍當中','洛陽皇城',NULL,1,0),
 ('q00053','擒拿十常侍(一)','大將軍何進','n0094','洛陽(城鎮)','z03',47,'雖然大將軍的人馬都以混入禁均，可是似乎無法完全控制住洛陽皇城，所以大將軍決定假裝包圍皇城，而你藉機在皇城內把十常侍抓住','洛陽皇城',NULL,1,0),
 ('q00054','擒拿十常侍(二)','大將軍何進','n0094','洛陽(城鎮)','z03',47,'嘴炮','洛陽皇城',NULL,1,0),
 ('q00055','擒拿十常侍(三)','大將軍何進','n0094','洛陽(城鎮)','z03',47,'嘴炮','洛陽皇城',NULL,1,0),
 ('q00056','擒拿十常侍(四)','大將軍何進','n0094','洛陽(城鎮)','z03',47,'嘴炮','洛陽皇城',NULL,1,0),
 ('q00057','擒拿十常侍(五)','大將軍何進','n0094','洛陽(城鎮)','z03',47,'嘴炮','洛陽皇城',NULL,1,0),
 ('q00058','螳螂捕蟬','墨門密探','n0321','洛陽(城鎮)','z03',51,'在你捉拿十常侍的時候，太平道中人見事機敗露，率信徒衝到皇城內部，眼看漢靈帝就要落入太平妖人手中，你只有趕快衝進皇城內部伺機救人','皇城內部',NULL,1,0),
 ('q00059','盡忠職守','墨門密探','n0321','洛陽(城鎮)','z03',52,'墨門密探告訴你在東宮附近有一批盡忠職守的禁衛軍正遭到太平妖人的攻擊，建議你去援助，或許能順便得知皇上的下落','皇城內部',NULL,1,0),
 ('q00060','拯救皇上(一)','禁衛軍校尉','n0012','洛陽(城鎮)','z03',53,'被你救出的禁衛軍校尉見你膽識過人希望加入你一同救出皇上，他告訴你皇上目前正被困在御膳圓內，想要救出皇上首先必須殺出一條血路','皇城內部',NULL,1,0),
 ('q00061','拯救皇上(二)','禁衛軍校尉','n0012','洛陽(城鎮)','z03',53,'眼看御膳圓就在眼前，卻被太平妖人擋住，殺','皇城內部',NULL,1,0),
 ('q00062','拯救皇上(三)','禁衛軍校尉','n0012','洛陽(城鎮)','z03',55,'原來為了這次的陰謀，大賢良師的弟弟，人公將軍張梁也混入皇城，為了拯救皇上，必須殺退他們','皇城內部',NULL,1,0),
 ('q00063','黃巾初現','漢靈帝','n0012','洛陽(城鎮)','z03',55,'太平道在青、幽、徐、冀、荊、揚、兗、豫八州鼓動平民造反，人人頭戴黃巾，漢靈帝已經命令中郎將盧植、皇甫嵩、朱俊領兵鎮壓，希望你前去豫州協助平亂','皇城內部',NULL,1,1),
 ('q00064','初戰豫州','皇甫嵩','n0083','豫州府(城鎮)','z04',55,'豫州目前亂成一團，平亂軍將領皇甫嵩希望你先在汝南郡打擊黃巾賊的士氣','汝南郡',NULL,1,0),
 ('q00065','黃巾妖術','皇甫嵩','n0083','豫州府(城鎮)','z04',56,'黃巾賊派出了法力高強的道士困住平亂軍，皇甫嵩派你從黃巾妖道手中強奪天旗、地旗、人旗，破解他們的妖術','汝南郡',NULL,1,0),
 ('q00066','營救中郎將','皇甫嵩','n0083','豫州府(城鎮)','z04',56,'中郎將朱俊一時不察被黃巾副將高升率兵包圍，皇甫嵩希望你衝過包圍網救他脫困','汝南郡',NULL,1,0),
 ('q00067','地公將軍(一)','皇甫嵩','n0083','豫州府(城鎮)','z04',56,'為了擊敗地公將軍張寶，皇甫嵩預計用火攻夜襲敵營，派你前去牽制黃巾守營軍，好讓漢軍有機會點火','汝南郡',NULL,1,0),
 ('q00068','地公將軍(二)','皇甫嵩','n0083','豫州府(城鎮)','z04',57,'火計成功，敵軍出現敗像，皇甫嵩決定稱勝追擊捉拿張寶，派你出戰張寶身邊的護衛隊','汝南郡',NULL,1,0),
 ('q00069','地公將軍(三)','皇甫嵩','n0083','豫州府(城鎮)','z04',57,'眼看黃巾在豫州的軍力不保，張寶決定撤退與張角會合，絕不能讓他跑了','汝南郡',NULL,1,0),
 ('q00070','轉戰兌州','皇甫嵩','n0083','豫州府(城鎮)','z04',60,'雖然張寶被你打的無還手之力，但是靠著妖術依然成功逃逸，不過豫州暫時解除危機，同時兌州傳來人公將軍率眾包圍東郡的消息，皇甫嵩請你與漢軍一同進軍兌州','汝南郡',NULL,1,1),
 ('q00071','黃巾戰將','皇甫嵩','n0083','兌州府(城鎮)','z05',0,'剛進入兌州就遇到黃巾戰將的攻擊，皇甫嵩派你出戰','東郡',NULL,1,0),
 ('q00072','兌州包圍戰','皇甫嵩','n0083','兌州府(城鎮)','z05',61,'狡猾的黃巾賊誘敵深入，讓漢軍集結在陳郡之後再從兌州各地出現包圍，你必須要阻止不讓黃巾賊完成包圍網','東郡',NULL,1,0),
 ('q00073','擊退黃巾援軍','皇甫嵩','n0083','兌州府(城鎮)','z05',62,'眼看黃巾軍節節敗退，為了保住兌州勢力，張角命令鄧茂率援軍協助兌州黃巾軍，你要在他們合流之前先擊退黃巾的援軍','東郡',NULL,1,0),
 ('q00074','再遇人公將軍','皇甫嵩','n0083','兌州府(城鎮)','z05',63,'在兌州領軍的正是當時在洛陽意圖不軌的人公將軍張梁，在戰場上相遇必有一番廝殺','東郡',NULL,1,0),
 ('q00075','兌州揚威','皇甫嵩','n0083','兌州府(城鎮)','z05',64,'人公將軍果然不敵，黃巾軍節節敗退，皇甫嵩命你追擊張梁，讓他不敢在踏入兌州','東郡',NULL,1,0),
 ('q00076','死而不僵','皇甫嵩','n0083','兌州府(城鎮)','z05',64,'地公與人公將軍雙雙敗退，但是消息指出黃巾賊子重新集結在冀州，皇甫嵩暫時需要繼續清除豫州與兌州的殘餘黃巾勢力，命你先行趕往冀州協助中郎將盧植','東郡',NULL,1,1),
 ('q00077','冀州追擊戰','盧植','n0094','冀州府(城鎮)','z06',65,'盧植傳來訊息，各地戰敗的黃巾殘黨紛紛往冀州凝聚，希望你從後追擊，盡量削弱他們的實力','廣宗',NULL,1,0),
 ('q00078','來自董卓的援助','盧植','n0094','冀州府(城鎮)','z06',65,'與你交好的涼州刺史董卓派人傳來訊息，為了避免被漢軍察覺，已有不少黃巾賊假扮成行人，準備聚集在廣宗，盧植命你在廣宗捉拿可疑的行人，看看有多少是黃巾反賊的士兵','廣宗',NULL,1,0),
 ('q00079','太平要術','盧植','n0094','冀州府(城鎮)','z06',65,'在冀州聚集的反賊均是太平道中的精英，尤其是張角直傳的天公道人，人人身懷太平要術摘要，可使出威力強大的妖術，盧植命你斬殺這些天公道人，並奪下他們身上的太平要術摘要','廣宗',NULL,1,0),
 ('q00080','大賢良師','盧植','n0094','冀州府(城鎮)','z06',65,'雖然漢軍神勇，連敗黃巾，但是素有大賢良師之稱的張角身邊卻有不少死士，另漢軍頭痛不已，盧植命你清除這些死忠的太平道中人，打擊黃巾賊的氣勢','廣宗',NULL,1,0),
 ('q00081','恐怖的天公將軍','盧植','n0094','冀州府(城鎮)','z06',68,'張角的太平要術果然厲害，一時間只見戰場上四處都有張角的分身率軍抵抗漢軍的攻擊，盧植希望你能想辦法儘快破去這些分身，以免軍心不穩','廣宗',NULL,1,0),
 ('q00082','義勇軍加入','劉備','h0010','冀州府(城鎮)','z06',70,'師從盧植的劉備前來報訊，一見之下發現原來他就是當初在雍州協助你的大耳少年，如今漢軍威勢正盛，包括董卓、曹操、孫堅等都在各地組成義勇軍加入戰場，劉備自己的結義兄弟也不例外，因為你在戰事中表現優異，希望你能帶著他的三弟張飛協助攻打鉅鹿郡','鉅鹿郡',NULL,1,0),
 ('q00083','搶救董卓','皇甫嵩','n0083','冀州府(城鎮)','z06',71,'義勇軍中的董卓雖然手下兵多將廣，但是因為瞧不起多為平民出身的黃巾賊，不小心被敵人困住，因為之前的情誼你決定出手幫忙','鉅鹿郡',NULL,1,0),
 ('q00084','圍城末日','皇甫嵩','n0083','冀州府(城鎮)','z06',72,'各路義勇軍與漢軍合流，把黃巾賊圍困在鉅鹿郡，皇甫嵩命你攻擊想要突圍的黃巾賊子','鉅鹿郡',NULL,1,0),
 ('q00085','良師惡疾','皇甫嵩','n0083','冀州府(城鎮)','z06',72,'從黃巾突圍軍的口中得知號稱大賢良師的張角似乎得了重病，為了確定消息真偽，皇甫嵩希望你潛入鉅鹿郡探查','鉅鹿郡',NULL,1,0),
 ('q00086','天公隕落','皇甫嵩','n0083','冀州府(城鎮)','z06',73,'經過你的探查，確定了張角的確重病纏身，眾人高興之餘，卻看到滿臉病容的張角出城叫戰，眼見機不可失，皇甫嵩立即派軍出戰','鉅鹿郡',NULL,1,0),
 ('q00087','test','墨雲師父','n0062','墨家邨','z01',1,'test','飛熊山道',NULL,1,0);
/*!40000 ALTER TABLE `a3k_quest` ENABLE KEYS */;


--
-- Definition of table `a3k_quest_award`
--

DROP TABLE IF EXISTS `a3k_quest_award`;
CREATE TABLE `a3k_quest_award` (
  `q_id` varchar(10) character set utf8 NOT NULL default '',
  `award_exp` int(10) default '0',
  `award_money` int(10) default '0',
  `award_item` text collate utf8_unicode_ci,
  `award_point` int(10) default '0',
  `award_fellow` varchar(40) collate utf8_unicode_ci default NULL,
  `award_description` varchar(100) collate utf8_unicode_ci default NULL,
  PRIMARY KEY  (`q_id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `a3k_quest_award`
--

/*!40000 ALTER TABLE `a3k_quest_award` DISABLE KEYS */;
INSERT INTO `a3k_quest_award` (`q_id`,`award_exp`,`award_money`,`award_item`,`award_point`,`award_fellow`,`award_description`) VALUES 
 ('q00001',80,30,'',0,'',''),
 ('q00002',80,50,'',0,'',''),
 ('q00003',80,50,'',0,'',''),
 ('q00004',80,50,'',0,'',''),
 ('q00005',80,50,'',0,'',''),
 ('q00006',80,50,'',0,'',''),
 ('q00007',80,50,'',0,'',''),
 ('q00008',80,50,'',0,'',''),
 ('q00009',80,50,'',0,'',''),
 ('q00010',80,50,'',0,'',''),
 ('q00011',80,50,'',0,'',''),
 ('q00012',80,50,'',0,'',''),
 ('q00013',80,50,'',0,'',''),
 ('q00014',80,50,'',0,'',''),
 ('q00015',80,50,'',0,'',''),
 ('q00016',80,50,'',0,'',''),
 ('q00017',80,50,'',0,'',''),
 ('q00018',80,50,'',0,'',''),
 ('q00019',80,50,'',0,'',''),
 ('q00020',80,50,'',0,'',''),
 ('q00021',80,50,'',0,'',''),
 ('q00022',80,50,'',0,'',''),
 ('q00023',80,50,'',0,'',''),
 ('q00024',80,50,'',0,'',''),
 ('q00025',80,50,'',0,'',''),
 ('q00026',80,50,'',0,'',''),
 ('q00027',80,50,'',0,'',''),
 ('q00028',80,50,'',0,'',''),
 ('q00029',80,50,'',0,'',''),
 ('q00030',80,50,'',0,'',''),
 ('q00031',80,50,'',0,'',''),
 ('q00032',80,50,'',0,'',''),
 ('q00033',80,50,'',0,'',''),
 ('q00034',80,50,'',0,'',''),
 ('q00035',80,50,'',0,'',''),
 ('q00036',80,50,'',0,'',''),
 ('q00037',80,50,'',0,'',''),
 ('q00038',80,50,'',0,'',''),
 ('q00039',80,50,'',0,'',''),
 ('q00040',80,30,'',0,'',''),
 ('q00041',80,30,'',0,'',''),
 ('q00042',80,30,'',0,'',''),
 ('q00043',80,30,'',0,'',''),
 ('q00044',80,30,'',0,'',''),
 ('q00045',80,30,'',0,'',''),
 ('q00046',80,30,'',0,'',''),
 ('q00047',80,30,'',0,'',''),
 ('q00048',80,30,'',0,'',''),
 ('q00049',80,30,'',0,'',''),
 ('q00050',80,30,'',0,'',''),
 ('q00051',80,30,'',0,'',''),
 ('q00052',80,30,'',0,'',''),
 ('q00053',80,30,'',0,'',''),
 ('q00054',80,30,'',0,'',''),
 ('q00055',80,30,'',0,'',''),
 ('q00056',80,30,'',0,'',''),
 ('q00057',80,30,'',0,'',''),
 ('q00058',80,30,'',0,'',''),
 ('q00059',80,30,'',0,'',''),
 ('q00060',80,30,'',0,'',''),
 ('q00061',80,30,'',0,'',''),
 ('q00062',80,30,'',0,'',''),
 ('q00063',80,30,'',0,'',''),
 ('q00064',80,30,'',0,'',''),
 ('q00065',80,30,'',0,'',''),
 ('q00066',80,30,'',0,'',''),
 ('q00067',80,30,'',0,'',''),
 ('q00068',80,30,'',0,'',''),
 ('q00069',80,30,'',0,'',''),
 ('q00070',80,30,'',0,'',''),
 ('q00071',80,30,'',0,'',''),
 ('q00072',80,30,'',0,'',''),
 ('q00073',80,30,'',0,'',''),
 ('q00074',80,30,'',0,'',''),
 ('q00075',80,30,'',0,'',''),
 ('q00076',80,30,'',0,'',''),
 ('q00077',80,30,'',0,'',''),
 ('q00078',80,30,'',0,'',''),
 ('q00079',80,30,'',0,'',''),
 ('q00080',80,30,'',0,'',''),
 ('q00081',80,30,'',0,'',''),
 ('q00082',80,30,'',0,'',''),
 ('q00083',80,30,'',0,'',''),
 ('q00084',80,30,'',0,'',''),
 ('q00085',80,30,'',0,'',''),
 ('q00086',80,30,'',0,'',''),
 ('q00087',100,100,'',0,'','');
/*!40000 ALTER TABLE `a3k_quest_award` ENABLE KEYS */;


--
-- Definition of table `a3k_quest_limit`
--

DROP TABLE IF EXISTS `a3k_quest_limit`;
CREATE TABLE `a3k_quest_limit` (
  `q_id` varchar(10) character set utf8 NOT NULL default '',
  `limit_lv` int(10) default NULL,
  `limit_job` varchar(10) collate utf8_unicode_ci default NULL,
  `limit_item` text collate utf8_unicode_ci,
  `limit_quest` varchar(50) collate utf8_unicode_ci default NULL,
  `limit_description` varchar(100) collate utf8_unicode_ci default NULL,
  PRIMARY KEY  (`q_id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `a3k_quest_limit`
--

/*!40000 ALTER TABLE `a3k_quest_limit` DISABLE KEYS */;
INSERT INTO `a3k_quest_limit` (`q_id`,`limit_lv`,`limit_job`,`limit_item`,`limit_quest`,`limit_description`) VALUES 
 ('q00001',1,'','','',''),
 ('q00002',1,'','','q00001',''),
 ('q00003',1,'','','q00002',''),
 ('q00004',7,'','','q00003',''),
 ('q00005',8,'','','q00004',''),
 ('q00006',9,'','','q00005',''),
 ('q00007',10,'','','q00006',''),
 ('q00008',10,'','','q00007',''),
 ('q00009',11,'','','',''),
 ('q00010',11,'','','q00009',''),
 ('q00011',13,'','','q00010',''),
 ('q00012',13,'','','q00011',''),
 ('q00013',13,'','','q00012',''),
 ('q00014',13,'','','q00013',''),
 ('q00015',13,'','','q00014',''),
 ('q00016',15,'','','q00015',''),
 ('q00017',15,'','','q00016',''),
 ('q00018',17,'','','q00017',''),
 ('q00019',20,'','','q00018',''),
 ('q00020',21,'','','q00019',''),
 ('q00021',21,'','','q00020',''),
 ('q00022',21,'','','q00021',''),
 ('q00023',21,'','','q00022',''),
 ('q00024',23,'','','q00023',''),
 ('q00025',23,'','','q00024',''),
 ('q00026',23,'','','q00025',''),
 ('q00027',25,'','','q00026',''),
 ('q00028',25,'','','q00027',''),
 ('q00029',26,'','','',''),
 ('q00030',26,'','','q00029',''),
 ('q00031',27,'','','q00030',''),
 ('q00032',27,'','','q00031',''),
 ('q00033',28,'','','q00032',''),
 ('q00034',28,'','','q00033',''),
 ('q00035',30,'','','q00034',''),
 ('q00036',30,'','','q00035',''),
 ('q00037',32,'','','q00036',''),
 ('q00038',33,'','','q00037',''),
 ('q00039',36,'','','q00038',''),
 ('q00040',35,'','','q00039',''),
 ('q00041',36,'','','q00040',''),
 ('q00042',37,'','','q00041',''),
 ('q00043',40,'','','q00042',''),
 ('q00044',40,'','','q00043',''),
 ('q00045',41,'','','',''),
 ('q00046',42,'','','q00045',''),
 ('q00047',42,'','','q00046',''),
 ('q00048',42,'','','q00047',''),
 ('q00049',42,'','','q00048',''),
 ('q00050',43,'','','q00049',''),
 ('q00051',46,'','','q00050',''),
 ('q00052',46,'','','q00051',''),
 ('q00053',47,'','','q00052',''),
 ('q00054',47,'','','q00052',''),
 ('q00055',47,'','','q00052',''),
 ('q00056',47,'','','q00052',''),
 ('q00057',47,'','','q00052',''),
 ('q00058',51,'','','q00052',''),
 ('q00059',52,'','','q00058',''),
 ('q00060',53,'','','q00059',''),
 ('q00061',53,'','','q00060',''),
 ('q00062',55,'','','q00061',''),
 ('q00063',55,'','','q00062',''),
 ('q00064',55,'','','',''),
 ('q00065',56,'','','q00064',''),
 ('q00066',56,'','','q00065',''),
 ('q00067',56,'','','q00066',''),
 ('q00068',57,'','','q00067',''),
 ('q00069',57,'','','q00068',''),
 ('q00070',60,'','','q00069',''),
 ('q00071',60,'','','',''),
 ('q00072',61,'','','q00071',''),
 ('q00073',62,'','','q00072',''),
 ('q00074',63,'','','q00073',''),
 ('q00075',64,'','','q00074',''),
 ('q00076',65,'','','q00075',''),
 ('q00077',65,'','','',''),
 ('q00078',65,'','','q00077',''),
 ('q00079',66,'','','q00078',''),
 ('q00080',67,'','','q00079',''),
 ('q00081',68,'','','q00080',''),
 ('q00082',70,'','','',''),
 ('q00083',71,'','','q00082',''),
 ('q00084',72,'','','q00083',''),
 ('q00085',72,'','','q00084',''),
 ('q00086',73,'','','q00085',''),
 ('q00087',1,'','','','');
/*!40000 ALTER TABLE `a3k_quest_limit` ENABLE KEYS */;


--
-- Definition of table `a3k_quest_need`
--

DROP TABLE IF EXISTS `a3k_quest_need`;
CREATE TABLE `a3k_quest_need` (
  `q_id` varchar(10) character set utf8 NOT NULL default '',
  `need_monster` varchar(60) collate utf8_unicode_ci default NULL,
  `need_fight` varchar(40) collate utf8_unicode_ci default NULL,
  `need_item` text collate utf8_unicode_ci,
  `need_description` varchar(100) collate utf8_unicode_ci default NULL,
  PRIMARY KEY  (`q_id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `a3k_quest_need`
--

/*!40000 ALTER TABLE `a3k_quest_need` DISABLE KEYS */;
INSERT INTO `a3k_quest_need` (`q_id`,`need_monster`,`need_fight`,`need_item`,`need_description`) VALUES 
 ('q00001','','a01:10','',''),
 ('q00002','a01002:3','','',''),
 ('q00003','a02001:5','','',''),
 ('q00004','','a02:10','',''),
 ('q00005','','','',''),
 ('q00006','','','i0001:5',''),
 ('q00007','a02002:5','','',''),
 ('q00008','','','i0002:1',''),
 ('q00009','','','i0003:3',''),
 ('q00010','a03001:5','','',''),
 ('q00011','a03002:5,a03003:3','','',''),
 ('q00012','a03003:5,a03004:3','','',''),
 ('q00013','a03004:5,a03005:1','','',''),
 ('q00014','a03004:8,a03006:1','','',''),
 ('q00015','','','',''),
 ('q00016','a04001:5','','',''),
 ('q00017','a04001:10','','',''),
 ('q00018','','','i0004:5',''),
 ('q00019','a04003:8','','',''),
 ('q00020','a04004:10','','',''),
 ('q00021','a04007:1,a04006:3,a04005:10','','',''),
 ('q00022','','a05:10','',''),
 ('q00023','','','i0005:1,i0006:1',''),
 ('q00024','a05002:5,a05003:5','','',''),
 ('q00025','','','i0007:1,i0008:1',''),
 ('q00026','a05005:5,a05006:5','','',''),
 ('q00027','','','i0009:1',''),
 ('q00028','','','',''),
 ('q00029','','','i0010:5',''),
 ('q00030','b01003:8,b01004:5','','',''),
 ('q00031','','b01:20','',''),
 ('q00032','','','i0012:5',''),
 ('q00033','b01006:10','','',''),
 ('q00034','','','i0013:10',''),
 ('q00035','','b02:20','',''),
 ('q00036','','','i0014:3',''),
 ('q00037','b02002:3,b02003:1','','',''),
 ('q00038','b02004:10,b02005:1','','',''),
 ('q00039','','b03:20','',''),
 ('q00040','b03001:10','','',''),
 ('q00041','','','i0015:5,i0016:5',''),
 ('q00042','','b03:15','',''),
 ('q00043','b03003:10,b03004:1','','',''),
 ('q00044','','','',''),
 ('q00045','','c01:15','',''),
 ('q00046','','','i0017:1,i0018:1',''),
 ('q00047','','','i0019:10',''),
 ('q00048','','','',''),
 ('q00049','c01003:10,c01004:10','','',''),
 ('q00050','','','i0020:1',''),
 ('q00051','','','i0021:1,i0022:10',''),
 ('q00052','','c02:20','',''),
 ('q00053','c02003:1,c02004:1','','',''),
 ('q00054','c02005:1,c02006:1','','',''),
 ('q00055','c02007:1,c02008:1','','',''),
 ('q00056','c02009:1,c02010:1','','',''),
 ('q00057','c02011:1,c02012:1','','',''),
 ('q00058','','c03:20','',''),
 ('q00059','c03001:10,c03002:10','','',''),
 ('q00060','','c03:25','',''),
 ('q00061','c03002:10,c03003:10','','',''),
 ('q00062','c03002:10,c03004:10,c03005:1','','',''),
 ('q00063','','','',''),
 ('q00064','','d01:20','',''),
 ('q00065','','','i0023:3,i0024:3,i0025:3',''),
 ('q00066','d01001:10,d01002:5,d01003:1','','',''),
 ('q00067','d01004:10,d01005:5','','',''),
 ('q00068','d01006:10,d01007:8','','',''),
 ('q00069','d01007:10,d01008:3','','',''),
 ('q00070','','','',''),
 ('q00071','e01001:10','','',''),
 ('q00072','','e01:20','',''),
 ('q00073','e01002:10,e01003:5,e01004:1','','',''),
 ('q00074','e01005:8,e01006:1','','',''),
 ('q00075','','','i0026:3',''),
 ('q00076','','','',''),
 ('q00077','','f01:20','',''),
 ('q00078','','','i0027:10',''),
 ('q00079','','','i0028:10',''),
 ('q00080','f01003:10,f01004:15','','',''),
 ('q00081','f01005:5','','',''),
 ('q00082','','f02:20','',''),
 ('q00083','f02001:30','','',''),
 ('q00084','f02001:10,f02002:10,f02003:10','','',''),
 ('q00085','f02001:10,f02004:10,f02005:10','','',''),
 ('q00086','f02005:10,f02006:10,f02007:1','','',''),
 ('q00087','','','i0001:3,i0002:2','');
/*!40000 ALTER TABLE `a3k_quest_need` ENABLE KEYS */;


--
-- Definition of table `a3k_quest_status`
--

DROP TABLE IF EXISTS `a3k_quest_status`;
CREATE TABLE `a3k_quest_status` (
  `p_id` varchar(10) NOT NULL default '',
  `q_id` varchar(10) NOT NULL default '',
  `q_status` tinyint(3) default NULL,
  `q_data` text,
  `q_end_time` int(10) default NULL,
  PRIMARY KEY  (`p_id`,`q_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `a3k_quest_status`
--

/*!40000 ALTER TABLE `a3k_quest_status` DISABLE KEYS */;
/*!40000 ALTER TABLE `a3k_quest_status` ENABLE KEYS */;


--
-- Definition of table `a3k_quest_time`
--

DROP TABLE IF EXISTS `a3k_quest_time`;
CREATE TABLE `a3k_quest_time` (
  `q_id` varchar(10) default NULL,
  `q_week` tinyint(3) unsigned default NULL,
  `q_hour` mediumint(8) unsigned default NULL,
  KEY `q_id` (`q_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `a3k_quest_time`
--

/*!40000 ALTER TABLE `a3k_quest_time` DISABLE KEYS */;
/*!40000 ALTER TABLE `a3k_quest_time` ENABLE KEYS */;


--
-- Definition of table `a3k_referral_award`
--

DROP TABLE IF EXISTS `a3k_referral_award`;
CREATE TABLE `a3k_referral_award` (
  `id` int(11) NOT NULL auto_increment,
  `next_ref` int(3) NOT NULL,
  `award_itemid` varchar(10) NOT NULL,
  `award_item_no` int(2) NOT NULL default '1',
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=11 DEFAULT CHARSET=utf8;

--
-- Dumping data for table `a3k_referral_award`
--

/*!40000 ALTER TABLE `a3k_referral_award` DISABLE KEYS */;
INSERT INTO `a3k_referral_award` (`id`,`next_ref`,`award_itemid`,`award_item_no`) VALUES 
 (1,1,'h0002',1),
 (2,3,'h0002',2),
 (3,5,'h0002',3),
 (4,10,'h0002',4),
 (5,15,'h0002',5),
 (6,20,'h0002',6),
 (7,30,'h0002',7),
 (8,35,'h0002',8),
 (9,45,'h0002',9),
 (10,50,'h0002',10);
/*!40000 ALTER TABLE `a3k_referral_award` ENABLE KEYS */;


--
-- Definition of table `a3k_role`
--

DROP TABLE IF EXISTS `a3k_role`;
CREATE TABLE `a3k_role` (
  `id` int(10) unsigned NOT NULL auto_increment,
  `role_id` varchar(45) NOT NULL COMMENT '職業id',
  `role_name` varchar(45) NOT NULL COMMENT '職業名稱',
  `role_skillpointmax` int(10) unsigned NOT NULL default '0' COMMENT '熟練度場次',
  `role_parentid` varchar(45) NOT NULL default '' COMMENT '父系職業ID',
  `role_lmt_lvl` int(10) unsigned NOT NULL default '0' COMMENT '等級限制',
  `role_lmt_str` int(10) unsigned NOT NULL default '0' COMMENT '力量限制',
  `role_lmt_bone` int(11) NOT NULL default '0' COMMENT '根骨限制',
  `role_lmt_agl` int(10) unsigned NOT NULL default '0' COMMENT '速度限制',
  `role_lmt_smart` int(10) unsigned NOT NULL default '0' COMMENT '智力限制',
  `role_lmt_vit` int(10) unsigned NOT NULL default '0' COMMENT '體魄限制',
  `role_skill_str_init` int(10) unsigned NOT NULL default '0' COMMENT 'skill提昇力量init',
  `role_skill_str_max` int(10) unsigned NOT NULL default '0' COMMENT 'skill提昇力量max',
  `role_skill_bone_init` int(10) unsigned NOT NULL default '0' COMMENT 'skill提昇根骨init',
  `role_skill_bone_max` int(10) unsigned NOT NULL default '0' COMMENT 'skill提昇根骨max',
  `role_skill_agl_init` int(10) unsigned NOT NULL default '0' COMMENT 'skill提昇速度init',
  `role_skill_agl_max` int(10) unsigned NOT NULL default '0' COMMENT 'skill提昇速度max',
  `role_skill_smart_init` int(10) unsigned NOT NULL default '0' COMMENT 'skill提昇智力init',
  `role_skill_smart_max` int(10) unsigned NOT NULL default '0' COMMENT 'skill提昇智力max',
  `role_skill_vit_init` int(10) unsigned NOT NULL default '0' COMMENT 'skill提昇體魄init',
  `role_skill_vit_max` int(10) unsigned NOT NULL default '0' COMMENT 'skill提昇體魄max',
  `role_skillname` varchar(45) default NULL COMMENT 'skill 名稱',
  `role_descri` varchar(500) default NULL COMMENT '職業的介紹',
  `role_theegg` varchar(45) NOT NULL default '0' COMMENT '職業的頭',
  `role_parentname` varchar(45) default NULL COMMENT '父系職業name',
  `role_img` varchar(45) NOT NULL default '' COMMENT '職業圖',
  `role_skillimg` varchar(45) NOT NULL default '' COMMENT '技能圖',
  `skill_default_turns` tinyint(10) unsigned NOT NULL default '1' COMMENT '技能初始影響回合數',
  `skill_active` tinyint(1) unsigned NOT NULL default '0' COMMENT '技能 0主動1被動',
  `skill_type` varchar(45) NOT NULL default '-' COMMENT '技能種類',
  `skill_animat_img` varchar(10) default NULL COMMENT '技能 特效 圖',
  `skill_descr` varchar(45) NOT NULL default '--' COMMENT '技能說明',
  PRIMARY KEY  USING BTREE (`id`),
  KEY `role_id` (`role_id`)
) ENGINE=MyISAM AUTO_INCREMENT=25 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC COMMENT='職業表; InnoDB free: 11264 kB';

--
-- Dumping data for table `a3k_role`
--

/*!40000 ALTER TABLE `a3k_role` DISABLE KEYS */;
INSERT INTO `a3k_role` (`id`,`role_id`,`role_name`,`role_skillpointmax`,`role_parentid`,`role_lmt_lvl`,`role_lmt_str`,`role_lmt_bone`,`role_lmt_agl`,`role_lmt_smart`,`role_lmt_vit`,`role_skill_str_init`,`role_skill_str_max`,`role_skill_bone_init`,`role_skill_bone_max`,`role_skill_agl_init`,`role_skill_agl_max`,`role_skill_smart_init`,`role_skill_smart_max`,`role_skill_vit_init`,`role_skill_vit_max`,`role_skillname`,`role_descri`,`role_theegg`,`role_parentname`,`role_img`,`role_skillimg`,`skill_default_turns`,`skill_active`,`skill_type`,`skill_animat_img`,`skill_descr`) VALUES 
 (1,'a01','俠客',50,'0',1,1,1,1,1,1,1,3,1,2,1,3,1,2,1,2,'強襲','學習武功為主的墨門弟子，升級時最多可提昇屬性（力量：3、智力：2、敏捷：3、體質：2、根骨：2）','a01','無','m3002','n1001',1,0,'addattack','e03','所有墨家子弟學會的最初技能，能發揮自身潛能造成較大的傷害'),
 (2,'b01','秀才',50,'0',1,1,1,1,1,1,1,2,0,2,1,2,1,3,0,2,'強襲','學習計謀為主的墨門弟子，升級時最多可提昇屬性（力量：1、智力：3、敏捷：2、體質：2、根骨：2）','b01','無','m1001','n1001',1,0,'addattack','e03','所有墨家子弟學會的最初技能，能發揮自身潛能造成較大的傷害'),
 (3,'c01','校衛',50,'0',1,1,1,1,1,1,1,3,1,2,0,2,0,1,1,3,'強襲','學習兵法為主的墨門弟子，升級時最多可提昇屬性（力量：3、智力：1、敏捷：2、體質：3、根骨：2）','c01','無','m2001','n1001',1,0,'addattack','e03','所有墨家子弟學會的最初技能，能發揮自身潛能造成較大的傷害'),
 (4,'a02','劍客',100,'a01',10,20,12,12,12,12,2,3,1,2,1,3,1,2,1,2,'施毒','專研劍法的俠客，升級時最多可提昇屬性（力量：3、智力：2、敏捷：3、體質：2、根骨：2）','a01','俠客','m3003','n008',3,0,'poison','e03','讓敵人中毒'),
 (5,'a03','道士',100,'a01',10,20,12,12,12,12,1,2,1,3,0,2,1,2,1,3,'回血','學習計謀的俠客，升級時最多可提昇屬性（力量：2、智力：2、敏捷：2、體質：2、根骨：2）','a01','俠客','m1005','n009',1,0,'getHP','e03','使敵方混亂'),
 (6,'b02','參謀',100,'b01',10,12,12,12,20,12,0,2,1,2,1,2,1,2,1,2,'定身','專研謀略的秀才，升級時最多可提昇屬性（力量：1、智力：3、敏捷：2、體質：2、根骨：2）','b01','秀才','m1002','n002',1,1,'dodge','e03','使敵人無法動彈'),
 (7,'b03','辯士',100,'b01',10,12,12,12,20,12,0,1,1,2,0,2,1,3,0,2,'混亂','學習兵法的秀才，升級時最多可提昇屬性（力量：3、智力：2、敏捷：2、體質：2、根骨：2）','b01','秀才','m1003','n003',1,0,'toConfuse','e03','俠客學會的技能'),
 (8,'c02','先鋒營',100,'c01',10,12,12,12,12,20,2,3,1,2,1,2,1,2,1,2,'必殺','專研兵法的校尉，升級時最多可提昇屬性（力量：3、智力：2、敏捷：2、體質：2、根骨：2）','c01','校衛','m2003','n005',1,1,'tokill','e03','增加必殺攻擊機率'),
 (9,'c03','鐵甲營',100,'c01',10,12,12,12,12,20,1,3,1,3,1,2,1,2,1,3,'反彈','學習武功的校尉，升級時最多可提昇屬性（力量：3、智力：2、敏捷：2、體質：3、根骨：3）','c01','校衛','m2002','n006',5,0,'multiply','e03','連擊'),
 (10,'a04','強襲',3,'a01',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,'強襲','強襲','a01','俠客','icon_2','n007',1,0,'addattack','e03','強襲'),
 (11,'a05','必殺',1,'a01',1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,'必殺','必殺','a01','俠客','icon_2','n001',1,1,'tokill','e03','必殺'),
 (12,'a06','虛弱',1,'a01',1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,'虛弱','虛弱','a01','俠客','icon_2','n004',5,0,'weaken','e03','虛弱'),
 (13,'a07','施毒',1,'a01',1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,'施毒','施毒','a01','俠客','icon_2','n008',3,0,'poison','e03','施毒'),
 (14,'a08','閃避',1,'a01',1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,'閃避','閃避','a01','俠客','icon_2','n009',1,1,'dodge','e03','閃避'),
 (15,'a09','連擊',1,'a01',1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,'連擊','連擊','a01','俠客','icon_2','n002',5,0,'multiply','e03','連擊'),
 (16,'a10','武將',1,'a01',1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,'武將','武將','a01','俠客','icon_2','n003',3,0,'fellowgain','e03','武將'),
 (17,'a11','定身',1,'a01',1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,'定身','定身','a01','俠客','icon_2','n005',1,0,'tofreeze','e03','定身'),
 (18,'a12','反彈',1,'a01',1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,'反彈','反彈','a01','俠客','icon_2','n006',5,0,'tobunceback','e03','反彈'),
 (19,'a13','減傷',1,'a01',1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,'減傷','減傷','a01','俠客','icon_2','n007',3,0,'deductDamage','e03','減傷'),
 (20,'a14','回血',1,'a01',1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,'回血','回血','a01','俠客','icon_2','n001',1,0,'getHP','e03','回血'),
 (21,'a15','自爆',1,'a01',1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,'自爆','自爆','a01','俠客','icon_2','n004',1,0,'toNuc','e03','自爆'),
 (22,'a16','混亂',1,'a01',1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,'混亂','混亂','a01','俠客','icon_2','n008',1,0,'toConfuse','e03','混亂'),
 (23,'a17','吸血',1,'a01',1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,'吸血','吸血','a01','俠客','icon_2','n009',1,0,'toGetHP','e03','吸血'),
 (24,'a18','反間',1,'a01',1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,'反間','反間','a01','俠客','icon_2','n002',1,0,'toSuic','e03','反間');
/*!40000 ALTER TABLE `a3k_role` ENABLE KEYS */;


--
-- Definition of table `a3k_shortcut`
--

DROP TABLE IF EXISTS `a3k_shortcut`;
CREATE TABLE `a3k_shortcut` (
  `sc_id` int(10) unsigned NOT NULL auto_increment COMMENT 'id',
  `p_id` varchar(45) NOT NULL COMMENT '玩家id',
  `sc_pos` varchar(45) NOT NULL default '0' COMMENT '快捷位子',
  `sc_type` varchar(45) NOT NULL default '0' COMMENT '快捷內容種類(1:skill / 2:item)',
  `sc_status` tinyint(1) NOT NULL default '0' COMMENT '快捷''狀態(1:clicked/0:not)',
  `sc_type_id` varchar(45) NOT NULL COMMENT '快捷內容id',
  `sc_img` varchar(45) NOT NULL default ' ' COMMENT '快捷圖',
  `sc_usename` varchar(45) NOT NULL default ' ' COMMENT '快捷內容名子',
  PRIMARY KEY  (`sc_id`),
  KEY `p_id` (`p_id`),
  KEY `sc_pos` (`sc_pos`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC COMMENT='玩家快捷';

--
-- Dumping data for table `a3k_shortcut`
--

/*!40000 ALTER TABLE `a3k_shortcut` DISABLE KEYS */;
/*!40000 ALTER TABLE `a3k_shortcut` ENABLE KEYS */;


--
-- Definition of table `a3k_skill`
--

DROP TABLE IF EXISTS `a3k_skill`;
CREATE TABLE `a3k_skill` (
  `skill_id` int(10) unsigned NOT NULL auto_increment,
  `role_id` varchar(45) NOT NULL default '0' COMMENT '職業id',
  `user_id` int(10) unsigned NOT NULL default '0' COMMENT '玩家id',
  `skill_point` int(10) unsigned NOT NULL default '0' COMMENT '技能/職業熟練度',
  `role_skillpointmax` int(10) unsigned NOT NULL default '0' COMMENT '熟練度需要場次',
  `skill_lvl` int(45) NOT NULL default '1' COMMENT '技能等級',
  `skill_type` varchar(45) NOT NULL default '0' COMMENT '技能種類',
  `skill_effect_turns` int(10) unsigned NOT NULL default '0' COMMENT '技能影響次數',
  `skill_active` tinyint(3) unsigned NOT NULL default '0' COMMENT '0主動1被動',
  `skill_default_turns` tinyint(10) unsigned NOT NULL default '1' COMMENT '技能初始影響回合數',
  `skill_img` varchar(10) default NULL COMMENT '技能 icon 圖',
  `skill_animat_img` varchar(10) default NULL COMMENT '技能 特效 圖',
  `skill_name` varchar(45) default NULL COMMENT '技能名子',
  `skill_descr` varchar(45) NOT NULL default '--' COMMENT '技能說明',
  PRIMARY KEY  (`skill_id`),
  KEY `user_id` (`user_id`),
  KEY `skill_active` (`skill_active`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC COMMENT='玩家技能';

--
-- Dumping data for table `a3k_skill`
--

/*!40000 ALTER TABLE `a3k_skill` DISABLE KEYS */;
/*!40000 ALTER TABLE `a3k_skill` ENABLE KEYS */;


--
-- Definition of table `chat`
--

DROP TABLE IF EXISTS `chat`;
CREATE TABLE `chat` (
  `id` int(10) unsigned NOT NULL auto_increment,
  `content` varchar(21000) default NULL,
  `cfrom` varchar(45) default NULL,
  `cto` varchar(45) default NULL,
  `guid` varchar(45) default NULL,
  `comment` tinyint(3) default NULL,
  `timestamp` timestamp NOT NULL default CURRENT_TIMESTAMP,
  PRIMARY KEY  (`id`)
) ENGINE=MEMORY DEFAULT CHARSET=utf8;

--
-- Dumping data for table `chat`
--

/*!40000 ALTER TABLE `chat` DISABLE KEYS */;
/*!40000 ALTER TABLE `chat` ENABLE KEYS */;


--
-- Definition of table `chatbk`
--

DROP TABLE IF EXISTS `chatbk`;
CREATE TABLE `chatbk` (
  `id` int(10) unsigned NOT NULL auto_increment,
  `content` varchar(21000) default NULL,
  `cfrom` varchar(45) default NULL,
  `cto` varchar(45) default NULL,
  `guid` varchar(45) default NULL,
  `comment` tinyint(3) default NULL,
  `timestamp` timestamp NOT NULL default CURRENT_TIMESTAMP,
  PRIMARY KEY  (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `chatbk`
--

/*!40000 ALTER TABLE `chatbk` DISABLE KEYS */;
/*!40000 ALTER TABLE `chatbk` ENABLE KEYS */;


--
-- Definition of table `chatindex`
--

DROP TABLE IF EXISTS `chatindex`;
CREATE TABLE `chatindex` (
  `cindextime` int(10) NOT NULL default '0',
  `timestamp` timestamp NOT NULL default CURRENT_TIMESTAMP,
  PRIMARY KEY  (`cindextime`)
) ENGINE=MEMORY DEFAULT CHARSET=utf8;

--
-- Dumping data for table `chatindex`
--

/*!40000 ALTER TABLE `chatindex` DISABLE KEYS */;
/*!40000 ALTER TABLE `chatindex` ENABLE KEYS */;




/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
